[
{"title": "I'd like to know ROS-Industrial news article related to famous companies", "thread_contents": ["Hello,", "I’m looking for an example projects for ROS-I used by world wide famous companies.", "\nFor example, an web article title, Sieamens used ROS-I for * project, is the one I’d like to find.", "Our team is now considering ROS-Industrial to use in our automated factory(FA) system,", "\nbut our client is asking such example to see ROS-Industrial is already used not only in academic but also business.", "\nSo if you know, could you share such information?", "Best regards,", "Yamanaka", "I would like to start by prefacing that end users deploying ROS/ROS-I into their factories is often a proprietary activity. There are a number of ROS based solutions in production, but it is up to the end using entity to choose to disclose what they have done and how it is doing.", "That being said, we have a number of partners that have either directly indicated their successes or indirectly. The first is Bastian Solutions. They have a new Mobile Picking Robot that is based on ROS-I, and the package Euler that is in the swri-robotics repo(", "). An overview can be found here: ", "Bastian also presented recently at the RIC Americas Annual Meeting and that presentation can be found here: ", "We also have a client that has had a ROS-I based system in production now for nearly 3 years, leveraging the Scan-N-Plan framework. I’m not at liberty to discuss the details, but it is a high mix painting system where the parts are hung on a conveyor and go past a 3D sensor the data is processed, process paths planned, and then the robot executes the process paths on the part leveraging the conveyor encoded data.", "Another reference that implies indirectly the maturity is the Robotic Blending Focused Technical Project. This work has been sponsored by industry partners, and it is then up to their teams in how they leverage the capability.", "There are a number of other examples, but due to the nature of manufacturing IP, and how companies choose to leverage technology to drive their differentiation, I’m sure you can understand why they are hesitant to be overly public.", "That being said, DHL has this video where they discuss leveraging Fetch Robotics’s solutions to streamline operations.", "ROS as a framework for robotics is well proven. There are many other commercially available platforms that are delivering value today. Myself and I’m sure my colleagues are confident should you decide to settle on ROS/ROS-I as a developmental framework, at minimum you will realize proof of concept capability quickly, and with proper due diligence can be delivering capability in a manufacturing context.", "Looking forward to your feedback or others’ takes!", "Matt R.", "\nROS-I Americas Program Manager", "Thank you very much, Mr. Matt.", "\nYour kind answer is helpful to us.", "I was honestly surprised about the amount of information you kindly provided to me.", "\nYes, I understand that the information is often time hidden in companies.", "\nThus, I appreciate your answer with giving us a lots.", "\nWe will study from it.", "Best regards,", "Yamanaka", "Hi Yamanaka,", "\nhave a look at this Tweet by Joe Speed, where he features a presentation of Boeing about why they are using ROS-I : ", "\nMay be you can ask him more about it.", "Last year, I have been to a ROS Industrial meeting in the Netherlands. The program is available at: ", " You could try to contact the people from Lely, Alten and VDL ETG who presented there. They presented projects they were working on. Moreover, on the website of the ROS Industrial consortium there is a list with partners: ", ".", "Hello Yamanaka,", "if you are still in need of more articles, II would like to recommend you this article on ", " or watch the talks and read the blog posts on the ROS-Industrial Conference 2018", "Best regards", "\nThilo", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Session 1 (Day 1) in this ", " and this ", ",", "Session 2 (Day 2) in this ", " and this ", ",", "Session 3 (Day2) in this ", " and this ", ",", "Session 4 (Day3) in this ", " and this ", "."], "url": "https://discourse.ros.org/t/id-like-to-know-ros-industrial-news-article-related-to-famous-companies/4217"},
{"title": "Best Practice for using RobotStudio with Git and ROS", "thread_contents": ["Most ROS development uses git as the Version Control System (VCS) of choice.  There are well-established guidelines for developing typical ROS applications with git.  However, I have not been able to find any with regard to the development of ABB robotics systems using robot studio.", "Source code control, as we know it, does not seem to be standard practice in the industrial automation world.  Traditional methods of full backing up the full system with a version or timestamps seem more common.", "I suspect that I will need to develop custom RAPID scripts in addition to the provided ", ".  There are also system params and other configuration that might be useful to store in git.", "Is the above repo the recommended way?  Manage rapid files in git and then copy and paste those in and out of the git repo to the robotstudio/robot.  Are there any best development practices for controlling industrial robotic code? Or any other example github repositories that demonstrate how to organize robotic code?", "Thanks!", "The following is my preferred way of developing applications, that are meant to be shared with others, for ABB IRC5 robot controllers.", "I usually create ", " and they allow you to cover several aspects via a single component, including:", "ABB Robotics provides a tool called ", " for creating such Add-Ins, and it creates project folders which can for example be put in a git repository if you want.", "In my opinion, then the main benefits of these Add-Ins are that they simplify the distribution and installation process, as well as that they give you control of how and what is installed in the robot controller system. The biggest drawback is that it might take some time to get used to working with them.", "Thanks ", ",", "I played around with the tool a bit this morning.  I can certainly see how this would be the proper solution for the distribution of your system once it has been developed.  I will have to experiment with it during the development workflow to see how it fits in.", "Thanks for the input!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["RAPID modules.", "System configurations.", "Installation scripts for customizing how and which RAPID modules and system configurations are loaded. Can for example depend on if a specific RobotWare option is present in the system or not.", "Specifying dependencies on certain RobotWare options/robots.", "Specifying conflicts with certain RobotWare options/robots.", "Specifying sub options for the Add-In (can be considered in the installation script).", "Specifying if the Add-In is open or if it requires a license.", "Simplifying distribution and installation.", "Documentation."], "url": "https://discourse.ros.org/t/best-practice-for-using-robotstudio-with-git-and-ros/8155"},
{"title": "Announcement: ros_control RobotStatus publisher", "thread_contents": ["(as this is rather ROS-I specific I opted to post this here instead of over in the ", " category)", "Various robot drivers in ROS-Industrial periodically publish ", " messages that encode controller/robot state (ie: e-stop active, is the robot in motion, etc). For drivers that build on-top of ", ", publishing these messages is typically done by the ", " part of the stack, but that always seemed like a work-around to me.", "As I needed it for a ", "-based driver recently, I decided to write a ", " robot status controller that can be configured similar to the ", " and takes on the responsibility of publishing ", " messages, so ", " implementations don’t need to do that any more. This separates responsibilities and reduces complexity of ", "s.", "The controller may be found here: ", " and the readme explains how to integrate it into a ", " for a specific robot and how to add it to a configuration. I’m hosting it on my personal account for now, but that may change in the future.", "Note: in case you’re wondering: the ", " does not actually ", " anything. The name follows the (unfortunate) convention in ", " to call everything that derives from ", " a ", " (such as the ", " which publishes ", " messages).", "Nice! I have been running into the same problem, and solving it for our specific situation. Better to have a generic solution.", "Small update: I’ve just released the package through the ROS buildfarm into ROS Kinetic.", "Building from source should not longer be necessary (for users of ROS Kinetic).", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/announcement-ros-control-robotstatus-publisher/8170"},
{"title": "Universal Robot Calibration WIP PR Seeking Comment", "thread_contents": ["Felix Mauch, in support of the UR Driver development that is part of the ROSin initiative has submitted a WIP PR that looks at updating the description with the calibration on the UR Controller more directly. The PR can be viewed here with a detailed description and explicit feedback with regards to implementation.", "There has over time been significant interest in UR driver and performance, so in an effort to make this request as visible as possible, I figured I would cross post this here on Discourse. Thanks to Gijs van der Hoorn for bringing this PR to our attention at our ROS-I Consortium Leadership meeting today.", "Thanks!", "Matt R.", "\nROS-I Consortium Americas", "\nProgram Manager", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/universal-robot-calibration-wip-pr-seeking-comment/8768"},
{"title": "ROS-I Americas Consortium Annual Meeting", "thread_contents": ["On April 12th, in Chicago, IL the ROS-Industrial Consortium Americas will host their annual meeting. This will be immediately following Automate 2019, so if you are attending Automate, then consider staying over for the Consortium Annual Meeting! This is a members only event, as it is an opportunity to learn some of the latest developments going on relative to ROS-Industrial, network with others with an interest in open-source development for industry, and finally influence the technical direction of ROS-Industrial through the various workshops and brainstorming workshops.", "The agenda is now up over at ", " and can be found at: ", "As per tradition we will make streaming services available for members that cannot attend in person and that info will be available as the event draws closer.", "Thanks, and look forward to seeing a great turnout in Chicago!", "Matt R.", "\nRIC Americas Program Manager", "Pretty nice program ", ", thanks for sharing!", "Is there room for further participation and contributions? As you may know, our group is posting MoveIt! motion planning framework to ROS 2. We are supporting PickNik financially to help us steer the process and we’d be happy speaking about the process, giving an update on the roadmap and maybe producing some early demonstration? (Will depend heavily on the progress though)", " what do you think? Maybe we could organize a joint speech about it and give the audience an update?", "Hi ", ",", "As the CTO of Acutronic Robotics, I’m also involved in the development/porting of MoveIT! to ROS 2.0. I will be really happy if we have the chance to talk about this in the meeting. Moreover, I volunteer to give a talk about modular robotics. Acutronic Robotics focuses on building individual modules that natively run ROS 2.0. These modules can be physically extended in a seamless manner and include features such as time synchronization or deterministic communication latencies.", "I have seen that the agenda is closed, but if there is room for changes please let us know!", "With kind regards,", "I would like to thank both of you for volunteering to support our Annual Member Meeting coming up in April, and we are excited and have been monitoring what you have noted in your posts. That said, our agenda is pretty dense, as we only have the one day. The years we do not co-locate at Automate we have a bit more flexibility. That said, I’m seeking to bring back the quarterly community meeting where these topics can be presented to industrial stakeholders around the world. Our Americas membership sometimes falls behind on the activities going on in Europe even though myself and of course our partners at Fraunhofer do their best to keep the channels of communication open.", "If you would be willing to support our community meeting, I’m happy and look forward to counting on you both for that agenda as we pull it together. I’m also open to less informal opportunities if you are at Automate to engage with our membership, I just don’t have the space to accommodate more “formal” speaking slots at this time.", "Thanks again, and I look forward to catching up with both of you! Keep up the great work!", "Matt R.", "\nRIC-A Program Manager", "Thanks ", ", let me PM you and discuss the possibilities then.", "I like the idea of a roadmapping workshop. That’s a pretty useful thing to do.", "The history around ROS-I Roadmapping can be found here: ", "We look forward to publishing some of the feedback from the 2018 meeting soon, to enable building on that for the upcoming meeting.", "We have a new and updated revision of the agenda for the April 12th ROS-I Consortium Americas Annual Meeting!", "536.40 KB", "We are also finalizing our streaming services to support remote attendance. I’ll update this space when that information become available!", "We have our full program for the 2019 RIC-Americas Annual Meeting in Chicago on April 12th. We will be reviewing roadmap for ROS-I outputs and have a follow on road mapping workshop. In the program you can see the abstracts and bios for all the speakers.", "2.72 MB", "Looking forward to a great event. We will finalize streaming info for the event on April 3rd and members will receive instructions on how to participate remotely.", "Regards,", "Matt R", "\nRIC Americas Program Manager", "Thanks to everyone that supported and helped make the ROS-I Consortium Americas 2019 Annual Meeting a success. We had over 90 people in our room that was billed to hold 92, so talk about close calls. There were a lot of interesting discussions, and for those that were there, or listened in remotely, it seems a lot of projects may jump into ROS2 from the industrial side.", "We will be posting presentations and the recordings for the presentations behind the Americas member portal over at ", ". In the meantime, I did throw up a blog post that breaks down what took place…", "Thanks!", "Matt Robinson", "\nROS-I Consortium Americas Program Manager", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-i-americas-consortium-annual-meeting/7833"},
{"title": "RFC: new REP draft: Coordinate Frames for Serial Industrial Manipulators", "thread_contents": ["For about two years now I’ve worked (on-and-off) on a new REP attempting to standardise a small number of TF frames / ", "s in ", "s and ", "s of industrial robots. There are already REPs defining standard coordinate frames for ", " and ", ", but nothing for industrial robots so far.", "Many robot models in repositories on the ", " organisation already have some of these frames, and those were added based on their utility and the experiences of the authors of those models, but their addition has been ad-hoc and it made sense to capture the rationales for them in a single document so we can try to work towards standardising these frames across all repositories and robot models.", "As this is a REP that deals with a topic in the context of industrial robots, I wanted to see whether a pre-review or RFC for this REP could work here in the ", " category.", "The REP in its current state can be found here: ", ". A rendered version (for easier reading) is available here: ", ". For easier commenting and discussion, I’ve opened a draft PR (targeted at my own fork of ", ") here: ", ".", "A previous review of this REP may be found here: ", ". Quite a few things have changed since then, but the comments on that PR might still be insightful.", "I would appreciate any and all comments on the REP.", "After this “internal” review, I plan to submit the REP to ", " in the second or third week of May.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/rfc-new-rep-draft-coordinate-frames-for-serial-industrial-manipulators/8951"},
{"title": "ROS-I Consortium Americas Training - June 11-13", "thread_contents": ["We have set up a block of rooms for the upcoming ROS-Industrial Consortium Americas Training slated for Wichita, Kansas at Wichita State University! This is a unique opportunity to have a training both at a central location with respect to the US, and be in a central location relative to the long history of aerospace manufacturing that has been part of the Wichita, KS community. Check it out!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-i-consortium-americas-training-june-11-13/9085"},
{"title": "See ROS-I Global Team Members at Automate 2019", "thread_contents": ["Southwest Research Institute will have a booth, and a ROS-I demonstration that showcases some latest work in TSDF-based reconstruction and optimization based path planning, in ROS2. You can see more about what we are demonstrating here as well as our location on the Automate floor. Automate 2019, is April 8-11, in Chicago, IL and exhibition floor passes are typically free.", "If you are visiting Automate, please stop by and say hi. We will have ROS-I folks from the Americas team, EU, and Asia-Pacific joining us at our booth.", "Thanks!", "Matt R.", "One of our team members, Joe Schornak, took some time to sum up his experiences building out our ROS-Industrial demo for Automate where he leveraged ROS2 and the ROS Bridge.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/see-ros-i-global-team-members-at-automate-2019/8418"},
{"title": "ROS2 Transition Strategy", "thread_contents": ["In the near future we will begin transitioning packages to ROS2 and we are interested in getting feedback on possible strategies for managing ROS1 and ROS2 leveraging GitHub. We recently had a discussed at the ROS-Industrial Developers meeting and two approaches were identified below, but if other exist please let us know. Also we are interested in getting the communities feedback on the Pros and Cons of both approaches to help determine which is the best strategy moving forward.", "I think there’s a 3rd option:", "\nRepo 1 - Core Libs (same as in option 1)", "\nRepo 2 -", "This option gives you the benefits of Option 1 without as many repos. It assumes the repo maintainers are the same for both ROS and ROS2 wrappers.", "I am strongly in favour of ", ". This is simply because independent functionality should always be separated into a dedicated library. There might be users of your library that want to use it with yet another communication middleware. IMHO, it is also easier to maintain a library interface than cherry-picking between branches and resolving merge conflicts.", "I recommend avoiding using branches in a repository to manage completely separate pieces of code (ROS1 wrappers and ROS2 wrappers). It’s not what branches were for and it makes it really easy to make mistakes. I think that option 1 is your best bet.", "While I like the separation of concerns with Option 1, why are there multiple reposities needed?", "\nIsn’t it possible to have core, ROS1-wrappers and ROS2-wrappers in different packages within the same repository?", "If set up well, the overhead of selecting which wrapper to compile should be less than having to deal with 3 repositories for 1 ROS node.", "I think there’s a 3rd option:", "\nRepo 1 - Core Libs (same as in option 1)", "\nRepo 2 -", "This option gives you the benefits of Option 1 without as many repos. It assumes the repo maintainers are the same for both ROS and ROS2 wrappers.", "It does, but seeing as there is most likely a very small intersection between the code for ROS 1 and ROS 2, what would be the benefit apart from reducing the nr of repositories? Chances for cherry-picking are most likely slim (not zero though).", "While I like the separation of concerns with Option 1, why are there multiple reposities needed?", "\nIsn’t it possible to have core, ROS1-wrappers and ROS2-wrappers in different packages within the same repository?", "One reason would be to not tie versioning (ie: releases and history) to that of the ROS wrappers.", "As nice as ROS is, there are other frameworks/middlewares/software systems out there, and separating things out like this makes integration with those easier (perhaps not just technically, but also psychologically: I’ve seen companies refuse to use particular pieces of software just because it was hosted “somewhere” that they associated with bad practices and NIH).", "I think it depends on the amount of shared code between the ROS1 and ROS2 versions. If you already have a ROS-agnostic core library, with separate ROS1 and ROS2 wrappers, there’s probably very little shared code between the three, so it’s best to put them into separate repositories (option 1). Note that this also means that the core library needs a rather stable API, which is also good practice, but needs some discipline and automated testing. If the API is not yet stable, and there are a lot of “tandem” changes (i.e., a change in the library requires a simultaneous change in the wrapper and vice versa), they should go into the same branch of the same repo (option 2).", "If the core library is not separated out, but instead mingled with the ROS code (which is the case in the majority of ROS packages), there will be lot of shared code between the ROS1 and ROS2 versions, so they should go into separate branches of the same repo for ease of cherry-picking (option 2). That has its own set of challenges though - branches tend to diverge over time because people forget to cherry-pick.", "In short: option 1 is cleaner, so go for it if practical. If it’s not practical for the reasons outlined above, choose option 2. Also, whichever option you choose, you will have the least headaches if the ROS1 and ROS2 wrappers are fairly thin, so you almost never need to touch them, and almost all your development happens in the core library. It depends on the package if this is possible or not.", "While I like the separation of concerns with Option 1, why are there multiple reposities needed?", "\nIsn’t it possible to have core, ROS1-wrappers and ROS2-wrappers in different packages within the same repository?", "If set up well, the overhead of selecting which wrapper to compile should be less than having to deal with 3 repositories for 1 ROS node.", "I originally went down this rout and had one issue. When cloning down a branch that contains a packages for core, ros1 and ros2, I could not find a way to get it to build using ros1 (catkin_tools) and then ros2(colcon). My original thought was, that I would add AMENT_IGNORE to ROS1 packages and CATKIN_IGNORE to ros2 packages and it should build but that was not the case. It appears that both ros1 and ros2 ignore both.", "I originally went down this rout and had one issue. When cloning down a branch that contains a packages for core, ros1 and ros2, I could not find a way to get it to build using ros1 (catkin_tools) and then ros2(colcon). My original thought was, that I would add AMENT_IGNORE to ROS1 packages and CATKIN_IGNORE to ros2 packages and it should build but that was not the case. It appears that both ros1 and ros2 ignore both.", "That is exactly the issue we encountered when trying to share a non-ROS library with both ROS1 and ROS2.", "\nIf anyone has hints about this route, we would be interested.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Repository 1 (Core Libraries) - This would contain libraries that are ROS agnostic which would be leverage by the other repositories. (This may not always exist, depending on the nature of the repository.)", "Repository 2 (ROS1) - This would contain ROS1 wrappers around the Core Libraries.", "Repository 3 (ROS2) - This would contain ROS2 wrappers around the Core Libraries.", "Branch 1 (ROS1 and Core Libraries) - This would contain both core libraries and ROS1 wrappers.", "Branch 2 (ROS2 and Core Libraries) - This would contain both core libraries and ROS2 wrappers.", "Note: If improvements were made to core libraries they would be cherry-picked to the other branch.", "Branch 1 (eg: melodic_devel) - ROS wrappers", "Branch 2 (eg: dashing_devel) - ROS2 wrappers", "Branch 1 (eg: melodic_devel) - ROS wrappers", "Branch 2 (eg: dashing_devel) - ROS2 wrappers"], "url": "https://discourse.ros.org/t/ros2-transition-strategy/9154"},
{"title": "Kawasaki robot drivers (and other packages)", "thread_contents": ["This may be interesting for members here: Kawasaki Robotics just released ROS support for (some of) their robots and controllers.", "You may find the packages here: ", ". A page on the ROS wiki has also been created, but is still under construction: ", ".", "From the ", ", the following robots appear to be supported:", "Thanks for announcing our ROS support ", ".", "\nYes, we are now supporting only duaro, rs007l/n, and rs80n.", "\nWe will also write ROS wiki contents later.", "Thanks", "\nDaisuke Nakamichi", "Apologies if I interfered with your schedule ", ", that was not my intention.", "Let’s say it was my enthusiasm that caused me to post this.", "That’s great news! Are there plans for Kawasaki to provide ROS support for the YF003N delta robot? ", " Thanks!", "Great job! That would be a great boost for our research!", "\nIs there a timeline schedule for the support of the RS005N?", "Greetings from Greece!", "Currently there is no plan to add new robot for ROS.", ": what would it take to get new robots supported?", "Sufficient community interest in certain models?", ": Yes, we will do when the ROS community gets very interested in our robots and we judge that it is benefit for our business and customers.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["duaro (currently simulation only)", "rs007l", "rs007n", "rs80n"], "url": "https://discourse.ros.org/t/kawasaki-robot-drivers-and-other-packages/8518"},
{"title": "Python code to handle simple message protocol.", "thread_contents": ["I’m writing a controller software in python for my robot and I would like it to interface with industrial_robot_client and simple message. I understand I can use scapy to craft network packets but I’m a little lost on how I should do this? Has anyone done something like this or knows ways I can encode and decode the simple message protocol in python, with scapy for example?", "I’m trying to define a custom protocol in scapy but am a little lost.", "I’m not sure any more what the state of it is, nor whether it will work for what you are trying to do, but I wrote ", " a few years back.", "Might be something you could use.", "Thanks, that looks like something that could really help. I use that and try to hack together some sort of server implementation.", "There is no assumption in the bare protocol classes about it being a server or a client. Only the top-level (Twisted-based in this case) program that provides the data (coming from a socket, but that is not a requirement) would make that distinction.", "The ", " is a client, but only because the endpoint created is one.", "I see. I’ve started trying to get everything working but it seems the construct library has had some significant changes so there’s some work in there. Mind if I open some issues on GitHub or ask some questions?", "Would be great to have a server variant of this for both integration testing the ", " in ", " and to have at least one readable (ie not obfuscated by robot manufacturer languages) reference server implementation if someone ends up implementing yet another driver", "Indeed it would. I tried to look at the UR driver since it’s the only one in python but I’m not good enough to get much out of it. ", "Anyways I forked the original repo and am slowly working to get it updated and working again.  ", "A little update, I have a working server that sends simple messages for functionality testing and the server  now connects to the industrial client.", "Now I’m running into 2 different errors:", "I’m guessing the first is ROS waiting for initial status information from the controller? but what kind?", "\nFor the second I have no idea.", "You need to periodically send position (joints) and status messages from the server to the client before it allows sending trajectories", "For some reason I didn’t receive ", " email notifications about this thread. Sorry about that.", "it seems the construct library has had some significant changes so there’s some work in there", "The old version of construct is actually still available. It’s just called construct v2. I use it all the time.", "I don’t believe you needed to really update anything.", "Looking at your fork I’m also not entirely sure why you delete everything and then re-add it. The commit history is rather confusing.", "Mind if I open some issues on GitHub or ask some questions?", "You’re free to ask, always. I can’t guarantee I can help though.", "I tried to look at the UR driver since it’s the only one in python but I’m not good enough to get much out of it.", " is not ", " based. So that wouldn’t help you.", "I’m guessing the first is ROS waiting for initial status information from the controller? but what kind?", "\nFor the second I have no idea.", "As ", " already commented: the client is waiting for joint state messages, as it cannot otherwise determine what the state of your robot/controller is.", "The easiest is to periodically send ", " to the client. If you need/would like multi-group support, you’d have to use ", " (but note that multi-group support never made it into the v1 ", ").", "For some more background information on Simple Message, see ", ".", "The old version of construct is actually still available. It’s just called construct v2. I use it all the time.", "I don’t believe you needed to really update anything.", "Looking at your fork I’m also not entirely sure why you delete everything and then re-add it. The commit history is rather confusing.", "By the time I found that out I already had done most of the work anyway, might as well do it. And I’m pretty much learning as I go so my workflow is pretty messy. Sorry about that. ", "As ", " already commented: the client is waiting for joint state messages, as it cannot otherwise determine what the state of your robot/controller is.", "The easiest is to periodically send  ", "  to the client. If you need/would like multi-group support, you’d have to use  ", "  (but note that multi-group support never made it into the v1  ", " ).", "For some more background information on Simple Message, see ", "I get that and i’ m now doing that on port 11002. Or should I use JOINT_POSITION instead? And I’ve tried sending ROBOT_STATUS messages to the client on port 11000 but that does nothing. Looking at wireshark the client doesn’t send any requests until I shut it down. Then it sends a single JOINT_TRAJECTORY_POINT type message.", "Also I’m using the packages available from melodic repos if that means anything.", "I get that and i’ m now doing that on port 11002. Or should I use JOINT_POSITION instead? And I’ve tried sending ROBOT_STATUS messages to the client on port 11000 but that does nothing. Looking at wireshark the client doesn’t send any requests until I shut it down. Then it sends a single JOINT_TRAJECTORY_POINT type message.", "For everything to work as a regular server implementation:", "I see. I got it mostly working now, messages are sent and decoded correctly. But how do I make a callback for the joint_trajectory_point message? I attached a callback with the registerCallback function and gave a function as callback that sends a reply message using sendMsg but the _dispatchMsg function gets cauhght in the exception? Is this how you’re supposed to do it?", "EDIT:", "Disregard that, I figured it out and now everything works. It sends callbacks and outputs joint values to an array. ROS complains about execution timeout but that can be disabled.", "\nNow I need to just figure out the motor control bits.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["periodically send ", " and ", " messages to the state client", "accept ", "s from the motion client"], "url": "https://discourse.ros.org/t/python-code-to-handle-simple-message-protocol/9824"},
{"title": "YAK is now open over at github.com/ros-industrial", "thread_contents": ["There is a blog post, but the Kinect Fusion TSDF inspired YAK for reconstruction that provides a means to create meshes for parts/surfaces that historically prove to be challenging for either specular or featureless surfaces, is now up over at ROS-I GitHub Organization for ROS2.", "You can read up on YAK here: ", "Find it on github here: ", "Is the 3d reconstruction performed in real-time? And if so what kind of hardware is required to achieve this? Cool results either way!", "The reconstruction happens at the frame rate of the camera. The hardware required is largely driven by what the camera provides, both with regards to API, and what data it publishes. This video describes a bit more about TSDF and YAK. ", "Common cameras we have used are the Orbbec Astra, Intel RealSense, and the old Asus Xtion.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/yak-is-now-open-over-at-github-com-ros-industrial/10213"},
{"title": "World ROS-I Day 2019", "thread_contents": ["The ROS-I global community is going to be putting together the second annual World ROS-I Day, in the spirit of World MoveIt! day, but focusing on the repositories relevant to ROS-Industrial. We have 3 sites already signed up to host, as well as participating in virtual collaboration rooms, with continued participation from Asia, handing off to the EU, then finally to the Americas.", "Once again, we hope we can find some folks to jump in to do some clean up with us on the various repositories and packages, working on a predefined list of issues, similar to last year. Where hardware is needed for access we may seek particular collaboration partners, or have to table certain issues, though we are open to creative ideas.", "We will keep info up to date here as we work out the details, but we look forward to hosting this event and learn what we can do when we coordinate our efforts!", "Last year by the way, 35 issues closed. Not bad for the first year!", "Event listing can be found here: ", "Thanks in advance!", "Matt R.", "\nSwRI", "\nROS-I Consortium Americas Program Manager", "Just confirmed that we will have a space here in San Antonio for World ROS-I Day 2019 partnering with University of Texas San Antonio (UTSA)!", "We also have been actively reviewing and updating the issue board to support WRID19, and looking forward to seeing everyone online on July 2!", "We are also potentially looking at reducing the number of repos to be more focused for the event, so if you have any recommendations for repos that should be considered… post up here!", "I can also confirm that Fraunhofer IPA is hosting a ", " event on July 2 from 9:00 - 18:00 in Stuttgart, Germany.", "Wir freuen uns auf viele deutsche ROS-Entwickler.", "\n(that was German)", "But main language (of that day) will be English ", "Please contact me or my colleagues Harsh (", "), Ludovic (", "), etc., if you plan to come, so we know how many pizza to order and which room to host the meeting (we have an option on the main auditorium) ", "As a follow up to the above, ROS-I collaborative developing team, from around the globe, have settled on the list of repositories for the 2nd World ROS-I Day on July 2nd (WRID19). This will, as we did last year, seek to reign in the scope, to ensure we have some level of focus throughout the day.", "The repositories that are being included for WRID19 are:", "Similar to last year, the maintainers of each of these repositories are in the process of reviewing the project board from last year, to assess what is still relevant, and close any outstanding technical debt relative to last year, and account for all the changes that have taken place over the last year.", "Candidate issues within each of these repos will be labelled with wrid19, similar to last year. Also we will seek to identify a “level of effort” to help those understand the complexity of the issue without having to get too involved.", "Of course, please feel free to offer suggestions both on candidate repos as well as issues, or a class of issues that you feel are good candidates for this type of event.", "Thanks and looking forward to working with everyone on July 2!", "Matt R.", "ROS-I Americas", "ROS-Industrial Consortium Asia Pacific in Singapore will also be hosting a ", " event on July 2nd, from 9:00 - 17:00.", "Please check our ", " for more details (venue location) and also to register if you are attending in person (we will be ordering food and refreshments), or joining via WebEx (a link will be provided via e-mail). If you cannot register via Eventbrite, please write a message to me.", "See you soon!! ", "Update for WRID19… New issue board is up and coming together!", "This is the board the teams will be working to during the around the world hack-a-thon on July 2!", "You can check it out here: ", "Hello! WRID19 is just around the corner!", "For remote collaboration we are once again utilizing IRC and appear! The links with configured rooms are below:", "Chat: ", "Screen participation room: ", "Looking forward to seeing everyone online!", "Matt", "For those users in Europe: we’ve been steadily working on open issues, so far have 25 open PRs and issues pending resolution:", "GitHub is where people build software. More than 36 million people use GitHub to discover, fork, and contribute to over 100 million projects.", "Taking over from APAC soon. Thanks for the contributions so far!", "We’ve just lost the web chat. We’re expecting it to come up any time again now.", "Thanks for all the contributions to WRID19. I’ve been slow to get the results posted up in a Blog Post, but I at least wanted to say thanks, now that we are about 6 weeks later, we can see how the dust settled.", "Thanks also to all those that helped get things organized, and hosted meet ups. I think we built some good synergy locally here in Americas with one of the local Universities, in the open-source for industry initiative, so among tackling issues we are realizing additional benefit as well.", "Thanks again!", "Matt R.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/world-ros-i-day-2019/9240"},
{"title": "Intel & ROS-Industrial", "thread_contents": ["It is with great excitement that we welcome Intel to the ROS-Industrial Americas family. As you know here on Discourse, Intel has been supporting the navigation in ROS2 (FYI… I would encourage ROS-I members/industry stakeholders to checkout the ROS2 Navigation Working Group: ", "). This is a great opportunity to synergize that work with collaboration with the ROS-Industrial stakeholder community, up to and including the Consortium members around the world.", "We look forward to more richly collaborating with Intel, and seeing how we can foster a more tightly coupled synergy between our organization’s development activities!", "Thanks!", "Matt R.", "\nROS-I Consortium Americas", "\nProgram Manager", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/intel-ros-industrial/10376"},
{"title": "OPC UA Companion Specification Robotics Draft", "thread_contents": ["VDMA  and OPC Foundation recently made available a draft of the OPC UA Companion Specification for  Robotics.", "The draft and the references for providing comments on the drafts are available at ", "I guess this could be of interest of the people working with ROS-Industrial.", "Thanks for flagging this, I just double-checked and my colleagues are aware of this activity.", "\nGood to have it on the radar of more people though.", "I did not found any official announcement, but it seems that the OPC UA Companion Specification Robotics Part 1 was released in May 2019.", "Official specifications:", "The first document is the Part 1 of Robotics specification, for now covering aspects like diagnostic and monitoring. The second is related to basic type definitions related to robotics, such as Euler Angles. An interesting aspect for ROS-Industrial developers is that the Euler Angles convention of the OPC UA Robotics companion specification seems to be compatible with the one used by ROS, for example in the URDF models.", "For a general introduction to the OPC UA Robotics Information Model, see the following presentation: ", " .", "An interesting aspect for ROS-Industrial developers is that the Euler Angles convention of the OPC UA Robotics companion specification seems to be compatible with the one used by ROS", "personally I would have been happier if there weren’t any Euler angles in OPC 10001-11 at all …", "personally I would have been happier if there weren’t any Euler angles in OPC 10001-11 at all …", "I always try to find the bright side, considering that an alternative could have been to standardize a Euler angle representation incompatible with the ROS one (for example the KUKA one). ", "True. If there must be Euler angles, then having one which we’re already using/tolerating is an OK compromise.", "I guess the thought of field engineers (and everyone else actually) having to carry calculators to convert between “human readable” orientation representations and quaternions played a role here.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["OPC 40010-1 - UA Companion Specification Part 1 for Robotics 1.00 | ", " | ", "\n", "OPC 10001-11 - UA Specification 1.04 Amendment 11 - Spatial Types (Definition of 3D vectors, Euler Angles and similar quantities) | ", " | ", "\n"], "url": "https://discourse.ros.org/t/opc-ua-companion-specification-robotics-draft/6994"},
{"title": "Updated 3D Camera Survey on ROS-I Website", "thread_contents": ["Over the past year or so, we have noticed the popularity of a blog post that was most recently updated in Jan 2016 and persists to be one of the most visited pages over at ", ". The 3D Camera Survey has been a popular resource and we have now moved it from just a Blog post but to a page that now resides under the Developer ribbon off the main page.", "We link between this new page and the blog post since there has been a decent comment history on the blog post page. Please feel free to comment here, or recommend other sensors, or what additional info would be helpful in the description of each sensor.", "We are happy to provide resources that are beneficial to the Industrial community and to the broader ROS community so we look forward to keeping this one going!", "Thanks in advance,", "Matt Robinson", "\nRIC-Americas Program Manager", "\nSouthwest Research Institute", "Hi Matt,", "thx for this comprehensive overview. We really appreciate ongoing activities in the direction of open-source drivers for 3D vision devices.", "However, we are wondering why our ", " didn’t make it to the list? It’s an affordable,  ", " stereo-camera sensor with on-board processing resources and ego-motion estimation. As it is already on the market and people are using our ", " (which is being developed further thanks to the support of the ", "), I think it would be nice to have it on the list too.", "Did we miss any criteria here or could you please add it whenever you find some time? Please dont hesitate to contact us in case you need any further information, and thx for your efforts!", "Christian Emmerich", "\nRoboception GmbH", "Thanks for the reply. I’m looking to see what we can add, so the rc_visard would definitely be one to add. We started with sensors that we have had “hands-on” experience with, and then have since included some that the community has provided, based on what they have used. So every sensor on the list at least someone in the development community has had experience with it.", "I hope more organizations and developers include sensors/cameras to include, at which point we will update the page. We look forward to collaborating with the community to drive the most comprehensive list, with details that add the most value as well.", "Thanks for driving awareness on our end, and I’ll get to work to get it added!", "Matt R.", "\nROS-I Americas Program Manager", "Please check back and see if how I entered the rc_visard meets your expectations. We would love to get our hands on one. What is lead time to US? Cost? Demo units available?", "MR", "\nSwRI", "Hello out there… we have made some recent updates to the ", " camera survey… as always use this thread to request additions… ideally I take these from developers not OEMs so it is from a source that has actually used a camera, not just a sales person… open to suggestions to keep it relevant…", "speaking of relevant, you may ask, why are some of these out of production cameras on here?", "Well it is a record, of sense, so it is handy to have the specs of some of the classics to understand where some of the contemporaries sit. That is just my take anyhow… again, always up for suggestions.", "Thanks!", "Matt R.", "\nROS-I Americas Program Manager", "speaking of relevant, you may ask, why are some of these out of production cameras on here?", "Well it is a record, of sense, so it is handy to have the specs of some of the classics to understand where some of the contemporaries sit. That is just my take anyhow… again, always up for suggestions.", "Would it perhaps be an idea to add a row indicating availability / production status? Or perhaps even sort entries based on that?", "Great point on the line for availability. I was thinking of re-ordering, but the site formatting is not the most user friendly as you may have heard. I’ll get the availability status in.", "What does this mean please?", " 6600 LSB10/(Lux.s)", "We are using ensenso cameras here ( ", " ) a lot and I would like to mention that there are", "There is also this Ensenso driver: ", "IMO, this is the better driver, since we added support for integration with a monocular RGB camera on top of the Ensenso (so you get colored point clouds), and it feels more ROS-y (for example, it uses dynamic_reconfigure instead of actions to set parameters).", "There is an open ticket to discuss that ", "\nPlease open another one for exposing the feature to merge 2D and 3D data if that is not directly accessible. This is supported by NxLib api.", "I have a request to the vendor actually to update their specs to at least something that mirrors how the other OEMs present theirs. I may pull this since the testimonials from end-users/developers have been light.", "We have a lot of hands on time with the Ensenso products (N and X) and like them quite a bit. There are few options that are PoE and IP rated. Great to see the driver options and some feedback on which one to go with. Thanks!", "Has anyone tried this industrial version of the Intel Realsense D435?", "FRAMOS, the global partner for Vision Technologies, has developed an industrial grade version of Intel’s® RealSense™ Suite to provide Gigabit…", "We just got a quote. As soon as it gets in we can post up, if there is interest.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Bigger models available: X-Series ( ", " ) with up to 5MP and up to 3m x 3m x 0.5 m working volume, I think it deserves a separate entry", "an official ROS-I / rosin funded driver  ", " ", "\n"], "url": "https://discourse.ros.org/t/updated-3d-camera-survey-on-ros-i-website/4418"},
{"title": "Slightly off-topic: two tools for making Fanuc development a little easier", "thread_contents": ["For some time now I’ve worked on two tools that may make development of Karel programs for Fanuc controllers a little easier. As there might be developers here who work with Fanuc robots – outside of ROS(-Industrial) – and may be interested in this, I thought I’d post a link to them in this Discourse category.", "The first is ", ". It’s a wrapper around the regular ", " (the Karel compiler). The wrapper is not a compiler itself, but adds some functionality which I found missing from ", ":", "and some other minor conveniences.", "It does not integrate with Roboguide, but is intended to be used from the command line.", "Manual command line invocation gets tedious pretty quickly, so the second tool tries to provide a solution for that: ", ". This is a CMake like “makefile generator” that supports a workspace-style workflow. It introduces a package based approach where packages have manifests, export include files (headers) and buildable targets which ", " consumes and generates a single top-level ", " file for. Building an entire workspace requires only ", " to be invoked. Dependency tracking and build ordering (for generated code fi) is built-in.", "Together with ", ", this enables a more modern Karel development workflow where reusable libraries can be created and some form of redistributable package management can be integrated.", "An example workspace may be found here: ", ".", "Right now only Karel is supported, but a member of the community is looking into adding TP support (ie: ", ") to ", ".", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["preprocessor support (based on GPP): include guards, macros, defines, conditional compilation and inclusion, etc", "gcc style dependency tracking (ie: ", " support)", "support for multiple include directories"], "url": "https://discourse.ros.org/t/slightly-off-topic-two-tools-for-making-fanuc-development-a-little-easier/10717"},
{"title": "ROS-Industrial EU Fall'19 Workshop on MoveIt, security & skill oriented programming - Oct 09-10, 2019", "thread_contents": ["Fall edition of ROS-Industrial EU Tech Workshop will take place at Fraunhofer IPA on October 09th and 10th, 2019.", "We are glad to host two European ", " of ROS-Industrial Consortium member ", " and University of Hamburg to give us an insight into the latest developements of ", " (incorporating motion planning, manipulation, 3D perception, kinematics, control & navigation), current and planned developements for ROS2 (MoveIt2), and a hands-on on ROS(1)-based ‘bare-metal to product’.", "Next on day 2, ", ", ROS-Industrial Consortium member from Austria, will be demonstrating some insufficiencies of ROS(1) using a penetration testing tool ", ", developed by Joanneum. They would further walk the participants through setup and configuration of ", " , set of tools to provide security infrastructure to ROS2.", "The last session of the workshop would be jointly held by ", ", ", " and ", ". In the join presentation, we will present the robotics skill oriented programming tools developed within the EU project ", " enabling flexibility in the production line.", "Note: Participants will be provided with USB sticks with Ubuntu and all the necessary libraries and IDEs pre-installed.", "Please use this ", " and indicate your ROS-Industrial Consortium membership under “Discount code (for RIC Members)”, if any.", "Just wanted to remind our European ROS community of this ", " in Stuttgart, Germany. The event take place parallel to ", " which is located next to the airport of Stuttgart and approx. 20 minutes away from Fraunhofer IPA.", "I could also reserve some hotel rooms for 79 EUR per night. If you are interested in a hotel room or free ticket to MOTEK, please send me an email or DM.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["workshop will start on day 1 around 11:00 on day1 to allow flying in on the same day and will include lunch and beverages.", "We want to also organise an ", " and networking session at the end of day 1 and before an optional dinner in Stuttgart (If you want to present max 5 minutes, please email us in advance)", "workshop will finish on day 2 around 16:00 to allow fly out on the same day and will include lunch and beverages.", "free for members of any ROS-Industrial Consortium worldwide", "500€ / person for any other organization"], "url": "https://discourse.ros.org/t/ros-industrial-eu-fall19-workshop-on-moveit-security-skill-oriented-programming-oct-09-10-2019/10081"},
{"title": "ROS-Industrial Community Meeting September 24th!", "thread_contents": ["Hello all! We would like to extend an invitation to those interested to attend a web-based ROS-I Community meeting on Tuesday, September 24, at 9AM Central Time US. This meeting will seek to convey a number of interesting developments, both within the Consortium-leading organizations, and two guest presenters from member organizations.", "Intel’s Matt Hansen will share the latest with Navigation2, which he recently shared a ", " of Navigation2 working on hardware. Next up we will have the ", " project ", ", represented by PPM AS, present their latest work brining a ROS-based framework for planning, monitoring, and control of multi-pass robotic applications.", "Registration is required, and spots are limited. We will also be recording the meeting, so should you not be able to attend, the video of the meeting will be available. Meeting participation info is below.", "When: Sep 24, 2019 09:00 AM Central Time (US and Canada) - 90 Minute Duration", "Register in advance for this meeting:", "\n", "Update to members and affiliates on activities relevant to industrial open-source projects/applications. Agenda: Welcome, ROS-I Americas Update (Program/Tech), ROS-I EU and AP Updates, Intel's Matt Hansen on ROS2 Navigation, and PPM Robotics on...", "\n", "After registering, you will receive a confirmation email containing information about joining the meeting.", "Spots are limited, so please register sooner rather than later!", "Matt R.", "\nROS-I Consortium Americas Program Manager", "Hello All! For those that attended, please feel free to take this survey! We hope to gather your feedback to continue to make these meetings as valuable as possible!", "Thanks again!", "Take this survey powered by surveymonkey.com. Create your own surveys for free.", "Matt Robinson", "And… we now have a playlist over at the ROS-I YouTube channel. So if you missed the meeting or want to rewatch any of the talks, you can find them here: ", "Thanks again to the speakers and the attendees!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-industrial-community-meeting-september-24th/10738"},
{"title": "Universal_robot: breaking changes planned for Melodic", "thread_contents": ["In the context of the ", ", the maintainers of ", " would like to notify the community about upcoming breaking changes as part of an initial Melodic binary release.", "Refer to ", " for the details, but in short: the ROS Melodic release of ", " is going to introduce quite a few breaking changes. Most of those will be updates to packages, including package names, locations of files, changes to the contents of ", " and ", " files and various other things (such as packages being merged with other packages).", "This will almost certainly affect current users of ", " on Melodic, especially if you’re currently building ", " from source (or ", ", which tracks ", " for now) and are using any of the ", " macros as part of a composite model, if you’re (still) using ", ", if you’re using any of the packages for the e-Series robots and/or if you’re using Gazebo with UR robot models.", "Breaking changes are never convenient, but we feel our rationale for introducing them now makes sense.", "Please take a look at ", " and comment on the issue with any thoughts or if/when you identify any potential problems.", "Some of the planned changes (from ", "):", "Breaking changes are never convenient, but we feel our rationale for introducing them now makes sense.", "Why do breaking changes have to happen in a stable and long term supported ROS distro? This happens to other parts of ROS (like MoveIt) too and it is very annoying.", "It is very good to see official support for ROS drivers. But I do not see why the old driver has to be removed. Can’t this removal wait until noetic?", "Why do breaking changes have to happen in a stable and long term supported ROS distro?", "Unless I’m misunderstanding you, I believe we are actually not breaking anything ", " any particular ROS release.", "Nothing will be removed in Kinetic. It stays as it is.", " has never been released into Melodic. No binary packages have ever been made available. There is only a ", " branch which does not come with any guarantees of stability or backwards compatibility.", "That is not to say we don’t try, but announcing these changes now, ", " the first actual release is exactly to avoid having to introduce breaking changes in an LTS.", "It is very good to see official support for ROS drivers. But I do not see why the old driver has to be removed. Can’t this removal wait until noetic?", " will remain available in Kinetic. It will not be released into Melodic.", "If you need to use ", " on Melodic, you are most likely building it from sources in a/your workspace right now. You can continue to do that, even after it has been removed from ", ". Just include a copy of the ", " version in your workspace.", "Finally: ", " has not been updated since 2015 (almost 5 years ago now) and has never been compatible with anything but CB1 and CB2 controllers since it was written. It cannot be used with CB3 nor e-Series controllers. For those, the new ", " should be used, and even with CB2 controllers you may want to look at ", " instead.", "And just to clarify (but you are probably aware): ", ".", "Hey, thanks for the awesome and continuous work. We are currently using ur_modern_driver, but we would like to always have the latest and greatest driver for our robot. What is the best time to make the switch?", "Thanks,", "George", ": I believe your question would fit better in ", ".", "Again: ", ". The breaking changes mentioned here do not affect ", " (or ", ", the new driver) directly.", "Thanks for the heads-up, ", ".", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["replace ", " (the metapackage) with ", "\n", "remove ", "\n", "merge description packages for regular and e-Series robots", "change ", " to:\n", "contain only a single ", " parameterised by ", "\n", "support kinematic calibration data extracted from the controller (for ", ")", "no longer include ", " variants (but permanently update limits of affected joints)", "\n", "update all MoveIt packages (add new planner configurations)", "move all Gazebo URDF contents to ", " and switch to simulated ", " interfaces for all robots", "move out ", " to its own repository"], "url": "https://discourse.ros.org/t/universal-robot-breaking-changes-planned-for-melodic/11647"},
{"title": "Deprecation of ur_modern_driver", "thread_contents": ["All,", "with the public release of ", " the ROS community finally gained an OEM supported driver for Universal Robots controllers. Find the official announcement here: ", ".", "Both CB3 and e-Series controllers are fully supported and ", " provides some nice improvements over both ", " and ", ". This is especially the case for e-Series controllers, with full support for the 500 Hz update rate and integration of new functionality such as the embedded RS485 port in the robot flange.", "To avoid fragmenting the ROS & ROS-Industrial communities, we, the maintainers of ", " and ", ", announce the deprecation of ", ". It will not see further development nor addition of new features. It will also not be made compatible with e-Series controllers, nor with newer Polyscope/system software versions. Issues and PRs reporting incompatibilities and attempting to fix them will be closed.", "We encourage everyone with a CB3 or e-Series controller to start using ", ". It is the future of ROS integration with UR products, and we feel it has received sufficient maturity to start migrating our user base to it.", "If you haven’t already, please visit ", " to review system requirements and features. Issues with the new driver should be reported on the ", " ", ".", "On our side, we’ll be updating the readmes of various repositories, wiki pages, tutorials and FAQs to point to ", " whenever and wherever it is appropriate. If you come across a reference to ", " or ", " that you believe should be updated, please let us know ", ".", "Note that we are aware of the fact that feature-parity has not yet been reached between ", " and ", ". In particular, the “low bandwidth mode” or ", " is not available. Where possible, missing features will be ported, but we cannot do this without the community (ie: you). If you have the impression something is missing from ", ", open an issue on the ", " to discuss it. It could already be on the roadmap or could have been replaced by an alternative.", "Finally, we would like to take this opportunity to thank all community members who have contributed to either ", " or ", " (or both) with code, by reporting issues or in any other way: without those contributions it would not have been possible to create or maintain these software components.", "In particular, we’d like to thank ", " (long time maintainer of ", "), ", " (author of the original ", ") and ", " (contributor of the large “Kinetic refactor”).", "on behalf of the maintainers,", "Reposting this as a separate comment as I’ve received quite a few questions about this:", " does ", " support CB1 or CB2 controllers (up to and including Polyscope version ", "). For those controllers users would still need to use one of the older drivers or alternatives.", "I’d like to take the opportunity to thank ", ", ThomasTimm and everyone else who has contributed to the community-developed drivers - I have used ur_modern_driver in multiple applications with great success ", "Hi.", "\nIn these days, I’ve controlled a universal robot(UR-3) using the ‘ur_modern_driver’ on ROS Kinetic. But, now, I changed a version from 16.04 to 18.04. So, I also modified a version of ROS from Kinetic to Melodic.", "\nI installed a ur_robot_driver because of Melodic. And I succeed that “rostopic echo /joint_states” as below figure.", "\n", "Could I use a example code for moving a universal robot on ‘ur_robot_driver’ like that “test_move.py” on ‘ur_modern_driver’?", "Thank you for my question.", "First: please ask these sort of questions on either ROS Answers, or the issue trackers of the respective packages (and don’t post screenshots of code or terminal output, just copy-paste the text).", "But to quickly answer your question: both ", " and ", " expose a ", " action server (ie: it’s the same interface). Code that creates a client for that should work on both drivers.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/deprecation-of-ur-modern-driver/11629"},
{"title": "Consideration of STEP or Collada for Describing the ROS Environment", "thread_contents": ["Received some great notes from the recent developers’ meeting hosted by ", " and I figured I would post them hear to drive a continued discussion.", "From Levi…", "The primary discussion was on what the format will be for describing ROS environment. The current supported candidates are SDF and URDF, but should we move toward an industry standard like STEP or collada. The recommendation was to get a ROS2 working group put together to select the next format going forward. It was also discussed what the effort would be to write converters for each of the major solid modeling software. This would help with determining if we should lean more toward and industry standard versus a custom format like SDF and URDF.", "Thoughts on the idea of leveraging an existing industrial standard?", "\nIf this is maybe of interest, does this require setting up a ROS2 working group?", "\nIf so, how do we go about getting that group going and how do we ensure it stays active and the appropriate folks are involved?", "Looking forward to feedback…", "Matt R.", "FYI… for what it is worth, other industrial standards groups are looking at aligning with URDF, so a middle ground, or synergy between the two is not out of the question…", "I’m glad this is being brought up, thank you!", "I want to note that Collada is already somewhat supported in ROS via a ", ". But it only supports robot geometry, not whole environments.  My point is that there is already long standing precedence for that format in our community.", "Additionally, OpenRave runs on Collada, so it would be great to have that standard shared between ROS projects like MoveIt and Tesseract.", "One downside to Collada, as has been discussed in many past threads on Collada vs URDF vs SDF, is that its a very messy format. But I don’t think that out weights its existing popularity in many other domains.", "One aspect to keep in mind is that various tools support various subsets of the collada standard. It might be confusing to end-users if your robot has no joints any more after changing some color in say sketchup. Same goes for STEP of course. Another point is that both standards are huge and complex so it might take some time to implement a sufficient subset and we might need a caching system/format for preprocessed STEP files.", "I attended the developer meeting (and in fact suggested forming a ROS 2 working group around this topic), and I believe neither STEP nor Collada were being proposed as the only options.", "Both formats have appeared on lists of candidates in the past, and of all candidates have the highest adoption in (traditional) industry (Collada is even ", ").", "I believe this is the reason ", " mentions them here.", "If/when a working group is formed, all other options should (and will) be considered as well.", "It might even be that in the end it turns out that writing export/import plugins for a nr of popular (solid) modelling tools to a non-industry-standard (but ROS community preferred) format is the best option. Depending on the effort involved (and the backing of such a proposal) it’s not even such a strange idea.", "One aspect to keep in mind is that various tools support various subsets of the collada standard", "I would say this also goes for STEP and in fact many other “industry standard” standards. It’s a very unfortunate situation.", "As I’ve just read about it again, I’m going to add it to the discussion here: Pixar’s ", ".", "From the linked page:", "Universal Scene Description (USD) is the first publicly available software that addresses the need to robustly and scalably interchange and augment arbitrary 3D scenes that may be ", " from many elemental assets.", "I especially like this part (emphases mine):", "USD provides for interchange of elemental assets (e.g. models) or animations.  But unlike other interchange packages, ", ", transmit them from application to application, and ", ".  USD provides a ", " for reading, writing, editing, and rapidly previewing 3D geometry and shading.  In addition, because USD’s core scenegraph and “", "” are agnostic of 3D, USD ", ".", "This would seem to allow for updating robot descriptions by overlaying changes, making things like truely composable models possible (ie: base robots + dressout without creating a third ", ").", "It would also seem to allow runtime updatable models, as the format supports overlaying changes natively.", "This does sound promising, compared to some of what typically has to be done to manage issues related to proprietary formats/standards and addition of .xacros as you note. Seems like there should be something we could do to benchmark some of these approaches.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/consideration-of-step-or-collada-for-describing-the-ros-environment/10980"},
{"title": "A Complete Guide for Navigating a ROS Robot Base from Zero to Industrial-Ready Phase with the Best Practices", "thread_contents": ["Hallo,", "This Topic is ", ", but;", "Although there are lots of tutorials, open source packages about how to make a navigating robot for beginners, according to my research for days, there are no guidelines or a complete tutorial or tutorial list about creating a well-developed ROS based navigating robot for the people who know about ROS. All the existing good packages and tutorials are either very old, or just very specific approach for what that robot is created for (like old open source commercial robots) or solving a specific problem with best practices (ros industrial tutorials)", "Navigation is the heart of the ROS, more specifically the main part of the most ROS based robots. So it could be very nice to have a general complete guide on ", "There is the Turtlebot3, supporting all the new features, ros1, ros2, including general example applications and tutorials, but frankly, it has the Raspberry Pie as a main computer: I doubt how it could possibly have the best approaches about solving real world problems. I understand that this problem doesn’t have a predefined solution list, and there isn’t a single, general way, so I’ll keep the parts as simple and as general as possible. My aim is to create a road-map-like list of things for writing a full guideline on this topic.", "I have some bad answers to some of these, but I’m not an expert, so I expect experienced and helpful fellows to help with their answers to the numbered parts. Also I’d like to update this topic according to new area ideas to include since I can’t know all the real world problems.", "\n", " ", ": wheel types, motor types, motor drive, driving style(omni-directional, differential drive, ackerman steering etc.),", "\n", " ", ": footprint optimization, structural optimization, design ideas to include safety considerations, material decisions etc.", "\n", " ", ": Laser scanner, IMU, camera-type sensors, must-have sensors for a good navigation capability etc.", "\n", " ", ": microcontroller, high-level computer requirements, new communication methods and industry standards between hardware components and outside world devices", "\n", " ", ": low level controller code specifications, must-be-solved-in-low-level problems, existing solutions that are coming from the hardware manufacturers,", "\n", " ", ": This part is the area of ROS and already well documented. In this guideline, the aim of this part could explain different solutions to different software/pc related real world problems and solutions; hardware specs/industrial standarts/ROS versions and distributions/OS decisions according to the continuous development of ROS.", "\n", " ", "\n", " ", ": writing high level ROS drivers, sample well written node tutorials for mostly used hardware types, helpful links etc.", "\n", " ", ": choosing the simulator software, creating realistic simulation environment, abstraction of the simulation software to run on sophisticated super computers / cloud servers", "\n", " ", ": Although this is an unrelated topic, with the help of the containers like docker, spreading and managing the software can be automatized as you most probably know.", "\n", " ", ": could just explain (for example)EU standarts, Industry 4.0 standarts, ROS Navigation related safety guides, must-be-in-the-low, must-be-in-the-high level safety standarts", "\n", " ", ": Software testing for robotics, ready to use mocking softwares and development of mocking softwares", "there are no guidelines or a complete tutorial or tutorial list about creating a well-developed ROS based navigating robot", "Well because most of us that can do that use that knowledge to keep employed ", "But more seriously, it just takes alot of time. Its not that this information isn’t valuable, its that the type of people that know this stuff like to build stuff, not write things down by in large. The tutorials that exist are from a substantial investment in man-hours from OSRF (or Willow) that made the investment in creating the community and providing good starting points for the things they wrote as the centralized authority. The incentives to most ROS users and companies using ROS in the decentralized way it is today isn’t aligned with creating amazing beginner tutorial guides (to then compete with their core businesses) but contributing back with with new stuff that was needed for their applications and some general community interest.", "Moreover this is by in large a research-oriented field. Things change rapidly and any “choosing best sensor” document would soon fall out of date in 3-5 years when new companies with new hardware come out. For example the ", " (a comparatively old and deprecated sensor now) was ", " 5 years ago. Its now been built in products and since replaced with the D400s. Again, not to say that information isn’t valuable but now you’re adding bookkeeping over time to anyone’s daily agenda of things they’ve written to have to keep up to date. The same holds true of algorithms, choices of drive systems, safety standards, etc.", "You learn these types of skills through doing them and the “lets do it” type people don’t generally like to sit around and write long extensive entry-level documentation about it. Not to say we potentially shouldn’t be doing that, but those are my thoughts about how things are right now from my view.", "A solution would be to donate money to OSRF and tell them to use it for building documentation ", " or write some documentation yourself! No one’s better at it than someone with passion.", "This project provides a guide for setting up a ROS Robot Base.  We could extend this project?", "Visit the post for more.", "Linorobot is a suite of Open Source ROS compatible robots that aims to provide students, developers, and researchers a low-cost platform in creating new exciting applications on top of ", " (Robot Operating System). Linorobot supports different robot bases you can build from the ground up.", "Supports: 2WD, 4WD, Mecanum Drive, and Ackermann Steering.", "Github: ", "Well because most of us that can do that use that knowledge to keep employed ", "Explains a lot actually. This approach looks very familiar to me… The one that is opposite of open source ", "Moreover this is by in large a research-oriented field. Things change rapidly and any “choosing best sensor” document would soon fall out of date in 3-5 years when new companies with new hardware come out.", "Yes, you are right. For example, there are event cameras coming out. This is a very new sensor type and can be very good in multiple types of applications. But a guide to choose, and ways to search for a sensor type could also be useful.", "A solution would be to donate money to OSRF and tell them to use it for building documentation", "That actually looks very logical. I think, companies that have closed source mentality -which also the money- wouldn’t do that kind of donation ", " So yes, I (We) should do by myself(ourselves).", "About the software part, that is actually the PR2 for references. Looks like I can start writing this guide after reading all those lines in PR2 (", " ", ")", "Linorobot is a suite of Open Source ROS compatible robots that aims to provide students, developers, and researchers a low-cost platform in creating new exciting applications on top of ROS.", "That looks like another turtlebot to me ", "Well because most of us that can do that use that knowledge to keep employed ", "Explains a lot actually. This approach looks very familiar to me… The one that is opposite of open source", "For me personally it’s not so much that it (ie: that knowledge) keeps me employed, but the fact that writing proper guides (or documentation in general) is non-trivial and takes quite a bit of time and skill.", "I can only spend my time once, and unfortunately there is never enough.", "A solution would be to donate money to OSRF and tell them to use it for building documentation", "Money can buy someone else’s time, true ", "I can only spend my time once, and unfortunately there is never enough.", "Yes, and I think even if you write a guide, you’ll still see questions on exact same stuff at answers website ", "…fact that writing proper guides (or documentation in general) is non-trivial and takes quite a bit of time and skill.", "I understand that this guide thing needs a lot of time and also teaching/tutorial/documentation experience. My idea now is, maybe starting the initiative can take attention from people who are experienced in small parts of it. And they also can use the experience of the people who started doing other parts of it. Just with a little(maybe from multiple little donations) donation about hiring a documentation expert could make it possible.", "Please don’t take any of my comments as discouragement. That was not my intention.", "I just wanted to provide an additional datapoint and perhaps balance out the “we want to get paid for this knowledge”-comment by ", ".", " no misunderstanding at all, I’m just using yours and ", "’s ideas to improve my ideas since I’m not an expert. To me, this initiative is important because I saw people know parts of this stuff very well, but just some parts of it, but also cannot share the information because of: 1. Their responsibilities to their companies, 2. The thing that ", " was joking about ", "My idea as a workaround to the problems 1 and 2 above, there’s no harm for experienced people to share some tactics, best practices and tutorials about just specific parts. I also know that this is a childish idea in the industry; but with the open source mind, this should be done for the humanity ", " When this kind of problems will be less challenging, I think lots of more people will have the time to contribute to ROS, instead of dealing with the stuff that they shouldn’t.", "I agree that the overall goal is unrealistic, but perhaps there could be some best practices / guidelines / suggestions / tips and tricks etc. for the things that are closer to the navigation stack itself or other ROS packages that are meant to work with and/or around it.", "Here I am thinking about things the list below, where I think the answer for most of it is either: I’ll have to make it myself (which is not  always a bad thing if it is something that is core to your robot / business / use-case etc.) or I’ll just have to experiment a lot and when I have the answer it might be worth money later on, so I don’t need to share it.", "Edit: I think some of these points will be addressed in ROS2, at least from what I have seen people discuss in various issues / wishlists / requests for features.", "For me personally it’s not so much that it (ie: that knowledge) keeps me employed, but the fact that writing proper guides (or documentation in general) is non-trivial and takes quite a bit of time and skill.", "Yeah, sorry maybe I shouldn’t have said that, it was a joke. Future readers, please read with a healthy dose of satire. I think overall most people in our community are very open to sharing general knowledge, but getting a coffee and chatting is a different level of commitment and scrutiny of ideas than writing some “official” documentation/how-tos.", "To ", "’s comment on spending time, I’d echo that. I would say that I think of that as another side of the same coin as the people “doing the thing” like to do-the-thing and when the thing is done, they want to do another-thing. I think its a pretty fundamental trait of successful people that “do the thing”, especially in robotics where there’s so much to do. As a result, there’s never enough time because there’s always another interesting thing-to-do. I don’t know that he, I, or anyone else couldn’t find the time to do it. We have a lack of time, but that’s because we fill our time with things to do (and also need to do things to keep a job, but if we work for places that let us open source, there’s clearly some commitment in place as a starting point to build off of ).", "I’d argue minute-for-minute, a successful “doer” can make more impact in doing. These types of people have to document it to some level so other people can use it or understand it, but that’s not the same level of documentation that has to exist for A) entry level, B) a tutorial, C) the desire to keep it up to date.", "I’m totally guilty of this. All my documentation talks about what “the thing” does and describing the dials you can play with, but I make no attempt to explain why you should need this, how you can set it up in excruciating detail, etc. I’m writing to people with similar sets of knowledges as myself who are looking for a solution to a specific problem, much lesser so to people learning about it. But I think that’s one of the truly valuable things about ROSCon - the “doers” ", " about the-thing   and in discussion (as I mentioned above) we’re all very willing to help and share our knowledge.", "A reason to give money to the experts so that there’s a specific request to do so ", " or people that are motivated ", " I’m not sure at the moment the proper incentives are in place for a systematic change in the way we build documentation, ", " Just because that’s how things are, doesn’t mean we should accept that. I’m sure we can do better. However its hard when ROS has become so decentralized in the ecosystem development and very few in particular at that level has incentives to do what you’re suggesting.", "donation about hiring a documentation expert could make it possible.", "To my recollection, I think OR has recently hired someone like that, but I can’t recall specifically where I thought I was told that and can’t find references to it at this moment. But clearly they’re focused on ROS and the related ecosystem, and your suggestions are more focused on how to build a mobile robot hardware and applications.", "overall goal is unrealistic", "I fundamentally disagree that its unrealistic. I think its just not in line with how things are done in ", ". Clearly at other times this was a priority, and other communities have this. I wouldn’t try to make an argument that ROS is somehow tangibly different.", "obstacle layer vs voxel layer vs nonpersistent voxel layer vs STVL", "Thanks for the shout outs ", "To my recollection, I think OR has recently hired someone like that, but I can’t recall specifically where I thought I was told that and can’t find references to it at this moment.", "They do now have a document writer, reporting to Tully. I was told that they have started at the bottom, by re-working the introductory tutorials.", "However I think that the point about the purpose of this document writer’s work is valid. The OSRF wants documentation on how to use ROS to be good. “How to build a mobile robot that works well” is probably secondary to that, if it’s within their scope at all.", "(And to those who talk about not having the expertise to write good documentation, there is a reason “technical writer” is a job title.)", "However I think that the point about the purpose of this document writer’s work is valid. The OSRF wants documentation on how to use ROS to be good. “How to build a mobile robot that works well” is probably secondary to that, if it’s within their scope at all.", "(Although it could be nice to see OR’s effort) I completely agree that it isn’t OSRF’s, -or with the new name- OR’s problem. Area of this guide thing, is the industry and professionals. Could be possible by efforts of experienced people who do professional work. And if only few good people will try to do, it will require a huge time to get any result. My idea is starting it and expanding it by time. Even writing titles and putting TODOs under them is a good starting point to see what’s next / who can contribute / how much effort it can take to get a result. I’ll start it as a personal project when I have the time and the experience anyway. I don’t know what could change till that time. Maybe ROS1 will be completely deprecated.", "Even though we are joking about it, many people don’t want to share their knowledge about some of these topics.", "I don’t know how to narrow the topic list down but I hope that I’m successful about sharing my idea. Experts could also narrow things down.", "If there will be an algorithmic way for starting to develop a navigating base, it could be extremely helpful. Entry level;", "First and the beginner part of this guide can be the things above, then comes the details, wrongly organized in my first post in this topic, the intermediate ones. One doesn’t need to follow all intermediate ones since the person is going to do their specific solution according to redirecting options listed in the beginner part.", "The Advanced part could be about navigation and diagnosing. Maybe, to narrow things down, can only include gmapping, default planners, ros_control usage details etc. And can show the algorithmic way of starting, from creating urdf to adding launch/config files of the navigation stack. Because the need of using an open source robot code fork as a robot base when developing a new robot is painful (packages are either old or good ones are including lots of unnecessary parts).", "And diagnosing your setup, here is a well known good example of diagnosing ", " which has this information in the bottom of the page;", " ", ")", "Why Navigation? (again, sorry)", "Navigation is the heart of the ROS, more specifically the main part of the most ROS based robots…", "Beyond having a guide for professional use to show people directions, also navigation is one of the things that are firstly being operational in new LTS ROS releases. And Navigation Stack includes most of the common packages, libs in ROS.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", "\n", "\n", "\n", "\n", "\n", "\n", ": Even though, right now, ROS is an awesome middleware stack, I’ve seen lots of badly designed robots, both unsuccessful industrial ones and research oriented ones, which couldn’t benefit using these awesome libraries, tools, just because of the bad mechanical and hardware design.", "\n", " Yes. There are, but not organized and combined, and not for navigating base only, and not with the ", ". Some of the parts of this guide could directly show a helpful list of links. But The target of the existing tutorials are mostly for beginners or intermediate ROS users who doesn’t have the experience. This guide could be a way to advance in ROS based robots. Because writing guides like this for all ROS related things isn’t looking possible to me right now. But I think with a one with fully best practices on the navigation, It can also lead improving the other topics. Learning and using ROS for years makes the enthusiasts know lots of things about these topics. Still, no one can easily know all of these well.", "\n", ": Okay, even without this guide, IMHO, ROS will be the widest standard for the industry. Autonomous cars, drones, all types of vehicles will be using it in the future. My idea is, just like the time ROS created, a perfect, best practices oriented, industrial targeted, navigation related guide could really fasten this process. Let’s say, with the help of the experts, this guide is completed. And reached to lots of people, do you see any reason for ROS to not be the industry standard for all IoT devices?", "Are there any tools for the points below or should I create my own tailor made ones?\n", "Waypoint / route creation, storage and retrieval", "Tools to create zones on the map for different robot behavior (e.g. slow / fast zones) and how to detect when the robot is in each zone", "\n", "Is the move_base statemachine useful at all or should I go directly for a replacement?\n", "robot_navigation, move_base_flex, custom solution wrapped around move_base?", "\n", "Given a generalized type of environment (people sparse industrial area, crowded public area etc.) what would be the pros and cons of:\n", "Simple global planner like A*, Djikstra vs something like SBPL\n", "If you use SBPL, you already have a kinematically feasible plan - should you still let your local planner stray far from this plan to do obstacle avoidance, or let SBPL do that and have the local planner be a simple path follower?", "\n", "Local / Global costmap update rate in combination with global planner choice", "Predictability / politeness in global planner (e.g. doing one-shot and only replanning after catching exceptions or local planner failure) vs replanning all the time (but getting unpredictable result from an observers point of view).", "\n", "Experiences with which sensor sources to include in which costmap\n", "When should you include your lidar and 3D cam in the global costmap?", "obstacle layer vs voxel layer vs nonpersistent voxel layer vs STVL", "\n", "Some companies who open source their robots, don’t make the new ones open too. Because of security concerns, or because this is what their company gets the profit from.", "Some people with the wide knowledge don’t have enough time.", "Some people with a little experience like me don’t know the best practices, industrial needs, mechanics, real world problems etc. For example I still search for other robots from different brands and their common points when I design my new robot setup, to avoid reinventing the wheel (as most people do).", "Topics are wide and there are ", " solutions to ", " problems.", "Is it an outdoor robot to explore a planet? Design your mechanics by thinking about these problems + steering drive technique + hardware/control components", "Are you going to make a robot for lifting heavy weights? Choose these Mechanical options + steering types + this kind of hardware.", "Is it an indoor robot which will help people? Your problems are safety, navigating in a dynamic environment, carrying a robot arm etc.", "How much do you want to develop on your own? Here are things you can out-source. Here’s ros_control, here’s default controllers for ", " etc."], "url": "https://discourse.ros.org/t/a-complete-guide-for-navigating-a-ros-robot-base-from-zero-to-industrial-ready-phase-with-the-best-practices/11819"},
{"title": "ROS-I Americas Feb 2020 Training", "thread_contents": ["Just added the detailed agenda for the first ROS-Industrial Americas training for 2020. This instructor-led, with lab, event will be hosted by RIC-Americas member Glidewell Laboratories on Feb 12-14, in Irvine, CA. Check out all the details below!", "Advanced topics will be around perception pipeline, and an intro to perception driven manipulation.", " ", " ", " ", "Detailed Printable Agenda Here!", "Rooms are still available. Detailed agenda is linked above. Instructors for this training will be Jorge Nicho and Levi Armstrong! Get registered while there are still spaces.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-i-americas-feb-2020-training/12064"},
{"title": "Conversion to plain CMake of abb_libegm (and abb_librws)", "thread_contents": ["For users of ", " and ", ": please be aware that we’ve merged ", " today.", "This PR converts ", " (and eventually ", ") into a plain CMake package. These packages used to be Catkin packages, but never really made use of any of Catkin’s functionality, nor do they contain any ROS nodes or other ROS infrastructure.", "The main rationale for converting these packages is to be able to use them with ROS 1, ROS 2 as well as on non-ROS systems and on OS that support CMake, but not ROS (with all its dependencies). In addition, Windows (10) support is targetted.", "The documentation of both these packages will be updated, but just to summarise:", " introduces changes to the build system only. No functional changes are included. Ubuntu Xenial and Ubuntu Bionic are still supported. Future versions of these packages might require newer versions of CMake, but this will depend on availability of specific functionality.", "If you find something doesn’t work as it did, or should, please post an issue on the ", " and we’ll try to help you.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["plain CMake packages can be built in ROS Catkin workspaces, but only ", " or ", " can be used in that case. Regular ", " cannot build workspaces with non-Catkin packages in it. If you wish to keep using ", ", build ", " and ", " in an underlay first (using ", " or ", "), then extend that underlay with your regular workspace.", "\n", " and ", " might not work any more in ", " calls. Instead, ", " separately, and then use the appropriate ", " and ", " variables ", " make use of the ", " and ", " targets directly."], "url": "https://discourse.ros.org/t/conversion-to-plain-cmake-of-abb-libegm-and-abb-librws/12441"},
{"title": "Migration of staubli_val3_driver to a separate repository", "thread_contents": ["All,", "this post is to let you know that the ", " package, currently hosted in ", " is going to be extracted from that repository into a separate one.", "Rationale for this can be found in ", ", but for this particular repository this migration was done now so as to facilitate future contributions.", "More details and ongoing discussion can be found in the following issue:", "As a consequence of the consensus reached in ros-industrial/ros_industrial_issues#49, I've extracted staubli_val3_driver out of this repository and have created a new...", "There are no functional changes (yet), and file provenance and commit history have been retained as much as possible.", " was merged, removing ", " from ", ".", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/migration-of-staubli-val3-driver-to-a-separate-repository/12360"},
{"title": "ROS-I Developers' Meeting", "thread_contents": ["Did you know there is a monthly ROS-I Developers’ Meeting? If you think this is something you may be interested in, reply to this thread, and we can get you added to the invite. The next meeting will be on Tuesday June 11th at 9AM US EST.", "Thanks!", "Matt", "Dear Matt,", "I am interested, please include me in.", "Collen Gura", "\nCAG FARMS (PVT) LTD", "\nt/a", "\nGreen Valley Estates", "\nChakari", "\nHead Office:", "\n13 Downie Avenue,", "\nBelgravia,", "\nHARARE", "\nP.O. Box 3589, Harare, Zimbabwe", "\nTel: +263-4-2925630/1", "\nCell: +263 772 148 640, +263 731 148 640,", "\nE-mail: ", "This message is for the named person’s use only. it may contain confidential, proprietary or legally privileged information. No confidentiality or privilege is waived or lost by any mistransmission. If you received this message in error, please immediately delete it and all copies of it from your system, destroy any hard copies of it and notify the sender. You must not, directly or indirectly, use, disclose, distribute, print, or copy any part of this message if you are not the intended recipient. CAG FARMS (Pvt) LTD and any of its subsidiaries each reserve the right to monitor all e-mail communications through its networks.", "\nAny views expressed in this message are those of the individual sender, except where the message states otherwise and the sender is authorized to state them to be the views of any such entity.", "Hi Matt,", "I am also interested. What Informations do You need?", "I would be interested as well.", "\n(isys vision/mikado robotics)", "We just need an email address. If you are uncomfortable posting it here, you can always contact us privately via ", "Thanks!", "MR", "Hi Matt,", "\nPlease add me to the invitation list.", "email : ", "I realize we are still getting folks added, but also in the spirit of giving the people what they want, I also would like to get some feedback on what should be included. Typical agenda goes as such:", "The question to those expressing interest in participation would be:", "What is of most value to you?", "What time is most acceptable? We are looking at 10AM CST USA time as a compromise, but this makes it  difficult for our friends in Asia. We are also considering creating two meetings, one hosted by ROS-I AP, and one by ROS-I Americas, assuming we get enough participation.", "Thanks for expressing interest here in the developers’ meeting, and though this one has passed, keep an eye out for the updated invitation for the next one around the 2nd week of July!", "Thanks!", "Matt R.", "Hi Matt,", "Per your email, here is the Email adress: ", ".", "Collen Gura", "\nCAG FARMS (PVT) LTD", "\nt/a", "\nGreen Valley Estates", "\nChakari", "\nHead Office:", "\n13 Downie Avenue,", "\nBelgravia,", "\nHARARE", "\nP.O. Box 3589, Harare, Zimbabwe", "\nTel: +263-4-2925630/1", "\nCell: +263 772 148 640, +263 731 148 640,", "\nE-mail: ", "This message is for the named person’s use only. it may contain confidential, proprietary or legally privileged information. No confidentiality or privilege is waived or lost by any mistransmission. If you received this message in error, please immediately delete it and all copies of it from your system, destroy any hard copies of it and notify the sender. You must not, directly or indirectly, use, disclose, distribute, print, or copy any part of this message if you are not the intended recipient. CAG FARMS (Pvt) LTD and any of its subsidiaries each reserve the right to monitor all e-mail communications through its networks.", "\nAny views expressed in this message are those of the individual sender, except where the message states otherwise and the sender is authorized to state them to be the views of any such entity.", "Hi, I would like to be added", "\n", "What is of most value to you?", " - have you gotten some of the feedback on this thread? Also, have you had a chance to add members to the invitation? Just checking as it looks like we have a Developers’ Meeting coming up July 10!", "Hi Mat,", "can you please add me. Email: denis.stogl@kit.edu", "Hello Matt, please add me.", "\nMy email id: ", "Hello Everyone,", "You should receive a meeting request today. If you do not receive one please notify me and I will make sure you get added. Also in our last developer meeting we decided to change the meeting time back to 9am (CDT). I look forward to having everyone in our next developer meeting on August 14.", "Regards,", "Levi Armstrong", "Hi Matt & Levi,", "I am interested as well. Please add me: ", "What is of most value to you?", "What time is most acceptable?", "10AM CST would be fine with me.", "Next ROS-I Developers’ Meeting is this Tuesday August 14th 10AM EST! We hope this time manages a balance across a good share of time zones. I believe if you have replied below you should be getting a discrete invite. I hope to publicize an agenda in more detail either ahead of this meeting, but for certain ahead of future ones.", "Thanks for your continued interest in open-source industrial automation!", "Matt R.", "I’m also interested.", "FYI… formulating the agenda for Tuesday Sept 11. Seeking presenters. If you have something you would like to speak to at the Developers’ Meeting, let us know!", "As some may be aware the developers’ meeting was moved to Sept 18 at 9 am US Central time.  We will have a guest presenter, Dr. Chris Lewis talking about his recent work around Industrial Calibration. See you soon!", "Can you please add me to the list: ", "Developers meeting is starting now.", "Join the call if you’ve been invited.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Some regular contributors will give updates on current in flight development, non formal presentation", "Q&A Period", "Feedback on what should be focus for improvement areas", "\n", "\n", "Presenations on what others are doing?", "Chance to pose questions to other developers?", "Understanding of prominent issues and/or Industrial needs?", "Resources available to developers?", "Other?", "\n", "\n", "\n", "Presenations on what others are doing", "Understanding of prominent issues and Industrial needs", "Better understand the overall ROS-I activities, goals, working groups…", "Presenations on what others are doing", "Understanding of prominent issues and industrial needs?"], "url": "https://discourse.ros.org/t/ros-i-developers-meeting/5047"},
{"title": "ROS-I Americas 2020 Annual Meeting", "thread_contents": ["We are slowly confirming our agenda for the upcoming ROS-I Americas Annual Member Meeting March 4-5, 2020 at Southwest Research Institute in San Antonio, TX. You can follow the details here, as I will update the agenda as we confirm speakers and events/demonstrations. Day 1 is open to the public, and features a number of interactive demonstrations and tours.", "Check back in or feel free to post up if you have questions!", "Matt", "Updated and Pretty Close to Final Agenda. See some great demos and network with some like minded industrial folks!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-i-americas-2020-annual-meeting/12065"},
{"title": "About the ROS-Industrial category", "thread_contents": ["The location for discussion for ROS-Industrial (ROS-I) related topics. ROS-I, an open-source project, that brings ROS to manufacturing automation and robotics. The ROS-I repository includes interfaces for common industrial hardware (manipulators, grippers, etc) and networks. Software libraries for 2D/3D sensor calibration, path planning, applications (Scan-N-Plan), developer tools (Qt Creator ROS Plugin), and training curriculum that is specific to the needs of manufacturers. ROS-I is supported by an international Consortium of industry and research members.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/about-the-ros-industrial-category/4082"}
{"title": "How can i configure the can_ids and mask of the socketcan_bridge_node with the launch xml file?", "thread_contents": ["as the question above. i found that there is a cpp interface to configure the ids and mask of the can devices, but if i want to do this by launch xml file, how shoud i do this ?", "Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ROS Answers provides a forum which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", "If you’d like you can reply with a link to your ", " question, but in the future please start there.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/how-can-i-configure-the-can-ids-and-mask-of-the-socketcan-bridge-node-with-the-launch-xml-file/5406"},
{"title": "Automated XBOX Kinect-ROS Setup available on GitHub", "thread_contents": ["Hi there, ROS users.", "Looking to use an Xbox One Kinect with ROS? Here is a simple bash script to help automate the drivers’ installation on your Linux.", "Link: ", "Happy coding. ", "Hi ", ",", "Thanks for posting this. Happy that you were able to do this as part of the work at ROS-Industrial Consortium!", "Cheers, Min Ling", "\nSenior Program Manager", "\nROS-Industrial Consortium - Asia Pacific", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/automated-xbox-kinect-ros-setup-available-on-github/5482"},
{"title": "Api dx100 motoman", "thread_contents": ["Hi everyone,", "\nI find this info ", " with classes for functions of the controller dx100 motoman. But I don’t find the package, someone know something on about?", "I search on github and found this ", " , hope it’s what you’re looking for.", "The ", " package was merged into the current ", " package, quite some time ago already (notice the ", " version specifier in the link you include). Most of the functionality was kept in the ", " version of MotoROS (the MotoPlus application that is part of ", ").", "Can you clarify what it is that you are trying to do? The ", " files in MotoROS are not usable outside the MotoROS runtime environment, so they can’t be used in a plain (ROS) application.", "I’m try read and write jobs (in network), also I’m try read and write IO digitals for actuators with this ", ".", "Digital IO is partially supported, although it’s recommended to use a fieldbus for any serious work.", "As to reading/writing jobs, that functionality was not maintained, as it’s not needed for plain/typical use of MotoROS. You could see whether the functions you found in ", " could be ported to MotoROS, but you’d need a MotoPlus license and SDK to be able to compile the resulting custom MotoROS application.", " We have ROS support for executing Yaskawa INFORM-Jobs, reading&writing IOs & Variables for DX100 in our Motoman-Fork which ships with the ", " beta. It comes also with simulation of all the Motoman ROS services for testing of programms without a real robot. We have tested so far on a DX100 and a FS100 with SDA10 robots.", "You can see the functionality in our ", ". The software is in beta, for more details see our ", " or our other ", ". Which robot are you using?", "(I will post more details about Rosvita in 8-12 weeks with an official announcement.)", "How the service is displayed for read/write IO? I use this ", " but dont’ see the services, just these:", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/api-dx100-motoman/5402"},
{"title": "ROS-industrial Hydraulics", "thread_contents": ["Hi!", "\nHas anyone done any work with electro-hydarulics, including interfacing with the controllers?", "\nWhat models did you feel were easier to work with?", "\nWhat packages are available for them?", "\nWhat about CoDeSys support?", "Thanks in advance!", "\nD", "Do I have people stumped?", "D", "Hi", "I have been exposed to that before and basically it was pneumatics not hydraulic. Also it was for a month or so and I don’t think um in a position to give some advice on what to read and where to find some stuff. Sorry.", "[ The information contained in this communication is confidential and may be legally privileged. It is intended solely for the use of the individual or entity to whom it is addressed and others authorized to receive it.]", "Thanks! I appreciate anything. Do you have any details on the work with pneumatics?", "D", "Nope. It was just more of laboratory experiments than theory because were assigned with work to research and a project to do.", "Okay. Let me say it’s better you go through YouTube videos and some PDF to read. I think it’s much better that way.", "Thank you", "[ The information contained in this communication is confidential and may be legally privileged. It is intended solely for the use of the individual or entity to whom it is addressed and others authorized to receive it.]", "That’s the point of this post. Does anyone have information or resources pertaining to the use of Hydraulics with ROS?", "I’ve already gone over youtube, PDF’s and looked through ROS packages. I was hoping someone here might have a link to a resource or video that I’ve missed.", "Thanks for your time,", "\nD", "[ The information contained in this communication is confidential and may be legally privileged. It is intended solely for the use of the individual or entity to whom it is addressed and others authorized to receive it.]", "So are we all “authorized to receive [this]”, or should I look away?", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-industrial-hydraulics/4900"},
{"title": "industrial_ci for gitlab using Docker-in-Docker - reason?", "thread_contents": ["Hi! I have a hard time understanding why the industrial_ci for gitlab", "\n(", ")", "uses the Docker-in-Docker technique which gave me quite a hard time behind the cooperate proxy and I still don’t have it up and working.", "Wouldn’t a shell executor be sufficient? Or could there be issues with proper cleanup?", "This is not an answer to your question but maybe you could try ", "Thanks for the feedback. Let’s continue in ", " I just created, as this sounds more like either bug report or enhancement request.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/industrial-ci-for-gitlab-using-docker-in-docker-reason/5684"},
{"title": "IMTS 2018 Chicago", "thread_contents": ["curious if anyone here is going to imts this year?", "sorry, I am not aware of any colleagues of mine going to IMTS with ROS related topics…", "I know that Thomas Hilzbrich from Fraunhofer IPA will present “AI-based production optimization for interlinked manufacturing process chains: autonomous production optimization”, but that’s neither Robotics nor Open Source…", "A contingent of the Southwest Research Institute ROS-I team will be supporting an Emerging Technology Center (ETC) Demonstration around some NIST Grant funding to enable many to many relationships between MTConnect and ROS. We will have a demonstration showcasing the early capability and some content to communicate what this enables moving forward.", "Looking forward to a great week!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/imts-2018-chicago/5712"},
{"title": "Using Safety Protocols with ROS", "thread_contents": ["Does anyone know of any implementations of ROS packages for the major safety protocols for industrial? Examples:", "\nProfisafe, OpenSafety, CIPSafe?", "There is an implementation of Ethernet/IP in ros-drivers (", ") but I don’t think it actually implements the CIPsafe portion of Ethernet/IP. That is the closest thing I’m aware of.", "I’m not aware of any packages targeting specifically those extensions either.", "Most applications I’ve seen (ROS 1) separate safety from the rest of the application (to make certification easier or feasible). In those cases, integrating with the protocols/extensions you mention is less of an issue.", " - thanks, I had seen that but was wondering if there was a an interface to the safety protocol.", " - That’s what I’m trying to do, something like ROS -> ROS Safety package -> Safety protocol (ex. CIPSafe)->  low level protocol (ex. Ethernet/IP)  -> Safety monitoring subsystem", "Do you know of any open source examples of this type of architecture?", "Do you know of any open source examples of this type of architecture?", "No, unfortunately I don’t.", " - Maybe I asked the wrong question. You mentioned above you have seen some applications that separate safety from the rest of the ROS system, can you point me to an example you have seen? Maybe I am making this more complex than needed.", "Thanks,", "\nMatt", "I’m unsure whether I can point you to an example.", "I’ll contact one of my colleagues in ROS-I and see whether I can do that.", "Hi!", "Not sure this is relevant to the original discussion – I’ve just noticed “safety” and “protocols” in the name of the topic. At ", ", we are working on tools and techniques for ensuring the safety and reliability of communication protocols by means of formal verification. So far we’ve been focusing on these types of problems in finance – FinTech is essentially a distributed system of independent nodes communicating via messaging protocols. ROS looks like exactly the same kind of system, so we’ve also started a ROS-related project.", "We are working on the creation of ROS-OCaml client – if your code is written in a pure subset of OCaml, then it can be reasoned about using our Imandra proof assistant. Using Imandra, one can mathematically verify statements about your OCaml code, and it helps you to precisely formulate these formal statements by giving you counterexamples to your false claims. This allows you to create extremely reliable, precise and safe code and specification for it.", "[1]: ", "\n[2]: ", "\n[3]: The GitHub of the project: ", "Other than the ‘safety’ context, your reply to ", "’s post seems rather off-topic (as his post is about safety extensions to fieldbuses used in traditional automation contexts).", "I would like to refer to the presentation of ", " on “SAFETY REQUIREMENTS AND STANDARDISATION FOR ROBOTS: SOFTWARE DO’S AND DON’T” held at ", " in Stuttgart, Germany:", "906.48 KB", "–> on slide 9 onwards (\"Safe software: Boundaries of the safety-related control system) you can see different the levels of the control system with a OS and middleware level as part of the \"sand box\" protected safety-related part and an underlying safety-related part.", "–> on slide 13, Theo lists \"Possible conflicts between open source software and requirements for safe software\" where he concludes: Possibly only works for", "Self-contained modules maintained by a small group of programmers", "Verified software versions with change-on-your-own-risk policies", "Again, Theo’s presentation is from 2016 – software evolves quickly, and ROS2 and/or other developments might change the conclusions there.", "I hope this can answer at least some of your concerns", "another thing: at this year’s AUTOMATICA fair in Munich, German safety specialist PILZ showed a ", " arm that – to put it short & simple - applied these safe levels of the control system.", "–> see also their announcement here on Discourse (", ")", " - thanks for the references, these look helpful. I’ll take a look!", "Thanks,", "\nMatt", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", "\n", "\n", "\n"], "url": "https://discourse.ros.org/t/using-safety-protocols-with-ros/5561"},
{"title": "Library implementing ODVA EtherNet/IP for Gripper Robotiq", "thread_contents": ["Hi,", "\nSome one with experience about the  ", " library, I will appreciate your help.", "I have a 3 finger adaptive gripper that don’t can change of protocol is version 2011. I use the library ethernet/ip, this seem to work. But yet I don’t can mapping register of the gripper. This is the ", ".", "How I can apply this library to gripper?", ": I believe you have your work cut out for you. I’m not aware of anyone using that specific library in this context. Additionally, ", " is sort-of in limbo, as it’s not actively maintained nor developed.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/library-implementing-odva-ethernet-ip-for-gripper-robotiq/5824"},
{"title": "Streaming Motion Interfaces", "thread_contents": ["Greetings,", "I’ve been stewing on an idea lately and I’d like to submit to the community at large to see what you think.", "Some of our industrial robot drivers have “streaming” interfaces, meaning that joints are sent “on the fly” to applications while execution is happening. This is in contrast to “downloading” interfaces which try to make the entire plan available to the controller in advance.", "A problem on the ROS-I side of things is that all of our interfaces look like download interfaces to user applications: you can only send whole trajectory chunks. Some drivers have alternate interfaces (ROS-Control in some of the UR variants?) that allow for real time streaming.", "I’d like to:", "What in this proposal already exists? Has anyone experimented with point 2? Can ROS-Control fulfill our needs on point 1?", "I think because each JointTrajectoryPoint.msg has an associated  “time_from_start” it is OK to batch up points and send them at once.  They should get buffered if the underlaying transport has buffing.", "SHouldn’t it work already.   Perhaps all that is needed is a buffer node that subscribes to JointTrajectory and then sends them out again", "Nice post ", ".", "I believe the way forward here would be ", ", as it seems to directly support the two technical bullets in your list.", "Some history first though: the nodes in ", " (and any OEM specific drivers) were actually supposed to be outfitted with an “on the fly real-time streaming” interface. Right now, only the ", " topic is subscribed to, but the ", " section of the driver spec also includes a ", " topic:", "This is currently not there (", ") as at least back then the interfaces to motion controllers were so limited that the impression was that a (semi) downloading approach would always perform better, but the idea seems to at least conceptually correspond to what you have in bullets 1 and 2. Message type would be ", ".", "However, I don’t believe it makes sense for us to add that to ", " or any of the other drivers we have that are IRC based: ", " can already do this, and has one additional advantage: it supports on-line ", " with the ", ".", "Trajectory replacement ", " be a nice way to get both behaviours in a single driver I believe:", "“in the limit” this can become a single-point streaming interface – we’ve almost used it as such here in the lab with a system where we sent the controller very short trajectories (a few hundred ms max each) with three points: ", ". The idea was that if the real-time planner couldn’t generate new destination poses within its deadline, the trajectory controller would make the robot do a contolled stop at the last point in the trajectory ‘segment’. If everything worked correctly, the robot only moved to ", " with each update of the trajectory.", "The ", " is not perfect (iirc it’s not jerk-limited at the moment fi (which is probably the cause of ", " and others), but that could potentially be fixed by using ", ") so it could use some work, but I believe it could allow us to do what you want with the least amount of work.", "The “only” thing we need to do is implement ", " ", "s for robots and that’s it. And writing such ", "s becomes easier and easier now that more and more (industrial) robot controllers provide high-bandwidth external motion interfaces (ABB EGM, KUKA RSI, Mitsubishi MXT, Denso b-CAP, etc, etc).", "Summarising: I would be very much in favour of having this sort of ROS API for all our supported robots and I believe that most of this is already all there (although some parts could use some work), except for the ", "s that we’d need to be able to use ", " for this (we could create one for IRC if we’d like: ", ").", "Edit: as to the test setup: yes, please. I’ve had something like that on my list for so long, but never found the time for it. A colleague here in the lab has done some preliminary work based on ", " where robots (or really: their drivers) are made to execute specific motions with all sensor data recorded for later analysis. I’m sure there are other implementations available of this idea that go much further.", "I think real-time control is going to become more important, especially if ROS wants to compete with Boston Dynamics. Clearly we’re behind them at the moment.", "It’s not so much that real-time control isn’t possible with ROS1 – but it hasn’t been explored much yet. We’ve actually had pretty good success, if we can keep network traffic low. (", ")", "Velocity control of the joints, versus position control, is also important. When using velocity control, small message delays are less significant.", "I think some of the robot manufacturers are catching on to this stuff. UR was way ahead of the game, and HEBI arms can also accept a stream of joint commands.", "Velocity control of the joints, versus position control, is also important. When using velocity control, small message delays are less significant.", "I think some of the robot manufacturers are catching on to this stuff. UR was way ahead of the game, and HEBI arms can also accept a stream of joint commands.", "Slightly off topic, but: yes, velocity control is nice to have. UR was not necessarily ahead of the game though: KUKA LBR/IIWAs have had it for quite some time now. ABB EGM also supports both joint space and Cartesian velocity control. A third example would be Staubli.", "An interesting case study where real-time trajectory modification would have been helpful (assuming it wasn’t tried already):", "For months, Tesla engineers struggled to get a robot to guide a bolt through a hole accurately to secure part of the rear brake. They found a maddeningly simple solution: Instead of using a bolt with a flat tip on its threaded end, engineers switched to a bolt with a tapered point, known as a “lead-in,” that can be guided through the hole even if the robot is a millimeter off dead center.", "I don’t think real-time trajectory modification would have helped there: It’s not like the robot could see that it was going wrong, but couldn’t change the trajectory in time. Your “bolt through hole” example is a typical instance of a common class of problems encountered in industrial automation, and the solution is also a very typical solution by automation engineers: Painstakingly re-engineer the environment and the product to solve one specific problem in robotic assembly. Rinse, repeat. This is why automation is prohibitively expensive today.", "Humans are just still much better than robots at “seeing with their hands”. What would have helped the robot to put the bolt through the hole without changing the assembled product is tactile feedback, maybe a gripper capable of in-hand manipulation, and above all the AI to compute the correct motions based on that feedback. We’re not there yet, but we’re getting there. ", "the solution is also a very typical solution by automation engineers: Painstakingly re-engineer the environment and the product to solve one specific problem in robotic assembly. Rinse, repeat. This is why automation is prohibitively expensive today.", "What is also often done in these cases actually is to use some (passive) compliance. Either make the EEF compliant in such a way that it can deal with positional variation in the environment (ie: hole not in the exact spot) or make the robot control compliant. Various industrial robot OEMs have solutions for this. One example would be Fanuc’s ", ": it makes the robot compliant in one or more (Cartesian) axes allowing it again to ‘cope’ with a certain amount of positional variation when needed (of course having a lead-in bolt helps always).", "If there is anything that you think could/should be added to ", ", please feel free to approach and let’s discuss. I think we have been pretty open in the last few years to new controllers and modifications, the only thing that’s delaying progress these days is my reduced involvement as I can’t commit as much as I used to.", "Anyone around for ROSCon? We should meet up and could even draft up a roadmap.", "As for the specific issue about ", ": Streaming and submitting full/partial trajectories at once are somewhat colliding. You could do it but you’d suffer on performance: blending takes a bit of time and changes the beginning of the trajectory slightly for no big gain. A simpler minimum jerk position controller should do a better job there.", " has always kept focus on enabling realtime control for those who need to implement their RobotHW that way, in fact, controller input interfaces don’t have to be ROS, could even use any other messaging that provides a better performance/high level interface. An example of this is the Valkyrie from NASA where the ", " layer can be used to use any controller but when they deploy it for complex tasks, IHMC’s controller takes care of the whole-body control with higher level interfaces.", "Sorry if this post was a bit messy, probably tried to reply to everything at once ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Create a ROS level API for connecting to, configuring, streaming, and manipulating joint-motion streams to the robot driver.", "Create a robot driver that calls on inspiration from audo drivers (e.g. ALSA or JACK). Data is sent in “chunks”, or time slices, to the controller where it is double buffered. The size of the time slice would be configureable so you can trade off between latency and reliability for your given application. This might enable more robustness on not RT platforms, especially when servicing multiple robots or when the computer is under heavy computational load.", "Some kind of test setup to quantify our performance on, say, a Motoman or a UR.", "execute dynamic motion by streaming joint commands on-the-fly", "used by client code to control robot position in “real-time”\n", "the robot implementation may use a small buffer to allow smooth motion between successive points", "the topic publisher is responsible for providing new commands at sufficient rate to keep up with robot motion\n", "\n", "[…]", "\n", "send a single trajectory and wait for completion: ‘traditional’ trajectory execution", "send a trajectory and whenever the need arises send an updated one: blend current and new trajectory in a meaningful way (ie: keep smoothness and continuity)"], "url": "https://discourse.ros.org/t/streaming-motion-interfaces/5858"},
{"title": "Jerk-limited trajectory generation: opt_control", "thread_contents": ["Just happened to come across this: ", " (by Marius Beul from AIS Uni Bonn):", " generates time-optimal second- and third order trajectories from arbitrary start- to arbitrary target states. The trajectories respect per-axis constraints on minimum and maximum velocity, acceleration and jerk.", "Unfortunately right now only available as a matlab implementation, but this might be a good candidate for a MoveIt planning adapter (similar to the IPTP and the ISP) or a stand-alone trajectory generation tool for applications.", "As I won’t necessarily have time to implement this myself, thought I’d post it to this group to see whether someone would be interested in working on this.", "I worked on something similar few years ago.", "\nI wonder how much it would take me to convert this to C++ + Eigen and make it available as a library…", "Maybe, if I have some spare time, I will work on this.", "I would be interested on working to incorporate this into MoveIt.  If you find some spare time and want to collaborate, please let me know!", "Update: the author has indicated that he’s already working on a C++ implementation (", "), so let’s wait for that.", "Thanks for the offer ", ". Let’s wait for the author to make something available and then see what can be done with that.", "Final update: the author has made available an initial C/C++ implementation using the Mathworks codegen functionality (ie: a static library with accompanying headers).", "This can serve as a base-line for any other implementations in other languages, or even a reimplementation in stand-alone C/C++ without the need for the static library.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/jerk-limited-trajectory-generation-opt-control/5775"},
{"title": "Path planning with external axis", "thread_contents": ["We’ve been using ROS for additive manufacturing quite a lot in the last months (see ", ").", "We are now interested in working on revolution parts; the big difference is that we want to use a 2 axis positioner and combine/synchronise the movement of the position and the robot.", "A typical example would be:", "\n", "I want to build the green prism on the grey cylinder, the grey cylinder is attached to the positionner and can be turned around it’s axis (X / red axis on the image).", "What does it take to create a trajectory to build this part accounting that:", "I’m not sure about how to do that, because the part can be moving.", "\nIn other words, I’m not sure if the path planning algorithm has to decide which orientation should the positioner take or if MoveIt has to determine the orientation of the positioner depending on the trajectory fed.", "Any direction, idea, pointer would be appreciated!", "Interesting question, and something we’ve been starting to look at here as well (not too actively yet though).", "We’re not welding, but winding. Same difference, although a winding motion is potentially infinite.", "Has anybody done a similar thing with ROS on industrial robots?", "\nI would like to estimate how much time I would need to test this and get things running.", "I’m currently working actively on a very similar problem, but not within ROS-I at the moment.", "\nMy goal is to plan trajectories for 6 or 7 DOF welding robots, mounted on rails, creating up to 3 additional axes.", "Last year we did some experimenting [1] with the descartes [2] package of ROS-I. Because of my lacking C++ skill’s and there being no interface for highly redundant robots in MoveIt!, I started experimenting from scratch in 2D. [3]", "For your problem, my initial guess (based on the approach I’m trying now) would be:", "Feel free to contact me. I’m open to collaboration, as far as I can contribute something.", "\n(Coincidently, we even have a Kuka robot with a two-axis positioner in our lab [5] ", ", but I never used it.)", "\n", "\n", "\n", "\n", "As stated above, the problem that you are facing is a more general instance of a constrained motion planning problem than what ", " can express. Although not immediately helpful, recently an update has been pushed to OMPL [1] that introduces generic, geometrically constrained motion planning with sampling-based motion planners [2] (you can view a highlight reel of some of the available demos here at [3]). The code is available at [4].", "This new framework allows for geometric constraints to be phrased as functions of a robot’s state, ", ", which are satisfied when ", ". Your problem can be expressed as a geometric constraint on the 8-DoF system of the positioner and the end-effector. It could possibly look something like:", "where ", " is some metric in SE(3). Unfortunately, right now there is no interface through ROS to access these new features (i.e., through ", " or others), but a bespoke solution is possible. It would require creating a state space for your robot and a constraint, and then running your favorite motion planner on the constrained state space (for your case, probably an asymptotically-optimal one, optimizing for minimal end-effector movement).", "Feel free to let me know if you are interested in pursuing this route or if you have any trouble using OMPL.", "[1] ", "\n[2] ", "\n[3] ", "\n[4] ", "Zach, those OMPL additions look very cool. I like the sampling augmented with a little optimization for exploration. It’s not necessarily true that something like Descartes can’t express the problem, however. Like OMPL, at it’s core it’s just a way to build and search graphs. For example, Descartes trying to move a 6DOF arm around the perimeter of a part that can turn: ", "The problem is your sample space will grow out of control very quickly and so will your planning times… You might just try iterative inverse kinematics (e.g. call set from IK over and over) and see where it gets you. It’s at least quick to try.", "I have lots of ideas but, frustratingly, I can’t really share too much at the moment. Even past motion planning, I’d budget a couple of weeks for debug and testing of your new motion interface.", "Gijs, the problem of infinite windup might be addressable in the Descartes (or other planner) space if you specify that your start and end joint pose are the same. If your process allows the robot to get back then you could just continually duplicate that motion.", "Thanks you for these very nice answers ", " I’m happy to see that this is a topic of intereset, as many industrial robots are used with linear axis and turn tables this is a key topic to drive ROS-I into our factories.", "This really doesn’t look like a feature that would be done in two days work!", "I never used Descartes but I wanted to give it a look since a long time, that’s what I’ll be doing right now.", "I think it would be nice that this discussion continues with the advances of everyone in the field, I’ll try what you have suggested and give it a look.", "At the moment we are not starting a project or anything concrete in that direction, it is something we are studying, the main idea is to gauge the amount of work to get a simple example running, and get 3D printing running with this stuff.", "This would be something interesting to figure out…", "\nIf you plan a path as if you were planning to weld on a 2D plane then the 2D plane (and dimensions) would be the flattened cylindrical surface you’ll be welding on.", "\nThen interpolate the rotation of the positioner with the “planned” y movement (green?) (involving PI and the radius). So put a gear ratio between the y-position and the positioner, and do not move the welding torch in the y direction. You will then get metal added concentrically with the cylinder.", "Doing something similar with ", " example of the infinite spool winding:", "\ndepending on the winding angle, I’d see if you can interpolate the x position (along the rotarion axis) with the (winded) wire position/length. So that will be the driving (virtual) axis. Then the spool will have to generate a constant torque otherwise the wire will be too “loose” around the spool, or the wire will snap. so for 1 lenth of wire the x-position will be the width of the spool, and the next length the x-position to be reached will be zero. and repeat that.", "\nOr maybe even simpeler, travel back and forth between the spool, forget about the wire position altogether and link the wire speed to the cartesian speed of the end effector.", "I’m happy to see that this is a topic of intereset, as many industrial robots are used with linear axis and turn tables this is a key topic to drive ROS-I into our factories.", "I thought I’d clarify here a bit: I believe ", " axes are supported quite well. I’ve got 3 setups myself that use linear axes, it’s not something that requires any really special configuration or planners (OMPL fi can cope with this just fine fi, and so can Descartes).", "A turntable however is something I’m not sure about, but only because I’ve never configured such a system for use with ROS. Not necessarily because I don’t think it’s possible / supported right now.", ", I’m curious about how we should configure the kinematic system to make ", " work with 6dof + turn table. I feel like this is something different to 6 dof + 1 linear track and IKFast is not supporting this, right?", "Also, I think the youtube link that you shared above is not working… Would you mind fixing that? I’m looking forward to checking this demo!", "Video ", " wanted to show is available here: ", "Thanks ", " ! Do we have any example code for this? If we can set up a robot model with ikfast configured, I believe ", " won’t have any difficulty working with 6dof + turntable case.", "I would like to try what ", " mentioned above. In other words, I want to use ", " for redundant robots, where the redundant joints are sampled/discretized. I have plenty of idea’s for the sampling part, it is with the actual implementation that I’m stuck. I’ve looked through the source code of MoveIt! and ", " but I’m not sure what the best approach is.", "Approach 1. would make it available to other planners. On the other hand, you could argue that sampling is the task of the motion planner and therefore approach 2. is better. Approach 3. is somewhere in the middle.", "I cannot find a lot of information on the topic using google or looking through Github issues.", "\nCan someone help me with pointers / interesting links / insights / discussion?", "Has someone found a clean solution or made code available for this example?", " and I are working on some demos for ROSCON that will include a slightly retooled interface to Descartes that makes it easier to express problems like this. Give me a few days and I should be able to start posting some reasonably useful stuff.", " , Does this look somewhat representative?", "This is exactly what I meant to do ", " Looks awesome!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["The robot has 6 axis", "The part is on a 2 axis positioner (we would be using only 1 axis for the beginning)", "Moving the positioner is prioritised to minimize robot orientations changes", "Create a kinematic chain from the workpiece to the robot tool (therefore ignoring the dynamics).", "Create some kind of wrapper for the inverse kinematics of this chain that can return a sampled set of all possible solutions. The sampled space is very big, but I think it could be manageable for off-line planning. (If the ranges of the positioner are not to big. Like, smaller than 30 degrees or something, sampling at 1 degree intervals, and not to much freedom on the end-effector to keep to total solution space manageable.)", "Add a custom cost function to descrates that not only minimizes joint motion, but also takes into account the priority of avoiding orientation changes. (We already experimented with adding tool orientation to the cost function, but the approach was quite hacky [4].)", "Hope for the best. Descartes seems to be in active development at the moment. In the indigo version, we often encountered a lack of memory. Computation time was never really an issue when using the IKFast solver.", "Add functionality to the MoveIt! IK plugin to return a certain number of possible solutions for a redundant robot. There seems to be a lot of functionality present in moveit_core/kinematics_base to work with redundant joints, but I’ve not figured out how it works yet.", "Let ", " handle the sampling of the redundant joints. Use separate planning groups for the redundant and non-redundant parts of the robot. This approach seems particularly useful for external turntables.", "Use a separate package for the inverse kinematics and add redundant joint sampling there. (For example ", " Only use MoveIt! for collision detection.", "Some combination of the above. or other approaches I did not think of."], "url": "https://discourse.ros.org/t/path-planning-with-external-axis/4451"},
{"title": "RoboDK post processors", "thread_contents": ["Hey there,", "So we have these nice open source ", " that were made available just for us.", "\nI’ve been using my Fanuc post processor for a while and now I need a Motoman post-processor.", "We already had a discussion on how we should implement these post-processors in ROS:", "\n", "\n", "Here is my first working attempt:", "\n", "ROS RoboDK post processors", "\n", "The RoboDK are python scripts that are included in the repository as a submodule (don’t forget to initialize the submodules otherwise it won’t work). I have added a ", " to make sure Python treats the directory as a package.", "The RoboDK post processors have a common interface for every robot and also specialized functions/members.", "\nI have described ROS services that exposes the common interface.", "If the services are called with the right arguments and in the right order it is possible to generate programs for different robots. (at the moment only Motoman and Fanuc R30ia are in my test package)", "There are many with this approach:", "How would you approach the problem?", "Some news:", "I fail to run tests on the python scripts, help would be appreciated: ", "I have found an easy way to add custom commands for each post processor, specific services are defined in the ", ", then a separate python script defines the services servers ", ". This way the common services and specific services are nicely separated. Service returns with an error if the current post processor does not correspond to the service called (eg: using a Fanuc post processor and calling a motoman specific service).", "This approach seems to be working fine but I have not yet looked at the other items in the bullet list of the first post.", "I don’t have a gitlab account, so replying here: what sort of help are you looking for ", "?", "Someone to look at the code and help me find out why the tests are not passing;", "\n", "# Local ```bash -- run_tests.py: execute commands /opt/ros/melodic/share/rostest/cmake/../../../bin/rostest --pkgdir=/home/victor/code/catkin_workspace/src/ros_robodk_post_processors --package=ros_robodk_post_processors --results-filename...", "\n", "It could be a merge request or just a hint about what’s wrong in my package!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["How to add custom commands for each post processor? (eg: ", " on Fanuc, which may not have an equivalent on other robots)", "How to handle external axes? groups?", "How to add an option on a pose? (I use it a lot on Fanuc, not sure if it is useful for other robots)", "How to handle multi-program generation? (when generating a lot of poses, it is common to split the program into multiple programs)"], "url": "https://discourse.ros.org/t/robodk-post-processors/5663"},
{"title": "ROS-Industrial meet-up at ROSCon 2018 in Madrid", "thread_contents": ["[as not everybody might follow this ", ", I re-post it here]", " Day 1, Saturday Sept. 29 from 13:15 - 13:45", " Booth ", " (ROS-Industrial Consortia) in the exhibition area", " Look for ", " and colleagues.", "\n(1) get update from upcoming events (in Europe)", "\n(2) watch our ROS-I demo", "\n(4) talk about advance manufacturing/industrial applications", "\n(3) ask your questions", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-industrial-meet-up-at-roscon-2018-in-madrid/6177"},
{"title": "Fanuc Wrong Pose", "thread_contents": ["Hello,", "I am pretty new to the ROS environment. I have been trying to get ROS to work with the Fanuc LR Mate 200iC we have. Everything works as intended except the pose of the robot does not match what I see on RViz. ROS communicates with the robot just fine as I can see the movement when I jog the robot with the TP. Is there any configuration that I need to do for this to work?", "Thanks for any help,", "Cem", "We’re going to need a bit more information.", "What exactly does “wrong pose” mean? If you can, make a screenshot of RViz and indicate what is not correct.", "Also: how do you start everything? The launch files in the ", " package set the correct configuration for all supported models, but if you’re directly using the launch files in ", " then ", " are responsible for making sure everything is correct.", "Finally: it’s not as extensive as it should be, but the ", " tutorial describes the steps that show you how to check things are configured correctly for your robot.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/fanuc-wrong-pose/6284"},
{"title": "Goal start doesnt match current pose error", "thread_contents": ["Hi, my UR5 hit something while executing test_move.py from ur_modern driver. After that, this error pops up all the time when I try to run the same code test_move.py. “Goal start does not match current pose”.", "\nI think this problem arise because the driver thinks that the earlier command got executed and didn’t understand that it got hit. How do I resolve this ? If reinitialize the joints needed, please tell me how to do that.", "\nHow can I get this right safely!", "Hi.", "Could I please ask you to not cross-post the same question to ", ", ", " ", " ROS Discourse (this post) within 24 hours?", "We’re all volunteering our time here, so please allow us a little bit of time to get to issues and respond.", "Cross-posting leads to split discussions in the best case, but typically to duplication of effort which is not very nice.", "sorry. I agree with you and i am deleting them. I just didnt see any activity in much of these areas and that is why i posted in new places.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/goal-start-doesnt-match-current-pose-error/6285"},
{"title": "Are the inverse kinematics of simulation the same as the inverse kinematics of real robot?", "thread_contents": ["Hello, i’m a student and i am testing the functions of move it with the ros industrial robot packages at the moment.", "if i don’t want do control the real robot and instead just want to simulate the inverse kinematics of a robot, for example a robot type of abb or kuka - i take the robot description files (xml) out of the packages and create a config package with the move it setup.", "if i control the robot afterwards with a python script or with rviz - how different are the inverse kinematics between the simulated robot and the real robot which is controlled by the real robot controller?", "are there any possibilities to simulate the robot with the right kinematic configuration? (something like RCS - Robot Control Simulation - Tools)", "Thanks in advance. Best regard, Domi", "Hello ", " (Domi Schu),", "\nthank you for your post under ROS-Industrial, which is the location for discussion for ROS-Industrial (ROS-I) related topics.", "If you have a question: Please first ", " (A LOT has already been asked and answered, in general, people tend to not answer questions that have been asked before…), then only post a question on ", " following our ", ". ROS Discourse is not the right place.", "\nMany thanks", "\nThilo", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/are-the-inverse-kinematics-of-simulation-the-same-as-the-inverse-kinematics-of-real-robot/6369"},
{"title": "Welcome ROS-Industrial to Discourse", "thread_contents": ["This is to announce the completion of the setup of the ROS-Industrial category on ", "Please now use this category ", " on discourse to continue discussions.", "For everyone who has been subscribed to swri-ros-pkg-dev we have changed the permissions there to disable posting. Posts to this category will be reposted there to enable continuity and keep the old mailing list as a searchable archive. In general we recommend creating an account here and setting in your preferences to “watch” this category at which point you can unsubscribe from swri-ros-pkg-dev.", "For more background the original announcements were ", " and ", ".", "I’ve updated the notifications this update and future posts should hopefully get forwarded correctly to swri-ros-pkg-dev.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/welcome-ros-industrial-to-discourse/4084"},
{"title": "ROS-I Consortium Americas Annual 2018 Meeting Virtual Meeting Room", "thread_contents": ["We are excited to provide a virtual meeting room for those that are interested in listening on talks for the upcoming ROS-Industrial Consortium Americas Annual Meeting.", "   ", "   ", "ROS-I Annual Meeting - March 7 – Public Session:", "First, click: ", "Know who’s on and who’s speaking", "\nLoopUp calls your phone - no need to dial in", "\nAnd view when the leader shares their screen", "Or, if you are offline, dial in:", "\n(by joining, you agree to the privacy policy at ", ")", "\nGuest Dial-in Code: 2944048#", "\nUSA: +1 (877) 746-4263", "\nAdditional dial-in numbers:", "\nUK (Local): +44 20 7019 0492", "\nUSA: +1 (877) 746-4263", "This virtual meeting room is first come-first serve, so there will be a limit to the number of participants. Please consider only attending the talks that you will be interested in. We thank you for your support and continued interest in open-source robotics for industry!", "Regards,", "Matt R.", "Matthew M. Robinson", "\nROS-Industrial Consortium Americas", "\nProgram Manager", "\nSouthwest Research Institute", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-i-consortium-americas-annual-2018-meeting-virtual-meeting-room/4085"},
{"title": "ROS-Industrial academic citation", "thread_contents": ["Hi all,", "I writing this topic to focus the discussion about citing ROS-I in academic publications at one place.", "There were some discussions in the past:", "discussion in the archived swri-ros-pkg-dev google group:", "\n", "discussion in an issue under ", " package:", "\n", "Any further discussions are welcomed on this topic!", "Best,", "\nYijiang", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", "\n", "\n", "\n"], "url": "https://discourse.ros.org/t/ros-industrial-academic-citation/4136"},
{"title": "RIC Americas Training", "thread_contents": ["The ROS-Industrial Consortium Americas will be hosting a training on April 10-12, 2018 at Southwest Research Institute in San Antonio, TX. This class will have both basic and advanced track options. Members have access to this training, but must register in advance.", "You can find more details related to this training event, and take advantage of the discounted hotel rates associated by visiting and registering over at ", ".", "Basic and Advanced Track Options for this upcoming Training Event put on by the ROS-Industrial Consortium - Americas April 10-12, 2017 in San Antonio, TX!", "We are open to topics for the Advanced Track! Post up here to give us ideas!", "Thanks!", "Matt R.", "\nROS-I Consortium Americas Program Manager", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ric-americas-training/4170"},
{"title": "Project Azure for Kinect (4th gen Kinect)", "thread_contents": ["I’m stealing ", "’s (and/or ", "’) thunder a bit, but just thought I’d start a topic about the ‘new Kinect’ that MS has just announced: ", " (random link to VentureBeat article). MS site here: ", ".", "Some impressive specs (copied from the VB article):", "The depth image resolution will probably require GPU accelerated processing, as the Kinect2 was already enough to bring many machines to their knees.", "Edit: some other articles/links:", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["1024×1024 depth image resolution", "Highest Figure of Merit (highest modulation frequency and modulation contrast resulting in low power consumption with overall system power of 225-950mw)", "Automatic per pixel gain selection enabling large dynamic range allowing near and far objects to be captured cleanly", "Global shutter allowing for improved performance in sunlight", "Multiphase depth calculation method enables robust accuracy even in the presence of chip, laser and power supply variation", "Low peak current operation even at high frequency lowers the cost of modules"], "url": "https://discourse.ros.org/t/project-azure-for-kinect-4th-gen-kinect/4729"},
{"title": "Multiple robots in one controller", "thread_contents": ["Hi folks,", "This might be a very basic question, but I haven’t found a very clear answer posted here (or online in general).", "How do people deal with multiple robots connected to one controller? I don’t mean two ROS masters, but more like one linear axis system with two robot arms on it, both controlled by the same controller (in our case, two ABBs connected to one IRC5 controller).", "Afaik, the ROS-I interface doesn’t allow to dispatch a joint trajectory to a specific motion task inside the controller, so I’m not sure how others are solving the same. Without digging into the whole multi-master or orchestration approaches (which IMO -correct me if wrong- seem to be aiming at moving the capabilities of multi-robot out of the controller itself and into ROS), I see a couple of -perhaps overly simplistic- approaches (again exemplified with ABB because that’s what I have):", "I’d love to hear there are much better ideas out there, and hopefully be pointed in the right direction ", "Cheers", "\nGonzalo", "One driver per robot: install the driver multiple times on the controller, changing the TCP ports or using different IP address/network cards of the robot, so that we end up with pairs of motion/status servers running per robot, and consequently, one node per robot running on ROS.", "You don’t need different IPs or NICs, different TCP ports would be enough. But yes, this is one of the approaches that is used for this sort of setup.", "I don’t know if that works very well that can be configured on the ros node side of things to avoid collision, but I assume is doable.", "This setup is no different from any other multi-robot setup (ie: multiple turtlebots, or multiple static robots), so as long as ", " is aware of the entire scene this should just work.", "Add new message types and extend existing drivers: another simple option would be to add a few additional messages that would pre-assign dispatching to a specific motion task (i.e. call set_robot(x) before sending trajectories, so that the driver knows where to dispatch this to.", "That is also an option, but would require changes to the driver on both the robot as well as the ROS side.", "Your first approach is a lot less work – and is in fact how some early setups for YuMi worked (ie: consider each arm a separate robot). It will not allow for executing synchronous motions with all robots involved though. For that your second approach would be better suited.", "Without digging into the whole multi-master or orchestration approaches", "I don’t believe this is needed, at least not for the simple setup you describe / imply in your post.", "Thank ", "!", "I don’t know if that works very well that can be configured on the ros node side of things to avoid collision, but I assume is doable.", "This setup is no different from any other multi-robot setup (ie: multiple turtlebots, or multiple static robots), so as long as <insert planner infrastructure> is aware of the entire scene this should just work.", "Sorry, I used the wrong term. I didn’t mean physical collisions, but whether the ROS nodes wouldn’t interfere with each other at the software level, but you answer that already in the rest of your message ", "Thx!", "Sorry, I used the wrong term. I didn’t mean physical collisions, but whether the ROS nodes wouldn’t interfere with each other at the software level, but you answer that already in the rest of your message ", "Ah, those kind of collisions: no, as long as you namespace everything correctly (ie: ", ", etc) there are no issues.", "e if wrong- seem to be aiming at moving the capabilities of multi-robot out of the controller itself and into ROS), I see a couple of -perhaps overly simplistic- approaches (again exemplified with ABB because that’s what I have", "Yes, as gavanderhoorn said, namespacing the drivers on the ROS side should work fine, and sounds like the best approach.", "My understanding of what happens inside the IRC5 controller is not as good, but I’m curious to hear how it goes for you. As I’m typing this, a festo engineer is helping one of my colleagues connect a festo linear rail to an IRC5 controller so that we can move our ABB arm around on it. We’re working through the electrical and mechanical setup now, but afterwards we’ll have to dive into debugging the RAPID code that is running on the controller and talking to the ROS driver. My plan was to generate combined trajectories for the arm and linear rail, and using one ROS driver. That would probably be overkill for your 2 arm setup though.", "Sorry that I’m late to this discussion.", "Handling multi-robot controllers was one of the design goals when we drafted the design for “Version 2.0” of the ROS-I interface (", ").", "In particular, this interface allows sending/receiving messages with multiple “motion groups” inside them.  Each motion group has an associated “group ID” that is used to associate a set of named joints (ROS-side) with a numbered group of joints on the robot side.  Multi-robot controllers often represent the individual robots as separate “motion groups”, and the group-ID can be directly associated with each of these motion groups.  Group-ID can also be used in some cases to control external axes (such as positioners), without application-specific modifications to the robot-side ROS-I driver.", "The definition of this interface is flexible enough to allow for many different scenarios, including sync/async control of multiple arms or planning from 1 or more different ROS-side motion planners.  Control can be switched between these modes as needed.", "Although we have defined the REP, adoption into the main ROS-I repos has been slow.  I have updated the ", " library/nodes on the ROS side to support the new protocols.  There is also an updated Fanuc driver, but I don’t know that it has been released publicly yet.  I don’t know that these “v2.0” protocols have been used anywhere else.", "I have successfully used this updated driver for control of a multi-arm Fanuc workcell with a positioner, and things worked well.  But that’s a relatively limited use-case, so the code and protocols could certainly benefit from wider testing/usage.", "Let me know if you have questions or want to discuss further!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", ": install the driver multiple times on the controller, changing the TCP ports or using different IP address/network cards of the robot, so that we end up with pairs of motion/status servers running per robot, and consequently, one node per robot running on ", ". I don’t know if that works very well that can be configured on the ros node side of things to avoid collision, but I assume is doable.", "\n", ": another simple option would be to add a few additional messages that would pre-assign dispatching to a specific motion task (i.e. call ", " before sending trajectories, so that the driver knows where to dispatch this to."], "url": "https://discourse.ros.org/t/multiple-robots-in-one-controller/4694"},
{"title": "Hardware Accelerated Depth Camera Simulation", "thread_contents": ["Hello,", "I’ve made a depth camera simulation that utilizes OpenGL for hardware acceleration, but otherwise has fairly minimal dependencies. It is most useful when you want to quickly simulate depth scans but don’t really need the full blown power of Gazebo.", "I welcome feedback and contributions.", "\n", "I wonder if any others users have need of a headless (or offscreen) rendering tools. Maybe machine learning applications?", "Hi Jonathan,", "Some years ago I developed a very similar library ", ", in the context of my PhD thesis. The library also used OpenGL for fast computation of virtual laser scanners on a 3D environment. These virtual scans were used as “expected measurements” and were compared with actual measurements for a particle filter map-based localization ", ". The tool worked pretty well, and very fast, allowing to update hundreds of particles at rates of 5-10Hz.", "I also developed the version for depth cameras, which I wanted to use later for camera-gripper calibration for robot manipulator applications, see picture below:", "\n", "The main feature of this package, specially designed for 2D lidar simulation, was that the rendering window, which can be obviously hidden, was set with a size according to the resolution of the sensor you want to simulate, so no extra pixels are rendered. This resulted with very small windows to simulate lidars, since they typically have lower angular resolutions than cameras. Small rendering windows lead to fast renderings, so fast depth computations.", "Just wanted to post here, so we can be in touch, and to point out two potential applications of this approach (mobile robot map-based localization and camera-hand calibration)", "If I have some time I’ll try to dive a little bit in your code. Feel free to contact me for further discussion.", "best", "Andreu", "Math details about the library can be found in the SIMPAR’2010 publication:", "\nCorominas Murtra, A., Trulls, E., Mirats Tur, J.M., Sanfeliu, A. ", ". Lecture Notes in Artificial Intelligence -LNAI6472. International Conference on Simulation, Modelling and Programming for Autonomous Robots (SIMPAR’10). Darmstadt, Germany. November 2010.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/hardware-accelerated-depth-camera-simulation/4817"},
{"title": "Motoman MH6-10 Compute and Execute Plan of Cartesian Path in Time Real", "thread_contents": ["Hi,", "I have this ", ". The idea is generate small trajectories within cycles and that the robot moves. I want to vary the delays between each trajectory.the problem is that ", " does not wait for the robot to be in target position. It seems that trajectories are accumulated without executing and aborts the system.", "My apologies for my delayed reply.", "This is with a single group robot controller?", "Note that sending trajectories back-to-back is a supported use-case, but will not result in smooth motion.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/motoman-mh6-10-compute-and-execute-plan-of-cartesian-path-in-time-real/4832"},
{"title": "Save the Date! ROS-I Asia Pacific Workshop 27-28 June, Singapore", "thread_contents": ["Save the Date! Our annual ROS-Industrial Asia Pacific Workshop is on 27th - 28th June in Singapore. With international, regional and local speakers attending, exhibition and ROS demonstrations!", "More information and registration will be released next week.", "Don’t miss out and save the date!", "Regards,", "Min Ling Chan", "\nSenior Program Manager", "\nROS-Industrial Consortium Asia Pacific", "Looks like you can get more info over at:", "ROS-Industrial Asia Pacific Workshop - 2018", "Registrations are now open!", "Register here: ", "\nOpen Robotics - Morgan Quigley", "\nSwRI - Matt Robinson", "\nFraunhofer IPA - Mirko Bordignon", "\nMcKinsey", "\nADLINK", "\nPPM AS - Trygve Thomessen", "and many more. Stay tuned for updates!", "Thank you,", "Min Ling", "\nROS-Industrial Consortium Asia Pacific", "Last days to register, there are a few spots left.", "If you are in Singapore drop by at our ROS-Industrial Workshop for 2 days of presentations (international, regional and local speakers), exhibition and demonstrations. Join us for our networking dinner on Wednesday to find out more about ROS-Industrial!", " (1.2 MB)", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/save-the-date-ros-i-asia-pacific-workshop-27-28-june-singapore/4499"},
{"title": "Robot Calibration Tools: Lightweight Functions for Robot/Camera Calibration", "thread_contents": ["Greetings industrial robot friends. I come to you today with another personal project aimed at improving our available tooling.", "We sometimes joke at work that the only thing that our software guys do is calibrate things. It’s certainly been a pain in my side: it requires setting up involved experiments for data collection and it’s even hard to know if the answer you got is actually good. But for those of us who work in ROS on perception driven systems, calibration is difference between something that looks like it’s working and crashing your robot into a part.", "As I’ve worked on integrating projects like the Godel[1], A5 [2], and other proprietary applications, I’ve grown to appreciate the need for calibration tools that make a minimum of assumptions about how I get data and what I do with the results. I often don’t have control over the robot or don’t want to call MoveIt to make (possibly crazy) robot motions between observation points.", "So I’ve tried to put together a loosely connected bundle of tools for calibrating cameras to (industrial) robots with a focus on being easy to integrate (and hack) into more complex applications. I provide a suite of stand-alone “optimization functions” that take as input a structure full of well-documented arguments and produce an answer that is your calibration. How you collect data and what you do with the answer is left to you.", "The library supports a few things, but mostly focuses on:", "I’d like to expand the library to include calibrations as we require them: laser line scanners, robot kinematics, etc. I’d also like to provide more automated data collection tools, GUIs, and more, but we’ll see.", "I don’t claim to be an expert by an means. I also want to emphasize that this has been my own effort: not an official action on the part of ROS-Industrial. It’s based on the work of Dr. Chris Lewis ", " (in industrial_calibration [3]) and modifications made by Geoffrey Chiou.", "I tried to put a lot of documentation in there. I welcome, and even ask for, contributions: code, pointers, suggestions. Anything is welcome. I encourage you to dig around in the optimization functions themselves and appreciate how simple the core problems are when we have access to tools like Ceres. I learned a lot making this and hope you find it useful.", "[1] ", "\n[2] ", "\n[3] ", "This is the kind of package that makes ROS top notch for industrial robotics, thanks for sharing!", "Yes. This is +100.", "Calibration is always needed, but also always a burden.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["(Extrinsic) Camera on Wrist", "(Extrinsic) Static Camera(s) Looking at Target on Wrist", "PnP-esque target localization with one or more cameras"], "url": "https://discourse.ros.org/t/robot-calibration-tools-lightweight-functions-for-robot-camera-calibration/5250"},
{"title": "TrajOpt and Tesseract Open over in ROS-I Consortium Repo", "thread_contents": ["We are excited to announce the open-source release of TrajOpt for ROS and the Tesseract lightweight planning environment! These can be found over at GitHub: ", "There is also a blog post describing what these two packages bring to the table, that include some demonstration videos: ", "This work is still under heavy development, but the intent was to open in support of a ROSCon talk submission, so here it is! Please feel free to check it out. Some interesting capabilities are upcoming, including Descartes integration. Great work ", " and ", "!", "Thanks for your interest in Open-Source for Industrial Applications!", "Matt", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/trajopt-and-tesseract-open-over-in-ros-i-consortium-repo/5329"},
{"title": "Introducing ROSVITA Beta v0.7.12", "thread_contents": ["Hi fellow Robonauts,", "The Xamla dev team is proud to announce the first official public beta version v0.7.12 of ", " - a ROS based in-browser robot programming IDE!", "The ROSVITA IDE allows to develop adaptive sensor based ROS robot programs for industrial actuators and sensors. It significantly simplifies the setup of MoveIt! based industrial manipulator systems (including end effectors and sensors) and also strengthen the reliability of a ROS for industrial use cases. Rosvita comes in a complete ready-to use ", " with a user-friendly browser-based UI for configuration, world-view visualization, monitoring, visual programming, file & project management etc. For supported actuators and sensors it is possible to configure and start robot setups up to the point where you can realtime jog them within 1-2 minutes completely within the GUI without requiring to manually edit launch or YAML files.", "In the future industrial robot programs will in many applications incorporate sensor processing, AI and machine learning. In contrast to the classic robot programmer which carries around a ‘big calculator’ (teach pendant) we think that the future job description of a robot programmer more and more shifts to that of a data scientists who uses a robot to interact with the physical world. Innovative solutions incorporate 2D/3D computer vision, ML, deep reinforcement-learing etc. The main interesting space for us is to tap into the world of solutions that are outside reach of classic manual programming, e.g. generic gripping strategies for unknown objects, highly redundant actuators etc. Rosvita is our tool to simplify moving into this direction. We want to make core ROS functionality as quickly and easily accessible as possible and allow to use any available software technology in a robotic application.", "ROS is a wonderful platform for adaptive robot programming but in its native form it is “90% shell” and has a very steep learning curve. If you are starting to use ROS without any contact to experienced users it will take you a significant amount of time (at least 1-2 weeks) until you really can control your industrial robot arm with MoveIt! and ROS. We want to lower the barrier for ROS use since this excludes and scares a high number of potential users.", "ROS is heavily used in research and perfectly suited to tweak everything and get your 1-2 minutes youtube demo video ready - but many open-source drivers are often not mature enough for 24/7 industrial use - e.g. if you want to use them in a professional production situation you need the resources to fix and improve them within your team which makes this process incalculable and expensive. Probably this situation will improve in the future when vendors release their own drivers but with Rosvita we already provide this today: All drivers that officially ship with Rosvita are fully supported by Xamla.", "Rosvita normally “augments” a realtime-controller that comes with a robot and acts as kind of a set-top-box. It provides all the tools to use a ROS PC as the “higher-level brain” that does sensor data processing and dynamic trajectory planning for the robot.", "All these components and some more (like auto_calibration for external/onboard mono and stereo camera systems for calculating hand-eye matrices etc.) are part of ", ".", "If you are developer of ROS compatible hardware or you are frequently working with Robotic arms and you think Rosvita could be a fit for your application please get in touch with us. It is relitively simple to add new components to the Rosvita component catalog and thereby to add support for other drivers etc.", "\nIf you are actively programming robotic arm motions with ROS/MoveIt! and you want to use Rosvita for you applications we would be happy to discuss the applicability of Rosvita in person, please contact me via PM.", "As you probably can imagine providing a complete fully featured ROS based programming IDE which covers everything from control to AI is a major undertaking that takes many man-years of work. Xamla itself is currently actively using Rosvita to develop complex adaptive robot projects and we internally feed back our experience into the Rosvita product development cycle. But we are now approaching a point where we think it makes sense to introduce the software to a wider audience and to collect more exetrnal feedback. If you have any questions, ideas or comments please do not hesitate to ask.", "The next public bits you will see from us are examples and demos how to use and extend Rosvita. The heart of Rosvita is of course our motion programming API wich extends the capabilities of MoveIt! and this piece needs more documentation to be easily understood by users. A first version of our Python documentation can be found at ", ". We hope to soon provide a level of documentation that gently explains our robotic type system and the basic path and trajectory planning functionality…", "Any feedback is appreciated!", "Thanks", "Andreas Köpf", "\nFounder of Xamla", "This looks amazing. I believe this has great potential for industrial customers with little to no ROS experience. Also thanks for putting your project under a dual license!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["For an overview check out the ", " website.", "Preliminary documentation is available at ", ", details how to pull and install the Rosvita docker image can be found on our ", " page.", "Some introduction videos can be found in ", ".", "License: Parts of Rosvita are open-source under GPL with a dual-license scheme. The core IDE will be released with a license that allows free use in non-commercial settings (e.g. public research, hacker spaces, private users) and is will be offered via a commercial license model for professional production use (including support).", "For any questions get in touch with us (", ") or discuss with the Xamla dev team in our ", ".", "Configuration, 3D visualization and file editing in an browser-based IDE (can be deployed on a cloud server)", "Sophisticated realtime jogging functions (e.g. live mouse/keyboard based setpoint jogging, also available via API e.g. for visual servoing)", "Supervised motion features", "Monitoring of ROS node outputs split by node, quickly starting and stopping of individual nodes or the whole system", "Motion programming APIs for .NET, Python and Lua to compute adaptive trajectories or interact with the Rosvita World View", "Heartbeat based system monitoring to detect failure of individual components", "Cartesian path and trajectory planning", "XGraph Workflow editor: An easily extensible visual programming system based on .Net", "Setup of ROS/MoveIt! configurations for supported robots within a matter of seconds", "built-in XACRO/URDF editor with instant 3D visualization of modifications", "Time re-parameterization of MoveIt! trajectories (smooth motion)", "plug-ins for industrial components like Gripper-Control or robot controller features", "\n", " driver for the the UR Series", "\n", " for Mecademic Meca500", "Major driver development in our ", "\n", "Modifications (nearly rewrites) of the ", " driver", "\n", " - also nearly rewrite / significant perf and stability improvements", "\n", " package", "Significant trajectory-planning & realtime-control development has been done in ", "\n", "System monitoring system ", " might also be relevant for ROS-I / ROS1 users", "Client API for ", " for Python", "Significantly improved fork of ", " to interact with ROS form .Net Core"], "url": "https://discourse.ros.org/t/introducing-rosvita-beta-v0-7-12/6222"},
{"title": "Upcoming RIC-EU events in Stuttgart (and an external compliance seminar in Munich)", "thread_contents": ["Dear ROS-Industrial community,", "I just wanted to make sure that you do not miss our upcoming ROS-Industrial events in Europe (a technical training, an international hackathon and of course our conference).", "Hope to see you soon!", "Thilo", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["24.10.2018 Technical ", " (Scan-N-Plan Application on a PILZ & an UR5 robot) – free for Members of ROS-Industrial Consortia", "25.10.2018 ", " – free of charge", "16.11.2018 Free and Open Source Software (FOSS) ", " in Munich (", " for ROS-I members on regular price)", "11.-13.12.2018 ", "\n(first 100 seats and until Nov 9: 600 EUR | from Nov 10: 900 EUR, 50% discount on these rates for ROS-I consortium members)"], "url": "https://discourse.ros.org/t/upcoming-ric-eu-events-in-stuttgart-and-an-external-compliance-seminar-in-munich/6531"},
{"title": "ROS-Industrial Training Americas-November 13-15", "thread_contents": ["RIC-Americas is hosting a training event, with an advanced track November 13-15 in San Antonio, Texas! You can see the info here: ", "Thanks!", "Matt", "Now have agenda up, and a block of rooms at a local hotel on hold!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-industrial-training-americas-november-13-15/6412"},
{"title": "Production Ready solutions", "thread_contents": ["I have some questions about the labels for ROS Industrial code. Recently, I got a question from a company about the applicability of ROS Industrial for their production. For a typical solution with robot arms, I can use the industrial core, which is ", ". For path planning, we could select MoveIt, which is ", ", or Descartes, which is also ", ". I also need a vendor specific package and none of the vendor specific packages has the label “production ready”. They are all ", ". Does this mean that we can’t create a “production ready” solution at this moment?", "Moreover, from the outside, it looks like all vendor specific packages have the same maturity or quality, because they are all ", ". However, to me it looks like there are differences in features and support between e.g. Yaskawa and Fanuc. Should there be a more detailed label for these vendor specific packages? With this information one should be able to know which robot / make / type to buy when one wants good ROS interoperability.", "Personally I think the labels ", " for MoveIt! and Descartes are misleading - both have been deployed in many production systems, possibly with some cleanup.", "Speaking for MoveIt! in particular, it has had stable Ubuntu debian releases ", ", being re-released every few months for every version of ROS since 2013.  Admittedly, MoveIt! has plenty of areas it could be hardened for production systems but has not been due to resource constraints. Yet calling it experimental seems unfair given the amount of work that goes into keeping it stable.", "Relative to labels for packages, first a reference. We maintain on the wiki a software status page, it can be found: ", ". Where you can find the quote: “This status by design is not based on any quantitative evaluation, although these will come later. Rather, the status is merely the author/developer/maintainer’s informed opinion on whether the code is production ready.” This informed opinion could be based on actual experience running the code within an application and having performed means testing. However, at this time that is not guaranteed, and as indicated more quantitative measures are desired for future designation systems.", "That being said we recently had a discussion on this topic among ROS-I stakeholders. And it is important to differentiate between code quality and application robustness. In one case we can have the highest quality code within a package but the implementation of all the components and the resultant application may not be production viable. I would argue that a number of traditional automation deployments in the manufacturing world, the software would not be rated “production ready”, however the solution provider has refined the solution to the point the return on the development mitigates the risk that they are willing to tolerate to support. This is the calculation the solution integrator makes each time for each deployment.", "We are excited to see developments and improvements to the labeling and rating of packages for ROS driven by ROSin for instance, but understand that application verification and validation are still key steps in ensuring your application is ready for production. Obviously those verification and validation steps are less onerous the better the software components are.", "Another area, such as OEM drivers for instance, while experimental, we are wanting to highlight those OEM packages that are OEM supported. At that point they can update the label based on their understanding of use in application, or via their own internal testing. Ideally we can get to the point where all developers use the same measures for those packages be they OEM supported or community supported.", "I hope this adds some clarity and again, we look forward to further refining how we label and classify the packages moving forward.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/production-ready-solutions/6542"},
{"title": "Any word on a ROS-I Melodic release?", "thread_contents": ["Is this close by chance?", "The installation wiki ", " has a Melodic entry now but the binaries aren’t there that I can see.", "I think there has been some action on this front. Feel free to come to one of the Developers’ meetings and raise it there. I believe industrial_core may have been updated… ", " does that sound right?", "Indeed wrt industrial_core.  I have been keeping tabs on the GitHub conversation.  It seems that the Kinetic branch is mostly compatible and a bloomed release is near.", "When is the next meeting btw?", "Thanks Matt", "Keep an eye out on Melodic activity. Hopefully have some more detail in the coming weeks.", "Next Developers’ Meeting is Nov 13th, and maybe we can have an update on that front.", "I’ll try to keep this thread updated as well.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/any-word-on-a-ros-i-melodic-release/5414"},
{"title": "QT Creator and syntax highlighting/code completion", "thread_contents": ["Hello,", "Last week for World MoveIt! day I finally started working with the project from source but my problem is I cant get syntax highlighting or code completion to work, which is making it slow and difficult to help find bugs and do general development.", "I did some searching and everything I found points to Clang for QT’s parsing of the code but I cant seem to figure out the correct settings. Can anyone here help point me in the right direction to get this project properly setup in QT? (I also found the same issue with the MoveIt! tutorials code base, but assume this issue is related)", "Thanks for your help!!", "\n-Marq", "This should probably be addressed at ", " …", "Compile your code as usual using catkin build, source the workspace, open QtCreator within that sourced session, open your CMakeLists.txt in QtCreator, select WS/build/package_name/ as build dir for exactly one build configuration. Success", "This is also covered in the ROS wiki btw", "simonschmeisser thanks for the response! I was thinking about posting this there but thought it also fits here as it is a discussion on how to get a large ROS project that has roots in QT into the IDE that ROS-I supports. I am more than happy to move the discussion there if you feel this issue does not belong here.", "I tried your method and I can get syntax highlighting and code completion to work but only for one sub-package of the moveit source code (i.e. moveit_core. When I do this method the only source code I can see in the editor tree is the sub-package selected as the build space). I opened ", ", but when I go to select my build directory I can only select a single package directory (i.e. moveit_core, moveit_ros, … and I want to select all of them which doesn’t seem to be an option).", "It would be great if I could import the project the same way the ", " which is what I was hoping to discuss how to do in this post.", "Thanks again!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/qt-creator-and-syntax-highlighting-code-completion/6665"},
{"title": "World ROS-I Day - July 11", "thread_contents": ["The ROS-I global community is going to be putting together the first World ROS-I Day, in the spirit of World MoveIt! day, but focusing on the repositories relevant to ROS-Industrial. We have 3-4 sites already signed up to host, as well as participating in virtual collaboration rooms, with continued participation from Asia, handing off to the EU, then finally to the Americas.", "We hope we can find some folks to jump in to do some clean up with us on the various repositories and packages, working on a predefined list of issues. Where hardware is needed for access we may seek particular collaboration partners, or have to table certain issues, though we are open to creative ideas.", "We will keep info up to date here as we work out the details, but we look forward to hosting this inaugural event and learn what we can do when we coordinate our efforts!", "Thanks in advance!", "Matt R.", "\nSwRI", "\nROS-I Consortium Americas Program Manager", "As a follow up to the above, ROS-I development leaders have started working up a list of repositories that will be the focus of the inaugural World ROS-Industrial Day on July 11th (WRID18). This will help with making for a manageable scope and allow for tracking of progress throughout the day.", "The repositories that are being included for WRID18 at this time are:", "On the ", " organisation:", "Regarding the ", " repository: this edition of World ROS-Industrial Day we will not be addressing anything related to drivers, pending engagement with Universal Robots. While we are aware of the fact that the current situation is far from ideal, the good news is that recent engagement with Universal Robots will enable improved driver performance in the future. As such, we will focus on the ", " packages in ", ", such as the robot support, kinematics, MoveIt and Gazebo packages. if there are members of the community that seek to improve current drivers and their performance, they are welcome to do so, but please contact the WRID18 organisers to discuss this.", "Outside of ", ", over in ", ":", "The maintainers of each of these repositories are in the process, and still in the process of being invited, to review issues within these repositories and label them as candidates for this event.", "Candidate issues are labelled with ", ", and later with a label to indicate the “level of effort” that would be needed to address the issue so participants can choose tasks to work on based on this.", "Finally, all open tasks will be aggregated on a Github organisation-level project board which will be updated live during WRID18 to clearly show progress during the day.", "Obviously, if there are other issues you feel are worth considering, or repositories to be included, feel free to add to this thread!", "Thanks and looking forward to a great day on July 11th!", "We also have event info over at: ", ".", "Regards,", "Matt R.", "ROS-I Americas", "The ROS-I global community is going to be putting together the first World ROS-I Day, in the spirit of World MoveIt! day, but focusing on the repositories relevant to ROS-Industrial. We have 3-4 sites already signed up to host, as well as participating in virtual collaboration rooms, with continued participation from Asia, handing off to the EU, then finally to the Americas.", "Update!", "For those in the South Central Texas region, the Southwest Research Institute ROS-I Development team will be hosting an in-person World ROS-I Event from 8AM till 5PM at LiftOff located at 2014 S. Hackberry St, San Antonio, Texas 78210. Come and interact with local/regional developers, and work issues to improve the ROS-I repositories and continue to foster collaboration around industrial use-cases. We will have refreshments, lunch, and some souvenirs at the event.", "Thanks!", "Matt R.", "\nROS-I Americas Program Manager", "Another update!", "Issue board is coming together nicely!", "GitHub is where people build software. More than 28 million people use GitHub to discover, fork, and contribute to over 85 million projects.", "Streaming and Chat Services for Global participating in support of World ROS-I Day will be at:", "Streaming - ", "Live Chat Room (IRC): ", "Subject to change pending load testing.", "Hi, I organise ", " in Delhi, India. I was hoping to hold a meetup for ROS-I day. I already have a venue and logistics handled. Please let me know how to proceed?", "That is great to hear! Just jump in the virtual room and the IRC chat, you can also consult the GitHub issue board. Our friends in Singapore, that hub ROS-I AP, will be kicking things off. They should already be up and running, and moderating the chat over on IRC as well. ", " may be able to give more guidance to how they will be moderating the issue board during this time! Thanks for your interest and support of open-source robotics for industry!", "We would like to both welcome and thank Open Robotics for agreeing to host those in the Mountain View area looking to contribute to World ROS-I Day in a “face to face” fashion. We have added their location over at ", ", you can reply here, or tweet at Open Robotics for specifics as to when their doors are open! Thanks again ", " and the Open Robotics team for their continued support of ROS-I and open-source robotics for Industry!", " hi, could you please help with how will the issue board be managed? I have created an ", ". Also, I looked at some issues and shortlisted a few that I believe our community here can handle.", "Hi ", ", please log into the IRC chat / stream tomorrow. From there, we can begin assigning tasks from the issue board to your attendees that they wish to address. Looking forwards to it!", "Thanks, ", ", for the great initiative.", "We had a blast in Stuttgart, killed some candies and hopefully some bugs as well:", "\n", "\n", "Thilo", "Thanks to everyone who contributed to World ROS-I Day! We are doing a lot of “post-processing” to be able to present what went down. We look forward to working the PR’s and continuing to engage around the world!", "Please feel free to reply to this thread with ideas to improve this event and how we can make it more accessible/efficient to get work done!", "Thanks again!", "Matt R.", "\nROS-I Americas", "\nSwRI", "Great pic! And great working with the IPA team of course! ", " ", "Hey Sorry I wasn’t able to reply, I was on leave, but looks like you managed to join which was amazing!", "Thanks for your good work!", "Cheers,", "\nMin Ling", "Hi!  I just have a question about the bar graphs found on ", ".  Are these statistics for July 13th and July 16th only? Or are they for a period of time?  Is there any reason those dates were chosen?  Thanks!", "The intent was to make sure we caught the activity on the 11th, and then try to get a sense if the activity sustained, since issues were assigned and still in process, so we wanted a snapshot for sustained activity. At least that was the goal for that particular write up.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", " (except driver infrastructure)"], "url": "https://discourse.ros.org/t/world-ros-i-day-july-11/5087"},
{"title": "Navigation in ROS-Industrial", "thread_contents": ["We are working on using ROS-Industrial on mobile industrial robots. I think there is a large demand on autonomous navigation for industrial applications. However, the navigation stack is currently not part of ROS-Industrial. I think the navigation stack is an ideal candidate to be situated similar to MoveIt and the interface and controller layer. Why is the Navigation stack not in ROS-Industrial?", "No responses yet, but I would still like to know what others think about this topic. I have a related question about the organisation of ROS Industrial. Who decides which packages are (become) part of ROS Industrial? Moreover, who decides whether a package is experimental, developmental or production ready?", "I would say I have an interest in mobility for industrial applications. There were a number of use cases where real value proposition could have been realized if we had access to high performing processing that was mobile. When we talk about high mix environments, the agility in the mobile approach is really appealing. Over at ", " I wrote up a summary of the latest ROS-I to MTConnect work, ", ", that gives some insight to the value of mobile on-demand capability.", "As far as the labeling, I replied to the “organization’s” take on that in another thread.", "Thanks!", "Dear Matt,", "Thank you for your response. We also see the agile navigation approach from ROS is appealing for industrial applications. Currently, we are working on applying ROS on industrial mobile robots. We combine a “normal” computer with ROS with an industrial real-time computer for the low level control. We have already demonstrated that the functionality can be realized this way. The next step is to determine how accurate this solution can be. I think that eventually, we should take (part of) the navigation stack to ROS Industrial, to make people aware that navigation is available.", "I read the article on MT Connect. I have a “normal” software engineering background (Java, C#, Android etc.) and I am rather new to industrial applications. I was overwhelmed by the number of field bus / bus protocols in use and also the number of standards. To me, this really looks like a big bottleneck for interoperability en development of the whole field.", "For the standards, some people pointed in the direction of OPC UA. In a recent (Dutch) article, they mentioned UPC UA TSN as the way to go. To my understanding, MT Connect is more focused on a higher level machine to machine communication and UPC UA TSN could also be used for low-latency and real-time communication. However, I am not sure if this is correct. Overall, do I see the potential of flexible and autonomous mobile robots or cobots servicing and tending a factory and an accepted standard for communication.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/navigation-in-ros-industrial/6143"},
{"title": "Qt Creator Plug-In Updated", "thread_contents": ["Levi Armstrong has just posted an update to the ROS Qt Creator Plug-in… details here: ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/qt-creator-plug-in-updated/7073"},
{"title": "Videos of Day 1 (Session 1: EU ROS Updates) of ROS-Industrial Conference 2018 (#riceu2018) online", "thread_contents": ["From public funding opportunities to the latest technologies in software and system integration, the combination of robotics and IT to hardware and application highlights: Last ", " (", ") offered a varied and top-class programme to more than 150 attendees.", "\nFor the sixth time already, Fraunhofer IPA organized a ROS event in Stuttgart to present the status of ROS in Europe and to discuss existing challenges.", "This is playlist ", " of Day 1 (Session 1: ", ").", "            ", "\n", "More information can be found here:", "\n", "ROS-Industrial Conference 2018 in Stuttgart", "\n", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/videos-of-day-1-session-1-eu-ros-updates-of-ros-industrial-conference-2018-riceu2018-online/7366"},
{"title": "Using the Motoman SDA20D Dual-arms DX100 ROS Interface(Indigo)", "thread_contents": ["Hi,", "\nI’m working with Ros indigo and motoman’s robot SDA20D dx100 controller. MotoRosdx100.out is correctly installed. I run roslaunch robot_multigroup_interface_streaming_dx100 + robot_ip and it shows a problem: “Message callback for message type: 2017, not executed”, in rostopic echo /joint_states it shows:", "Does anyone know how to make the correct configuration?", "I’m not entirely sure, but I believe you’re not running the multi-group version of the driver.", "Message ", " is ", " (from ", "), which is the message used by the driver to report multi-group joint states. Unless the multi-group codepaths are used in ", ", the ROS nodes will not know how to deserialise those messages and the multi-group interface will not work.", "Can you please provide some more details on what exactly you are launching, where you got it from, and what parameters you are providing it (ie: packages, launch files, yaml configuration files, etc).", "IIRC, the group for the torso should not have all those joints.", "Hi, it is MotoROS v1.7.0 and Motoman Driver package is ", ". I created urdf and moveit package (", "). I follow this ", " but I do not find away to rename joints of groups about robots. I launch:", "Also,", "In rostopic /joint_states it shows:", "how I can do configuration for robot with 2 groups of arms and torso?", "after,", "and", "How can I do the correct configuration?", "Did you have a reason for deleting your two posts?", ": perhaps you can use ", " as inspiration. It is for an SDA10, but that should be almost a search->replace action at this level.", "The ", " pkg shows you how to configure the ", " and the other required parameters.", "Note that the pkgs in ", " contain a lot of other things (for integration of a gripper fi) that you can ignore. Also note that they are essentially a customised version of the pkgs in ", " and ", ".", "hi, I have the new configuration for package, now I can see the joint states correct of right arm, left arm and torso. But only run one time, and it’s show this:", "Will it be from the motoplus or ", " configuration?", "Can you show us the value of the ", " parameter?", "And could you please post the output of ", " when you start it with the ", " command line option?", "In new terminals (these just it’s show before of the error):", "In display of the robot Motoplus:", "Exist a problem with motoman_driver related with ", " and ", "?", "\nI used the last motoman_driver version for indigo-devel.", "I’m wondering whether there is some misconfiguration / misunderstanding here.", ": afaik, all SDAx robots have 4 groups, with groups 2 & 3 controlling the two torso joints, correct? How is this configured on the DX100?", "In the screenshot provided by ", ", it looks like only 3 ", " tasks are created. This strikes me as odd.", "Edit: ", ": could you test with group nr 3 (so the ", ") removed from your ", "A wireshark capture of some traffic would also help.", " I can confirm that a SDA can be operated with three groups on a DX100. Removing the shared torso axis was the only way we found to execute full body motions (both arms + torso) with a DX100. Primary reason for this is the Motoplus driver which has to split the updates for both robots (R1, R2) on the DX100 into two different calls, e.g. see ", ". If both calls are executed after each other the DX100 complains about different joint values for the shared base axis (even when you try to set the exact same values).", "Just one important thing regarding ", " (>1 but <4 groups): see my quickfix ", ".", " The SDA operates differently on a DX100 than an FS100 or above.", "The DX100 version of MotoROS can only support 2 control groups. This is a limitation of the API which controls motion (mpMeiIncrementMove).  So, for an SDA robot, you cannot control both arms and also the torso.", "I just realized that the max-group-detection mechanism in MotoROS doesn’t have the restriction for DX100.  I have just updated PR ", " to include this detection. In this new version, it will not create a task for the third group.", "I’m confused by ", "’s comment. Are you saying you were able to control all three groups with MotoROS on a DX100?", ": ok, this makes sense for me again now.", "So how are the motion groups configured then for the SDA on DX100?", "We should document this on the wiki.", ": do I understand you correctly that you configured things such that you can only control both arms, but not the torso also on DX100?", " I did this some time ago. I also had to tweak the Motoplus driver a bit to make this work, especially in MotionServer.c I added this:", "But yes, with these changes it is definitely possible to operate all 15 joints of the SDA10D with a DX100 controller simultaneously (run whole body motions).", "We at Xamla added a couple of more things to the Motoplus driver for better realtime control etc, e.g. see ", " or ", ". In general an issue of the DX100 is the big latency of the system (~ 100ms) which is probably caused by lower level moving average filtering in the motor controllers.", "  ", " can apply on indigo-devel (", ")? The difference it’s that the first take ", " it’s decreasing. The other from zero to until number groups.", " I have  eliminated group three and two for arms, but I have the same problem:", " (and all) If you like you could try our pre-release version of Rosvita which is a ready-to-use ROS docker container with web UI (see our ", "). It comes with models & configurations for SDA10D/F, Universal Robots and Meca500 and is for free for public research institutes and private users. Just send me a PM.", "I have resolved the problem. The count is from zero for number of groups just delete ros_assert. This have a while.", "\nIn rostopic now already it’s show me all joints in time real. Also, I move the robot (R1, R2, B1) and it’s change the joint values. This load yaml of 4 groups (same file), but do not show values of B2 joint.", "So, I will start to do test of moving robot. thanks!!!", ": do I understand you correctly that you configured things such that you can only control both arms, but not the torso also on DX100?", "No, we have no limitation of moving the torso of our SDA10D with DX100, e.g. we can move all 15 joints, 7 joints of one arm, 14 joints of two arms, or 8 joints of one arm and torso etc. We are using a slightly modified version of the MotoPlus driver and the Motoman ROS backend (e.g. correcting the deserialization of the joint_feedback_ex message, which also other did with some more lines of code as in ", ".", "Probably the hardest change we had to make: In the robot controller configuration we removed the B2 group.", "These are the ", " and the ", " we are using for our DX100.", "And regarding the MotoPlus driver (", "): The documentation of ", " was quite challenging to decode - I guess the text about ", " in the ", " description also applies to ", ". So what I found is: It is possible to control R1 + B1 in one ", " command for ", " by setting the corresponding two bits of the ", " member. After that it is possible to execute another ", " for ", " with the ", " mask with a bit set for the data for ", ". Both calls being made in one interpolation period results in smooth whole body motions.", "I have resolved the problem. The count is from zero for number of groups just delete ros_assert.", "That is not a solution. The assert is there for a reason, and you’re essentially running into ", ".", "Looking at the output in ", ", it appears you’ve duplicated ", ", that won’t work. Your robot has either 2 or 3 groups, and the ", " should reflect that.", "The configuration that ", " posted would be more like what you should be using, but then we’d have to fix ", ".", "If ", " could clarify whether the approach used by ", " is acceptable / supported, you could even use that configuration and the MotoPlus changes. But let’s wait for his comments.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/using-the-motoman-sda20d-dual-arms-dx100-ros-interface-indigo/4667"},
{"title": "Fully Open Source (Industrial) Robotics Controller", "thread_contents": ["I’m unsure if this is the right forum to discuss ROS related business ideas or not, if not please let me know where the right place is.", "I have this vision of a fully open source industrial robotics controller based on ROS-I. This includes hardware and software, basically, everything that you need to drive a robot from the motor drivers up or alternatively to drive a robot with an existing proprietary controller.", "I have the feeling that it’s still quite hard to get started on using ROS for an industrial application, because of many factors, not only involving the complexity of the ROS platform.", "What’s missing from ROS at the moment are following pieces. I’ll also add my ideas on how to solve them.", "The opportunity I see here is to build such a platform. For a client, this platform would give following benefits, compared to using a proprietary robotics controller.", "How to make money with this business?", "The goal of this project is to make using industrial robots more affordable and accessible by leveraging the power of ROS.", "Status: Idea, partially proof of concept", "I would very much appreciate your feedback if you think this is a reasonable idea and what kind of applications you see for such a platform.", "I’d suggest to wait for ROS 2 and consideration of TSN in DDS. ", " could be interesting for you. From the papers conclusion:", "“For  higher  layers,  we foresee a contending landscape where the integration of TSN", "\nin different middleware solutions focused on interoperability", "\nsuch  as  OPC-UA  and  DDS  promise  to  deliver  a  bottom-up", "\nreal-time communication solution.”", "I love the idea of an end to end open robot controller. The nature of my work (contract research at SwRI) means that custom hardware is almost never allowed for safety, cost, and support reasons. I think you will find a lot of folks here that have similar restrictions.", "What a lot of us ", " collaborate on is the user facing end of your proposed stack: the programming language, virtual pendant, and communication interface between PC & hardware. I’m just musing now, but recently we’ve seen more robot vendors provide a “dumb servo” interface to their hardware. We should have (but do not) the basic software in place to easily replicate what robot controllers can do now: jog, point to point move, cartesian move. Save paths, load paths.", "If we have our own controller, that is ROS based, it almost eliminates the need for a robot command language.  However, I do think there is value in providing a programming interface that is more familiar to industrial robot programmers.  We are actively developing something called ", ", that attempts to simplify programming, while still benefiting from power of ROS.", "Additional must-haves:", "How to make money with this business?", "This is by far the harder question.  An open source controller still requires a robot.  Not everyone is going to build a custom robot (or not enough to make it a worth while business).  If the controller worked with off the shelf robots, that would help, but I don’t see getting the cooperation of existing robot vendors as very likely.", "Very interesting topic indeed! Thanks ", " for bringing it up and ", " for referring to our previous work (we will release before ROSCon a follow up on that!).", "We actually looked at a somewhat similar idea a while ago and have an ", " prototype that interfaces with two of the most common collaborative robots seamlessly (in our opinion, ", " is indeed right about the opportunity here). From a modularity perspective (which is what we’re mostly interested in), such a concept (an Open Source (Industrial and ", ") Robotics Controller) is something very appealing but we did not obtain good input from the robot vendors we spoke with (which I guess was expected).", "We already expressed this to ", " directly but to motivate others to contribute, we from Erle Robotics wouldn’t mind allocating some resources and contributing with such a project.", "E.g.: if there were to be enough interest, we could produce a limited number of our existing ", "  and distribute it to those interested parties.", "If the controller worked with off the shelf robots, that would help, but I don’t see getting the cooperation of existing robot vendors as very likely.", "I wouldn’t be so pessimistic about that. If they see it as a way to sell more robots, they might be more interested. You need to approach them with the idea that it will expand the market for their robots, rather than as something to cannibalise their controller business. I’ve seen it work before.", "Very interesting topic indeed! Thanks ", " for bringing it up and ", " for referring to our previous work (we will release before ROSCon a follow up on that!).", "You are welcome. I totally agree with the papers statement and appreciate the effort invested into modularization concepts HRIM, H-ROS, etc as well. I am looking forward to the follow up.", "First: I’d love to have a full open source stack! Specifically the part where you just want to have a robot do some things.", "For this idea to succeed (you want to make money doing this too), you need to know your targets. Will that be companies? A robot manufacturer (startup?) looking to offload support to a community? A manufacturing company which makes products? Why would such a company decide to use another platform if they already have spent serious money on a robot brand, including educating staff and writing programs (sometimes processes are signed of by their customer, which will make it even less interesting to switch)?", "In my opinion, in industry, users need an easy way of programming so they “get things done”. These users don’t go designing robots, they don’t have the knowledge/time/money, they don’t go tinkering, they don’t have the time/knowlege/task to dive into writing nodes and worrying about dds, realtime etcetera. They have a task and want to use a tool to solve a problem.", "\nCompanies themselves struggle to hire staff who can perform these (for the ROS community simple) tasks. On a normal level, coming from school. These men and women do not have a university degree.", "I think that one of the big missing things in a full stack is the programming language and easy programming for a factory user. All your points about the hardware side are doable.", "If you want to have success:", "How to make money with this business?", " I was thinking about something end-user facing for the programming language, like a turnkey solution that works similar to what typical industrial robot controllers offer. But maybe I’m thinking to much “in-the-box” on this topic.", "\nAnd yes, support for off-the-shelf robots is a necessity in my opinion, even if you don’t get the support of the vendors themselves, the vendors provide ROS support, so it shouldn’t be too hard to add support for their robots. But it would be of course better if the vendors collaborate, selling more robots, for additional user groups, could be an opportunity for them as well.", " Thank you for contacting me. I’m very interested in hearing and seeing more at ROSCon.", " I agree.", "RT support of the middleware is definitely helpful, but I don’t think it’s a minimum requirement for such a controller. As pointed out, Machinekit or any other motion control layer needs to be RT capable, but the middleware itself could also operate in userland.", "The RT support of the middleware, however, is necessary when we are talking about distributed motor control. Which is something ", " is targeting for example.", "I agree. Supporting closed source robot hardware would be possible, even without the vendors actively helping with the integration.", "On the other hand, vendors could be interested in offering ROS support not only as a software package but also on the controllers they sell. Just musing.", "Dear ", ",", "thank you for your post . And thank you ", ", ", ", ", ", ", ", ", " & ", " for adding valuable answers to this thread.", "And to answer your introductory questions: Yes, ROS Discourse is the right forum to discuss this ", "From a point of view of ROS-Industrial Consortia (in the Americas, Europe and Asia-Pacific) you mention a lot of issues that we 've looked at it in the past, and as my previous speakers/posters have already expressed: some of it is tempting, most of it could be possible, and all have been on the radar (which does not make it less right or wrong).", "As you remember from our last collaborations (thanks again for your support at sprint tech workshop & ", " at IPA), the devil is in the details (e.g. see comments from ", " like: safety, cost, and support reasons). Therefore, we use official industrial robot controllers.", "If you want to challenge this (and think, you can find potential customers that don’t have that restrictions), I personally would encourage you and others to further investigate in developing a fully Open Source Industrial Robotics Controller. In that respect: great offer, ", ", for offering to allocate some resources and contributing with such a project.", "So far there was not a sufficient alignment of the ", " resources involved in such effort (think about the safety certification costs alone) to pull this off. If anybody has more links, please add them to this post/thread.", "As you and ", " are both based in Europe, you could even apply for some EU funding for a Focused Technical Projects (", ") via the ROSIN project (", ") and give it a try.", "Good luck!", ", ", ", ", ", and Thilo", "If people coming from school knowing this programming language and if you’re lucky some hardware/software concepts, you’ll also solve the problem of companies trying to find educated personnel. Might be an opportunity for the ROSIN project and education.", "As you and ", " are both based in Europe, you could even apply for some EU funding for a Focused Technical Projects (", ") via the ROSIN project (", ") and give it a try.", "+1 for this. Thanks ", " and ", ". After the reactions, we are considering doing so. I’m thinking more in the ROSin FTP direction though. Although the percentage funded is lower, it certainly (at least it does to me) matches a bit better the objective of a potential project (maybe someone could argue this?).", "Creating a small consortium where each partner had access to a different industrial robot and could contribute with their corresponding abstractions for a common Open Robotics Controller (ORC?, ", ")  may make sense.", "If there’s anyone interested, please say so.", "Very interesting idea indeed. I like the suggestion of ThiloZimmermann for a EU funding. So, If ", " and ", " are considering to apply it. Can I propose to joint this proposal as an academy collaborator? Thanks.", "Hello ", ",", "Can I propose to joint this proposal as an academy collaborator? Thanks.", "Thanks for your interest. That’s certainly very feasible. The current status of the project proposal is as follows:", "Currently, the group is composed by:", "We will need a bit more of information about you and your group but feel free to write me if you feel you could contribute. Please specify which robot targets you’d be willing to use for the project.", "Hi ", " ", " I’ve been working on and off on an OS robot (hardware, so that dimensions can be adapted for each case), running on Machinekit called ", " Currently I’m working towards changing the design from prototype for use in practical colleges in NL. I too would like to enquire how can collaborate this project.", "Hi ", " ", " I’ve been working on and off on an OS robot (hardware, so that dimensions can be adapted for each case), running on Machinekit called ", " Currently I’m working towards changing the design from prototype for use in practical colleges in NL. I too would like to enquire how can collaborate this project.", "Pretty interesting! Why don’t you write me directly at “victor at ", "” and describe a bit more the contributions you have in mind, the entity you belong to and the robot targets you have in mind?", "Thanks!", "Hi ", ",", "It looks an interesting initiative!", " is willing to collaborate in this project. We can contribute with our mobile robots!", "We’ll write you directly.", "Thank’s for your idea, I really agree!", "\nThe good news is: There is an industrial controller (controller + IO-system + Linux + Real-time + …) available which supports ROS.", "\nPlease send a short e-mail for more information (", ") or have a look a this ", "Very nice and exciting topic! I would love to make a robot and understand everything about how it works ", "From my experience the only thing that makes a robot industrial is the fact that companies are able to buy it and legally use it (certifications / safety). It’s not about weight, payload, speed, range, being collaborative or even how the maintenance will be done, these are to be discussed after a certification is issued.", "The dream robot for me would be:", "I think there is a real marker opportunity in making cheap capable robots, robots that do not cost much (mechanics, electronics) but have nice software inside, which would easily allow tasks that known industrial robots struggle with (vision etc.).", "For every robot that I have used so far the problem was always in the software:", "I think one big barrier is the mechanics cost: making a decent robot is complicated and expensive.", "\nThere is already a lot of open source robots that can be 3D printed, however most of them use stepper motors or servomotors which may not be the best if scaling up the robot. It could be a great start using these projects with AC or DC servos instead of servomotors.", "I can help for:", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["a robot command/programming language, equivalent to what you have for industrial robots - that’s only necessary if you want to skip the vendor’s controller", "An easy to use online programming HMI, well, that’s doable.", "A low-level real-time capable platform to drive the robot if you are not interested in using the vendors’ controller. ", " work for this.", "A reference hardware platform. I know applications are diverse, but having a common ground to start from just makes things a lot easier. An RT Linux capable platform, preferably with low-level IO access, which is powerful enough to support CV and machine learning applications should do. Turns out the ", " is a good candidate.", "No vendor lock-in.", "Easy and intuitive programming, thanks to the great HMI and teaching capabilities.", "Leverage the whole ROS eco-system for your application.", "Rebrand the product for your application.", "A reference platforms makes it easy to get started, more focus on your core business.", "Sell the hardware/software as a turnkey solution.", "Provide consulting services around ROS, robotics hardware and so on.", "Use dual licensing for commercial and open source applications.", "Provide paid premium support for the platform.", "a robot command/programming language, equivalent to what you have for industrial robots - that’s only necessary if you want to skip the vendor’s controller", "Trajectory generation, planning, and smoothing at the joint level is also missing.  This would have to be added to the low level controller in order to achieve industrial robot level motion.", "Collaborative functionality.  Might as well jump into this growing market, rather than focus on legacy applications.", "you need ", " that companies can buy, proving they can get going. They are mostly interested knowing if the tool can do the job, and what it yields them. Managers mostly decide about purchasing these tools. Concepts as ROS, Open Source or vendor lock-in are second round considerations.", "staff must be able to work with your stack solving a problem, They will help leverage the decision if they tell their Manager that they are able to work with the tools. Possibly even tried out a demo without hardware.", "If people coming from school knowing this programming language and if you’re lucky some hardware/software concepts, you’ll also solve the problem of companies trying to find educated personnel. Might be an opportunity for the ROSIN project and education.", "do not underestimate developing and selling a product, and providing support if you’re going to provide hardware/software as turnkey solution.", "consultancy would be where you have a starting point.", "Open source hardware\n", "Mechanics (dimensioning, CAD / drawings, most interchangeable parts as possible)", "Electronics (CAD / BOM)", "\n", "Open source software\n", "ROS native", "Access to the closed-loop control (monitoring, configuring etc.)", "\n", "Certified", "Not being able to run tasks concurrently", "Robot not following the setpoint (not because of the mechanics)", "Missing (paid) options", "Low memory", "ROS driver not exposing all controller functions", "And the list goes on…", "The mechanics", "The software (from real time to GUI)"], "url": "https://discourse.ros.org/t/fully-open-source-industrial-robotics-controller/5832"},
{"title": "Industrial Robot Operating System (I-ROS)", "thread_contents": [" ", "This course gives an introduction to the Robot Operating System (ROS) including many of the available tools that are commonly used in robotics. With the help of different examples, the course should provide a good starting point for students to work with robots. They learn how to create software including simulation, to interface sensors and actuators, and to integrate control algorithms.", "Why? Because creating truly robust, general-purpose robot software is  ", " . From the robot’s perspective, problems that seem trivial to humans often vary wildly between instances of tasks and environments. Dealing with these variations is so hard that no single individual, laboratory, or institution can hope to do it on their own.", "Event Link: ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/industrial-robot-operating-system-i-ros/7444"},
{"title": "ROS-Industrial Consortium Americas Training Event - March 5-7, 2019 - San Antonio, TX", "thread_contents": ["We will be putting on our first ROS-I Training event for the RIC-Americas on March 5-7, 2019 at Southwest Research Institute in San Antonio, TX. Information can be found at: ", "This will be our first training event in Melodic, and we are looking at adding to the advanced topics the Tesseract adn TrajOpt training exercise/demonstration. This is an included benefit for Consortium members, but there are spaces available for non-members for a fee. This also includes on-robot lab day.", "A detailed agenda will be posted shortly.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-industrial-consortium-americas-training-event-march-5-7-2019-san-antonio-tx/7520"},
{"title": "Reliability, safety, security, maintenance and support in ROS", "thread_contents": ["In the last edition of ", " there is an ", " (1.3 MB) with the title ", " on ROS and especially on the differences between the “ROS approach” and “existing robot manufacturers approach”. The article is written by Henk Kiela, professor in Mechatronics and Robotics. He raises some interesting points and gives advice for both ROS developers as “non-ROS developers”. I am very interested in your opinions on this article.", "It is an interesting article.", "The main takeaway for me is that ROS community prefer to go broad (the more, the better) whilst a typical robotic product need to do deeper.", "In the specific context of mobile robot navigation, it is not surprising that some commercially available solutions are better, since they could focus full time on a single use case.", "Additionally, I believe that ROS was designed from the ground up as a easy-to-learn framework for non experts; this is, at the same time, its biggest strength and weakness, since the openesses of the system also makes very hard to deal with safety.", "About the comparison table: I do not agree with a few points and it feels a little bit biased, even if I agree on most of the items (80% maube?)", "\nThere is one in particular that I consider very interesting:", "Open source is ‘free’; the effort to make it a reliable and safe system is unpredictable.", "This is unfortunately true; I have multiple examples of situations in which I could have been better served, in the long term, by an expensive COTS solution rather than the open-source “free” one.", "I have been complaining a lot about the open source model and the issue of sustainability. I like open source software (hey, I have my own OSS projects!), but it is naive to expect that:", "Thanks for sharing the article.", "Davide", "Hi,", "In my humble opinion, I do not agree with the focus of the article. I think you can not compare a final product of two companies with ROS, even if we limit it to their navigation capabilities. ROS provides a base where to build concrete applications, and it is the responsibility of the person who develops a final application to complete the generalities of ROS to adapt it to a final solution.", "There are many robot companies that have robots navigating reliably and safely in real environments using ROS. We have a Pepper navigating 24x7 in a real office environment (", ") in which, of course, there was a lot of work of adjusting parameters.", "Of course, this requires a lot of work to adjust parameters, but no more than those that would have to be adjusted in any other navigation system, with the advantage that in ROS there is a community that develops and tests software that you do not have to implement from scratch .", "Anyway, thanks for sharing,", "\nFrancisco", "Thanks for sharing, it’s an interesting article.", "I have to grudgingly agree with most of the points he makes. Right now it’s very difficult to integrate ROS safely in an industrial grade robot, having either to encapsulate the cell in a parallel, isolated safety system or making ROS act as a kind of supervisor, encapsulating more low level and safety critical systems.", "I see the value of focusing ROS on scientific research and foregoing more mundane features such as these, but support from industrial manufacturers could really ensure the longevity of the project.", " great that you brought this up for discussion and thanks!", "A few thoughts from my side: Henk summarized pretty nicely the relevance of ROS and some of the issues related to building robots from ground up. One must note that Prof. Kiela has several decades of experience in this area and a deep industrial insight. However, to the best of my knowledge, he’s not very actively involved in the ROS community (at least it didn’t feel that way last time we spoke!).", "He presents ROS 2.0 as", "a project was started recently, incorporating the new", "\nrequirement for mission-critical functionality and indeed safety", "Arguably, some members of the community will object since ROS 2.0 started quite a few years ago (e.g. see ", "). Nevertheless, ROS 2.0 has indeed become official within the last year. Much has happened since though!", "In addition and as pointed by ", ", I disagree with several aspects exposed in the comparison made in table 1. E.g., ROS is indeed being used in safe environments and just recently, at ROS-Industrial Conference, a speaker shared quite a few details about their safe setup while using ROS (1)  and how they did it (they followed an isolated safety system-approach making the ROS setup as a behavior coordinator, as mentioned by ", " above).", "Of course, this doesn’t mean they “certified ROS” (completely) and one should questions whether this makes sense at all. Selecting, however, individual ROS packages (or stacks) and adapting them for complying with a particular set of guidelines is something that several companies are already doing.", "A store of ROS-certified modules could provide a similar", "\nfunction to the user community. The certification should", "\nprovide minimum qualifications for the performance,", "\nsafety, security and maintainability of a module. Such a", "\nscheme could be adopted for ROS 2.0 in the future, but this", "\nshould also be done right away for ROS Industrial.", "I think it’s relevant to note here that by modules, Henk here refers to both software and/or hardware modules. Certification of such is an ongoing discussion and new standards like ISO 22166, hopefully, will provide some answers. A pre-requisite and one of the aspects required for modularity (and hardware reconfiguration) is interoperability. In the article, it’s claimed that “", "” in ROS. I also disagree with this. Furthermore, there exists new projects like ", " that aim to facilitate interoperability by defining a common information model that generates artifacts in an MDE fashion (while offering a structure that allows for its extension in other robotic frameworks).", "I think you can not compare a final product of two companies with ROS, even if we limit it to their navigation capabilities. ROS provides a base where to build concrete applications, and it is the responsibility of the person who develops a final application to complete the generalities of ROS to adapt it to a final solution.", "I find this statement pretty interesting ", " and while I don’t fully disagree when it comes to  “", "” , I actually have a pretty strong opinion about the usefulness of ROS (ROS 2 in particular) to compare different individual components. Our team, often, finds that comparing two different pieces of hardware of the same kind (e.g. two cameras or two actuators aimed for a similar task) is actually pretty hard. Specially because things like communication interfaces and APIs differ substantially (which makes system integration a complete hell most of the time).", "Our approach for the last years has been to “find common ground” to attack these comparisons. Typically, assuming you have component A (", ") and component B (", ") with their respective interfaces, let’s say ", " and ", ",  to compare them. Often, you’d go ahead and create an abstraction layer on top of ", " and ", " called ", " that allows you to speak to both components and effectively make the comparisons. This way, you can inspect which component ", " or ", " actually performs better for your needs.", "To us, ", ". I think this is one of the core principles of ROS and also, the reason why we selected it when we started building ", " years ago covering not only logical and electrical interfaces but a wide variety of aspects required to go from a component to a module (note that modules imply certain characteristics including interoperability).", "Now, back to your statement, I believe it depends very much on the “final product” (assuming we’re speaking of robots, final robots) itself. E.g., we started a while defining ", ". While this is still a work in progress, we managed to interface with several 6DoF arms (", ") and that provided quite a bit of insight that we later used in the development of our latest robots so I’d argue that you can actually compare ", " final products with ROS.", " I’m very interested to hear what’s your reaction to this since as I said, we’re still exploring this path and we certainly could use additional insight.", "ROS is indeed being used in safe environments and just recently, at ROS-Industrial Conference, a speaker shared quite a few details about their safe setup while using ROS (1)", "  Is there a recording of this talk?", "there is an inofficial ", " of the talk … and there will be a publication of the talk via the official ", " channel with dedicated playlists for each day of the conference … I will keep you posted…", "there is an inofficial ", " of the talk …", "I think ", " means the talk from Georg Heppner and Fabian Fuerst (Flexible Automotive Assembly with Industrial Co-workers).", "Georg Heppner and Fabian Fuerst (Flexible Automotive Assembly with Industrial Co-workers).", "that was on Day 3, the playlist for ", " is not yet finished. Sorry, it looks like you will have to wait until January 2019…", "  That is great to hear.  Thanks for making it available.", "Hey there, happy new year.", "As ", " said, it’s the talk about Flexible Assembly. AFAIK it’s not ready just yet. Let’s wait until ", " and his colleagues publish it.", "Would be happy to keep discussing it then.", "Cheers!", "Here is the ", " of ROS-Industrial Conference 2018 in Stuttgart, Germany.", "The talk on Flexible Automotive Assembly with Industrial Co-workers", "\nby Fabian Fuerst, Opel, and Georg Heppner, FZI", "\ncan be ", ".", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["The quality of an horizontal OSS software match the quality of a vertical and commercial one.", "That it is possible to create high quality software without a sustainable way to pay full-time, highly-skilled developers."], "url": "https://discourse.ros.org/t/reliability-safety-security-maintenance-and-support-in-ros/7146"},
{"title": "Integration of 6-axis manipulator and 2-axis positioner (external axes)", "thread_contents": ["I am currently working on setting up a 6-axis welding robot with a 2-axis positioner for wire and arc additive manufacturing (WAAM). What we are attempting is very similar to what ", " describes here: ", "So what we would need to do is to integrate the manipulator and positioner w.r.t. kinematics and planning including collision avoidance so that the planner can account for simultaneous motion of both the manipulator and positioner. I am assuming that Descartes might be able to plan trajectories for both groups simultaneously including collision avoidance.", "I am not sure if there are already packages available for this type of setup (manipulator and 2-axis positioner) and could not find much in public repositories. Therefore, I have started to develop support and moveit_config packages for our WAAM system based on the assumption that our manipulator-positioner setup would be very similar to a two-arm system. The design of the manipulator-positioner support package is therefore roughly modeled after the Motoman SDA10f support package. The moveit_config package was created using the moveit setup assistant and this tutorial: ", ".", "The packages can be found here:", "\n", "Contribute to Adamsua-lab/motoman_ma2010_d500_waam_support development by creating an account on GitHub.", "\n", "\n", "Contribute to Adamsua-lab/motoman_ma2010_d500_waam_moveit_config development by creating an account on GitHub.", "\n", "They depend on the ", " and ", " packages, which can be found in this fork of the ros-industrial/motoman repo for the time being: ", ".", "I am now wondering if this is the correct approach to achieve the integration of manipulator and positioner.", "\nI am posting this here and not in ROS Answers as I can imagine that using a manipulator together with a 2-axis positioner is found frequently in the industry and is therefore of general interest. I am also hoping that my attempt and struggles to make this work (see below) might help further the discussion on this subject.", "I have tested the ", " package using ", ". But there seems to be an issue with the service ", ". The following error messages are thrown:", " is indeed running but ", " seems to be stuck for some reason. The service is actually listed when running ", ".", "When I instead launch ", ", I can plan and execute manipulator pose goals successfully.", "I have a slight suspicion that there is something wrong with the controller-setup or something related to it as the ", " and ", " files launch different controllers.", "I am getting essentially the same behaviour as described above when running the same two launch-scripts of the ", " package.", "Has anyone encountered an error like this before and would know how to solve it?", "I think you indeed miss the controllers, see ", " for a similar issue.", "The ", " is included in ", " of the moveit_config package and contains 3 controllers. One for all joints (arm and positioner) and two for the arm and positioner individually. This is the same approach as found in the dual arm ", " package. The latter two controllers have non-empty names and that seems to be a problem based on the issue that you are referencing. If I, however, remove the last two controllers, so that only the unnamed remains I get the following error when I try to execute a planned trajectory (in simulation):", "I do not have experience with multi-group systems in ROSi and could not find much except for existing multi-arm systems to go from. According to ", " tutorial, “A non-empty “name” parameter may be required if multiple robots are being controlled, to provide separate namespaces.” Naming the controllers is, however, apparently an issue as stated here: ", ". Could a possible solution be to push the ", " server down into a namespace (e.g. remap it)? And would I have to spawn two ", " servers, for arm and positioner?", "Dear Thomas (", "),", "as a general remark as you posted a question seeking for “Answers” on “ROS Discourse”.", "Please read the support guidelines,", "\n", "\nquestions should be directed to ", "\nnot to the discussion forum.", "Please also do not double post things, especially without cross references as that will potentially cause multiple people", "\nto take time to answer your same question in the different forums without knowing that someone else has already take the time.", "Thank you", "Thilo", "In this case I suggested to post here on ROS Discourse, as in a private email, it appeared that the topic that ", " is seeking support on is more a discussion topic (as in: is it even possible, what are the potential (dis)advantages of the different approaches) than a Q&A which actually has a single “best” answer.", "In general though ", " I agree with you.", "Hi ", " and ", ",", "I contemplated posting this on ROS Answers because there is an immediate issue I am facing with this and a direct question to which there might be a direct answer. However, integrating a manipulator with a positioner (or more broadly multi-group systems) w.r.t., configuration, kinematics and path planning   seem to be discussed in general terms based on the replies to Victor’s post referenced earlier.  Therefore, once it is clear whether my approach above is the way to go and my immediate issue mentioned above has been resolved, a further and broader discussion of general interest might also be necessary on collision avoidance and path planning (e.g., can Descartes do this? If not, how can it be done?). I’ve kind of tried to bring this point across in my initial post but did it rather poorly.", "Long story short, I thought that what I am trying to do here could help keeping this whole discussion about  kinematics and planning of external axes going.", "If you prefer this to be posted on ROS Answers, I can of course do so.", "If you prefer this to be posted on ROS Answers, I can of course do so.", "no, I agree with ", " that this is a rather a discussion than a simple question-answer thing.", "Hopefully the discussion here also goes back to your initial topic of ", " & we can stop this meta-discussion on whether to post it here or there ", "pardon - culpa mea", ": can you describe the configuration of the Yaskawa controller? How are all the axes configured there? Two groups (one for the 6 axes of the robot, the turntable in another)?", "If this is setup as a multi-group system, then you need to configure ", " for that. I can’t be certain that you’ve done that from the description you’ve given here and the packages that you’ve made available.", "Just to make sure: refer to ", " for an example configuration file (note: the title says “dual arm system”, but the idea is the same for any multi-motion group setup).", "Do note that there are (still) some issues with such setups. Be sure to check the ", " issue tracker.", ": both manipulator and positioner are integrated with a DX200 controller. Here is Eric Marcil’s answer to a similar question:", "Yes, the same controller will support both the robot and the station.  Each one is considered a control group.", "So any example combining two robots is essentially the same as combining a robot with a station.  The only difference is that the station has less joints.", "If you look in the simple message structure there is a field for groupNo.  For your system:", "0 = robot", "\n1 = station", "If I remember correctly, there are two approaches.", "You can send multiple messages for each group using SmBodyJointTrajPtFull", "\nOr you can send a single message with multiple group info using SmBodyJointTrajPtFullEx", "I believe that the second one is usually recommended if you are trying to coordinate the motion between both groups.", "So I think our system is in deed setup as a multi-group system. It has actually not been delivered yet but we should have it up and running some time in March. So far, I have been running ", " to simulate the robot and that is when I’ve run into the above errors. So the question would also be whether the industrial robot simulator has multi-group capabilities since simulating the robot prior to execution is also required.", "I have not configured the ", " but will look into that next.", "I should probably have noticed this earlier, but:", "I am currently working on setting up a 6-axis welding robot with a 2-axis positioner for wire and arc additive manufacturing (WAAM).", "This made me believe you were already working with real hardware, which is not the case.", "It has actually not been delivered yet but we should have it up and running some time in March. So far, I have been running ", " to simulate the robot and that is when I’ve run into the above errors.", "The fact that you’re only simulating leads to a very different diagnostic approach.", "So the question would also be whether the industrial robot simulator has multi-group capabilities since simulating the robot prior to execution is also required.", "This is the only question at the moment really.", " does not have multi-group support (or at least, the v1 version doesn’t). And: even if it had, none of the configuration files in the packages would have told it what those groups would be. Only the MoveIt side has information on joints in groups (from the ", ") and those are not used by anything else.", "This is actually the cause of the issues here: no matter how you configure the MoveIt side, there are never two Action servers with the current ", ", so this is not going to work.", "What you could do is start two instances of ", ", each with their own set of joints, in two different namespaces (one for each group). That would be similar to how ", " would expose the two groups. If you have that setup, you can start working on the MoveIt side.", "I have not configured the ", " but will look into that next.", "Without real hardware there is no need. Only ", " uses that configuration.", ": both manipulator and positioner are integrated with a DX200 controller. Here is Eric Marcil’s answer to a similar question:", "Could you please – in case of parallel requests for support through different channels – always present/include pertinent information in posts like yours?", ": please see ", ", which is an example of how your setup could be approximated using the ", ".", "It’s not exactly how it would be with ", ", but close enough to give you an idea.", "Note: I’ve also changed your MoveIt configuration to use chains for the two groups and used ", " instead of KDL (with ", " solve type).", "If/when you have your real hw, we can revisit this.", "Note: this only gets you to the ", " problem / challenge: planning for the combined scene (or at least: with kinematics involved).", "Thank you very much for the PR, ", ".  I’ve changed ", " and related scripts to launch two namespaced instances of ", " when argument ", " is set to ", ". I had tried to “push down” the simulator and ", " server instances individually using ", " before without success. Your approach using groups seems to work without issues.", "I can now successfully plan and execute pose goals for the manipulator and positioner individually in rviz. This should solve the initial issue I described for simulation. Once our system is ready to use, I will carry out the same tests on the physical robot.", "Note: this only gets you to the ", " problem / challenge: planning for the combined scene (or at least: with kinematics involved).", "The end goal for our application of metal additive manufacturing (and I am assuming for many others using the manipulator/positioner combination for various purposes) would be to plan paths not only based on getting from point A to B whilst avoiding collision but planning manipulator and positioner (and thus workpiece) pose trajectories from tool paths that are generated from CAD-2-path tools. Such tools (e.g., slicers such as the ", " package) generate tool paths with many via points based on the workpiece geometry. This response by ", "  to a post on ROS Answers explains the difference and challenges involved very well IMO: ", ". Based on that post and my preliminary testing when only considering the manipulator for planning, ", " seems to be a suitable alternative but also MoveIt! has some capabilities for planning Cartesian paths with waypoints: ", ".", "I think the challenge as far as I can tell now is the combined planning of workpiece and manipulator trajectories with collision avoidance and then also the synchronization of end-effector commands (e.g., welding torch on/off).", "Any ideas for avenues to go down or suggestions of tools that can be used or adapted to ultimately achieve this final objective would be much appreciated.", "Could you please – in case of parallel requests for support through different channels – always present/include pertinent information in posts like yours?", "For sure, will do that in the future. This particular reply form Eric was part of an email exchange with me a few months ago where I tried to get a sense of the general Yaskawa system capabilities related to ROS.", "I’ve changed ", " and related scripts to launch two namespaced instances of ", " when argument ", " is set to ", " . I had tried to “push down” the simulator and ", " server instances individually using ", " before without success. Your approach using groups seems to work without issues.", "I’ve left a comment on my PR that I believe is important.", "You may have done it on purpose (as you have no hw yet), but your ", " as it is right now will not work correctly when trying to execute trajectories for the two groups separately.", "I think the challenge as far as I can tell now is the combined planning of workpiece and manipulator trajectories with collision avoidance and then also the synchronization of end-effector commands (e.g., welding torch on/off).", "Any ideas for avenues to go down or suggestions of tools that can be used or adapted to ultimately achieve this final objective would be much appreciated.", "I would take a look at ", " by ", ", which builds upon the work by ", " et al (", " and ", ").", "Their presentation at ROSCon’18 last year shows what those packages can do: ", " (", ", ", ").", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/integration-of-6-axis-manipulator-and-2-axis-positioner-external-axes/7931"},
{"title": "ABB ROS Server controlling IRB6400R through S4C Controller", "thread_contents": ["Hi everyone,", "We have an ABB IRB6400R at work using a S4C controler. I would like to control the manipulator through an ABB ROS Server that will be installed on the S4C controller.", "My questions to you are:", "\n", "\n", "Hope you guys have some answers or hints, any feedback is welcome.", "I’m not aware of anyone using the current driver on anything but an IRC5, but it’s also not very complicated code, so it might be possible. There is the current assumption that network sockets can be used, so that would seem to be a “hard requirement” right now.", "As to downloading vs streaming: the ABB driver currently uses downloading as it was assumed – at the time it was written – that the streaming approach would result in worse performance. That may not be true, so it’d be good to see whether the streaming approach can also be implemented.", "I would not limit this question to S4C controllers specifically, although I can understand why you would – seeing as you have one.", "It might be nice to see whether there are some streaming approaches available somewhere – anywhere, doesn’t need to be ROS-specific. If there are, we could either adopt or adapt them.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/abb-ros-server-controlling-irb6400r-through-s4c-controller/8184"}
]