[
{"title": "ROS Teleop package", "thread_contents": ["Hi everyone,", "I am making my own robot (quite similar to Turtlebot in terms of components) and I am working on a P controller to make my robot go straight forward: both motors should have the same velocity, regardless the surface differences in each wheel and the unbalances of the robot itself. The controller is implemented on an Arduino board.", "So I wonder, how does the Turtlebot go straight? There must be some kind of control made! Is the code on the Opencr (the “Arduino” that serves as motor controller) open source? When you run the Teleop package in the Turtlebot, you just move it and it works, but… is there any way to research what is happening in a lower level?", "Thank you", "Hi,", "I believe that the answer that you are looking for is in this code: ", "\nA Turtlebot2 has a base called Kobuki. Such base is where the controller is located.", "I did not really check it properly, but I am pretty sure that the specific code that you can use as a reference is there. Check the following files: include/kobuki_driver/modules/diff_drive.hpp and src/driver/diff_drive.cpp", "If you have problems with the controller, send me a private message ", "Hi,", "I think he was talking about the Turtlebot 3 (he mentioned the OpenOCR board).", "I might be wrong because I have never used a Turtlebot 3 but the fact that it goes straight might come from the fact that the motors used are Dynamixel servos. These motors already integrate a controller (PID like). So as the 2 wheels are supposed to turn at the same speed, the robot gave more chances to go straight.", "Well, in any case, he is not using a Turtlebot 2 or 3. He is developing his own controller with an Arduino board… The easiest way of doing it is to count the ticks on the odometry (", "). If you actuate over the motor to make the number of ticks on the left wheel equal to the ones on the right wheel your robot will “go straight*”.", "If you have servo motors, control the speed is just give them the correct input. But if you pay attention to the differences on the odometry your system will be more robust.", "\nIf you do not have servo motors, you will need the odometry to close the speed loop on the controller. But again, pay attention to the differential odometry will increase your performance.", "*I said “go straight” because this system is easy, but far away from being perfect. Imagine that the weight of your robot is unbalanced to the left side. If you have soft wheels, the one on the left will deform more than the one of the right. Thus his radius will be smaller, and each tick of the odometry will be a movement slightly smaller on that wheel. After some distance, you will see your robot slightly turning.", "You can check out Linorobot’s implementation:", "The idea is to have a PID controller for each motor to maintain the required speed defined by Teleop package or Navigation Stack. This requires:", "PID SETPOINT  : The converted required speed (geometry_msgs/Twist) from m/s and/or rad/s to RPM (Rev Per Min). The kinematics library does the conversion for you, just pass the required velocities and it will return the required RPM for each motor.", "PID FEEDBACK : Calculated motor RPM based on the wheel encoder’s ticks per rev over time.", "The PID’s output is then used to determine the PWM value required to drive the motor.", "Do this in a loop and you get a controller.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["void moveBase()", "{", "Kinematics::rpm req_rpm;", "\n", "//get the required rpm for each motor based on required velocities, and base used", "req_rpm = kinematics.getRPM(g_req_linear_vel_x, g_req_linear_vel_y, g_req_angular_vel_z);", "\n", "//the required rpm is capped at -/+ MAX_RPM to prevent the PID from having too much error", "//the PWM value sent to the motor driver is the calculated PID based on required RPM vs measured RPM", "motor1.spin(motor1_pid.compute(req_rpm.motor1, motor1.getRPM()));", "motor2.spin(motor2_pid.compute(req_rpm.motor2, motor2.getRPM()));", "motor3.spin(motor3_pid.compute(req_rpm.motor3, motor3.getRPM()));  ", "motor4.spin(motor4_pid.compute(req_rpm.motor4, motor4.getRPM()));    ", "\n", "//steer if Ackermann base", "#if LINO_BASE == ACKERMANN", "    steer();", "#endif", "}"], "url": "https://discourse.ros.org/t/ros-teleop-package/5062"},
{"title": "Increasing the frequency at which the sensor state is published with Kobuki base", "thread_contents": ["Hi, I’m using a Turtlebot 2, Kobuki base. I replaced the cliff sensors in order to be able to detect the narrow darker spaces between floor tiles. It works at low speed but, at higher speeds, the transitions are not detected because the traveled distance between two sensor updates is too long.", "\nIs there a way to increase the frequency of publication of the sensor state message?", "\nThanks for any input.", "\nRegards.", "Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ROS Answers provides a forum which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/increasing-the-frequency-at-which-the-sensor-state-is-published-with-kobuki-base/5252"},
{"title": "Turtlebot + Alexa", "thread_contents": ["Hello everyone!", "Firstly, I’d like to start by introducing myself. My name is Antonino and I’m a teacher in a secondary school in Spain.", "Next course, I want to buid a social robot with my students. I have thought to use a turtlebot 2 and Alexa to comunicate with it. I have chosen this combination because I think it’s the easiest way to do it with my students, who are about 15 years old.", "I have found a library, flask-ask-ros, and I want to use it.", "As you can imagine, I’m going to need a lot of help, for this reason, if someone wanted to help us, it would be fantastic.", "If someone has another option to build something like this, don’t hesitate to say.", "Thank you in advance and best regards.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/turtlebot-alexa/5289"},
{"title": "Looking for ideas for interesting ROS \"real world\" pedagogical example", "thread_contents": ["For my Robotics course, I decided to change a little how I teach ROS. I would like to give students a worked example, not trivial but not super complicated, that they can run on a TurtleBot{2,3} and that it will do something cool.", "Furthermore I would like the source code to be exemplary, and then ask them to try to figure out how it works and then make a simple modification.", "I think a very early visible success will motivate them for the steep learning curve to come.", "I am looking for a suggestions on what this “real world” example would do - or even if someone has developed this who would like to share their work.", "Good idea. I liked. Sometimes I used this methodology to teaching reliability in robotics.", "can you define “real world”?", "if not, and if you are constrained to TurtleBot2 or TurtleBot3, then a nontrivial example is exploration of a static, indoor, office environment with gmapping (", ").", "Thanks for your suggestion! I looked at the provided but I am not sure exactly where to take it in the context of my question. It sounds intriguing though. Could you give a few more details?", "I meant an example that is meaningful and not just a way to play with topics, services and so on. I also meant something where I can provide the basic working code and have some interesting changes that students can make and see the results of before they really know ROS, kind of to build their appetite.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/looking-for-ideas-for-interesting-ros-real-world-pedagogical-example/5398"},
{"title": "[TB3] Tutorial for Task Mission in ROS Development Studio", "thread_contents": ["Have you ever want to see your ROS projects by your smartphone or tablet?", "\nDo you know that ROS can be used in a web browser?", "ROS Development Studio(RDS, by The Construct) is working on it!!! ", "This tutorial shows how to open ROSJect and how to load world and Turtlebot3 with OpenManipulator.", "If you want to get more information about RDS, please follow attached link!!", "\n", "For more information, please refer to the manuals and videos below. ", "Virtual hands-on tutorial ", " TurtleBot3 with OpenManipulator Task on RDS(ROS Development Studio)", "\n", "TurtleBot3 e-Manual about RDS and TurtleBot3", "\n", "ROS Development Studio (Sign-up for FREE)", "\n", "How to use ROS Development Studio", "\n", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-tutorial-for-task-mission-in-ros-development-studio/5651"},
{"title": "[TB3] TurtleBot3 AutoRace in ROS Development Studio", "thread_contents": ["This video is second tutorial with ROS Development Studio(by The Construct).", "If you can only access the web, you can run Autorace with TurtleBot3 anywhere for free.", "AutoRace is autonomous driving package with real TurtleBot3 or gazebo.", "If you want to more infomation, please refer to below link.", "[TurtleBot3 e-Manual about RDS and TurtleBot3]", "\n", "[ROS Development Studio (Sign-up for FREE)]", "\n", "[How to use ROS Development Studio]", "\n", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-autorace-in-ros-development-studio/5660"},
{"title": "[TB3] TurtleBot3 Hardware: Free for YOU!", "thread_contents": ["[TurtleBot3 Hardware: Free for YOU!]", "Hi, All ", "We are very pleased to announce the TurtleBot3 hardware through ", ".​ You can look deeply into TurtleBot3 hardware configurations via Onshape, download STL files for 3D printing, copy design drawings, and even re-edit them. All this is done in a web browser. Oh! I forgot. You can do it on any devices and operating systems, such as your tablet, smartphone. Check it out now. ", "BURGER: ", "WAFFLE: ", "P.S", "\nBasic / Premium is kinda stereotype naming,", "\nso we decided to give cool names (BURGER and WAFFLE). ", "Export as stl doesn’t seem to be available, at least I have not found a way. In the context menu the only option available for me is to open the item in a new tab. Is there a permission problem?", "Thanks, the requirement for an account was not obvious to me.", "Is there a plan to host just the STL files somewhere so that no Onshape account is required?", "PS. I love the names (Burger and Waffle).", "Yes. We released it to Onshape for users who want to modify the design files.", "\nBut we will be able to download the STL or STEP files from the GitHub, Thingiverse, GrabCAD, etc.,", "\nfor users who just want to print or view it.", "Thank you. ", "Hello!", "\nI’m looking for the vector drawing of the waffle plate.", "\nI tried to find the files on GitHub, Thingiverse and GrabCAD but couldn’t find it anywhere. Could you please send the link to it?", "Thanks in advance!", "Hi ", ",", "\nThe Information about the hardware mentioned above can be found in the manual below. We are mainly using Onshape now, and we will arrange for the Thingiverse to go up soon.", "\n", "Hi ", ", thanks for your advise. Unfortunately, as ", ", i couldn´t find any data exept on “ONSHAPE” I applied for an account but got the answer that they have to check.", "\nIt seems that they want to sell some membership. If you dont have an account you can not download from onshape.", "\nSo right now, one can not get the Hardware - Files for free as stated above.", "I guess it would be great help for all turtle-fans if the CAD-Date will be available on real open-source-platforms.", "\nEspecially the waffle-plate would be a great help since it is the base of all.", "Thanks for any help on this", "Hi ", ", you can download it in the following way. I just tested and downloaded without any problems.", " ", "with onshape you can not create a new account.", "\nYou can request one. But then you get an email from onshape saying: “Thank you for your interrest in onshape business solutions. Our Sales will get in contact with you…”", "\nI do not get login information from onshape.", "Anny help on this?", "Why don’t you just use bugmenot to login into onshape?", ": Thanks for the advise. I didnt even know that this extists.", "\nI tested the two but both of them were invalid.", "Since the first one (", ") did work for me there might me something wrong with your browser.", ": Thank you very much. It worked in MS-Edge but not in Firefox .", "\nYou really helped me a lot!", "Hi ", ", ", "We upload the STL file to the Thingiverse for the convenience of users. Please use it when you need it. ", "\n", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Sign in. (If you do not have an ID, you have to create one.)", "Click the “toggle tab manager” (A menu will appear on the left side of the browser.)", "Click the “Parts folder”", "Right-click on the icon of the file you want to download.", "Click the “Export…”", "Finally, you can download the output file type you want.", "Sign in. (If you do not have an ID, you have to create one.)", "Click the “toggle tab manager” (A menu will appear on the left side of the browser.)", "Click the “Parts folder”", "Right-click on the icon of the file you want to download.", "Click the “Export…”", "Finally, you can download the output file type you want."], "url": "https://discourse.ros.org/t/tb3-turtlebot3-hardware-free-for-you/1444"},
{"title": "Setup Turtlebot2 with a new laptop", "thread_contents": ["Hi, I found a very old Turtlebot2 without it’s netbook and I am thinking of playing around with it. The problem is I cannot figure out how to setup my laptop to run as the ‘netbook’ on the mobile turtlebot2. Can anyone just point me to the right tutorial or documentation?", "Hi batman,", "In the future please refer to ", "\nThe discourse is primarily used for discussions, news, and announcements.", "To answer your question:", "\nCheck out the Turtlebot wiki:", "\n", "The instructions are for Indigo, but you can use Kinetic, Lunar, etc, by following the installation pages:", "\n", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/setup-turtlebot2-with-a-new-laptop/5987"},
{"title": "need turtlebot 2 IR informations", "thread_contents": ["Hi friends,", "\nI’d like  to use kobuki dockstation with a modded robot, a QBO V1 !", "\nCould you tell me IR Receivers specs ?", "frequency,", "\nmodulation,", "\nanything else ???", "Thanks All,", "Vincent, a kobuki owner !", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/need-turtlebot-2-ir-informations/6241"},
{"title": "Upgrading Turtlebot3 with better LIDAR", "thread_contents": ["Hello all,", "LDS-01 LIDAR that comes with turtlebot3 is good for small indoor places. But when I try to use it autonomously in larger indoor places it starts to behave unreliable.", "\nSeems like LDS-01 range is not good enough. My plan is to upgrade my Turtlebot with better LIDAR.", "What LIDAR would you suggest me for price up to $350?", "consider adding video.  Landmark navigation works well for longer distances and outdoor environments.  After all this is what humans do when driving a car.  They look out the window and see that big green building and know that is where to make the left hand turn.     I think vision is best for a certain scale and lidar best for getting through a doorway without hitting the jambs.", "There is another class of vision-based navigation that is different, this is where they convert a stereo 3D image to simulated LIDAR data.   I am ", " talking about that.   I mean that you recognize the landmarks and enter them into a list.   Then when the landmark is re-recognized the list is consulted.    This can be robust if multiple landmarks are in sight and location is determined by triangulation.", "The same camera data can be used by other algorithms for “visual odometry” possibly using optical flow", "Then as the robot approaches a wall or door the lidar data becomes useful again.", "That said, a lidar upgrad is conceptually simpler", "Hi Chris,", "\nthanks for replay ", "I also plan to use Intel R200 in combination with LIDAR. But I plan to convert its 3D data into 2D laser scan.  With LIDAR I also have issues when robot cannot recognize obstacles that are higher than LIDAR can detect.", "\nBy adding R200 I hope it will detect these obstacles more reliably.", "\nDo you have more information about using 3D camera as you described above?", "I still think that my LDS-01 is bottleneck of my robot. ", " looks like very good LIDAR for its price.", "\nRange is 3.5x better, sample rate is 4.5x better and accuracy also looks better.", "\nWhat do you think, is there any better LIDAR with similar price?", "Yes, that is a common “trick”, you convert 3D camera data so that it looks like LIDAR data then you don’t have to change the SLAM software.   But the ONLY advantage is not having to change the SLAM software.", "There is another use of the vision camera where the most simple explanation goes like this:   The robot rolls into a kitchen and vision based software recognizes the front of a stove.  Then the SLAM system says “in am in front of the stove”.   There is no point cloud in this method.", "If you clapse the 3D image to 2D then you are also tosing out most of the information", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/upgrading-turtlebot3-with-better-lidar/6603"},
{"title": "Fusing R200 and LIDAR data | SLAM | gmapping", "thread_contents": ["Hi all,", "I’m using LDS-01 LIDAR for creating 2D occupancy grid. It is accomplished using ", " and it works reasonably good. LIDAR gives good precision but information is collected in 2D plane. It cannot detect obstacles higher or lower than LIDAR and that is reason why generated map is not realistic. Robot keeps hitting tables, chairs, fans, etc…", "\nI bought Intel R200 depth camera to solve this problem but I cannot find solution.", "As gmapping is laser-based solution I tried to convert PointCloud2 depth data to laser scan data using ", " package. It correctly shows obstacles in rViz but looks like gmapping does not support multiple laser sources.", "\nThen I tried to use ", " package to merge two laser sources…  But looks like laser scan data that is generated with depthimage_to_laserscan package is not compatible with laser scan data that LIDAR provides. This is error that ira_laser_tools is reporting:", "burger@burger-UP-CHT01:~$ roslaunch ira_laser_tools laserscan_multi_merger.launch", "\n… logging to /home/burger/.ros/log/4979d2f4-d902-11e8-a0f5-00c0caa51893/roslaunch-burger-UP-CHT01-5052.log", "\nChecking log directory for disk usage. This may take awhile.", "\nPress Ctrl-C to interrupt", "\nDone checking log file disk usage. Usage is <1GB.", "started roslaunch server ", "PARAMETERS", "NODES", "\n/", "\nlaserscan_multi_merger (ira_laser_tools/laserscan_multi_merger)", "ROS_MASTER_URI=", "process[laserscan_multi_merger-1]: started with pid [5075]", "\n[ INFO] [1540546555.340892157]: Subscribing to topics 2", "\n/scan /scan_r200 [ WARN] [1540546555.411538397]: Transformer::setExtrapolationLimit is deprecated and does not do anything", "\n[pcl::concatenatePointCloud] Number of fields in cloud1 (5) != Number of fields in cloud2 (4)", "\n[pcl::concatenatePointCloud] Number of fields in cloud1 (5) != Number of fields in cloud2 (4)", "\n[pcl::concatenatePointCloud] Number of fields in cloud1 (5) != Number of fields in cloud2 (4)", "\n[pcl::concatenatePointCloud] Number of fields in cloud1 (5) != Number of fields in cloud2 (4)", "\n[pcl::concatenatePointCloud] Number of fields in cloud1 (5) != Number of fields in cloud2 (4)", "\n[pcl::concatenatePointCloud] Number of fields in cloud1 (5) != Number of fields in cloud2 (4)", "\n[pcl::concatenatePointCloud] Number of fields in cloud1 (5) != Number of fields in cloud2 (4)", "\n[pcl::concatenatePointCloud] Number of fields in cloud1 (5) != Number of fields in cloud2 (4)", "\n[pcl::concatenatePointCloud] Number of fields in cloud1 (5) != Number of fields in cloud2 (4)", "\n[pcl::concatenatePointCloud] Number of fields in cloud1 (5) != Number of fields in cloud2 (4)", "\n[pcl::concatenatePointCloud] Number of fields in cloud1 (5) != Number of fields in cloud2 (4)", "Is there any other solution to fuse depth information from R200 with LIDAR data and use it with gmapping SLAM?", "Hi,", "Ok…couple of things:", "A bi-dimensional map with some extra knowledge: If you only have a 2D map and your robot is hitting tables and chairs…well, include in your map those tables and chairs. If your table is static, just draw it on your map. The navigation system will take care of not hitting it…Also, if the robot can go under the table, can be as if you have not a table at all, so sometimes makes also sense to make your robot not that tall. Chairs are a little bit more tricky.", "Think in the map that you are doing with gmapping as an hiper-static map. Nothing is expected to move there. You have to keep there only walls, tables that does not move and things that will remain in their position. If you include chairs and move those around you will make the work of your amcl harder.", "The navigation stack is awesome: you have your map with static obstacles. Use it only for localization! The navigation stack can afford several laser inputs and draw dynamically objects that moves, appears and disappears. If you have a reliable positioning, it will not be hard to add those obstacles and avoid them.", "Finally…and focussing in the ira_laser_tools. I would just look at the fields of cloud1 and cloud2. Probably are not the same kind of message. Could you please check rostopic info name_of_topic in both of them and tell us the type of message that they are using?", "The general solution to the problem is still unsolved.    You are not going to find a turn-key solution.", "I think a key insight I got from reading is that SLAM a very different problem from collision avoidance and you need different software pipelines for each problem", "It makes sense to divide obstacles into two classes “dynamic” and “static”.   Anything that can be moved is “dynamic” and you treat it as if it were another vehicle.  They are all moving objects that are in your shared environment.", "Funny that LIDAR works best for indoor static obstacles  (like walls) but outdoors LIDAR is used to track dynamic obstacles (like other cars)", "You might use a single 3D depth camera for both SLAM and collision avoidance but you’d have to split the data and send it to different pipelines.", "For SLAM you would prefer the sensor to be at about human “eye level” where the indoor space is more stable and it can see over most furniture.   And as I said collision avoidance is best treated separately from SLAM", "The navigation stack supports obstacle avoidance from 3D point clouds out of the box. Here’s the tutorial:", "It’s better to ask this kind of question over at ", ". If you encounter problems while following the tutorial, create a question over there and copy a link here, I’ll try to answer.", "hi Edu,", "I know that I can manually edit 2D map but It won’t be easy task for larger maps, that is reason why I’m looking for solution to do it automatically using existing R200 camera.", "\nNavigation stack works great, I don’t have complaint for it, it works great with multiple laser scanners, PointClouds, just great. But I’ll still like to make more realistic map that will prevent robots to navigate under table if robot is taller than table and similar situations.", "\nR200 camera cannot detect obstacles that are closer than 0.5m and it makes it useless for Navigation stack.", "\nI’ll give you example. When I try to navigate from point A to point B and there is desk in between, robot will try to get closer to table, when it approaches at distance less than 0.5m, R200 camera cannot see that table anymore and robot will keep trying to go under table and result in hitting it.", "Finally…and focussing in the ira_laser_tools. I would just look at the fields of cloud1 and cloud2. Probably are not the same kind of message. Could you please check rostopic info name_of_topic in both of them and tell us the type of message that they are using?", "Both of these topics are ", "@ ", "\nI also tried using cartographer SLAM to make map and it supports to have multiple laser scanner sources. With this approach I can collect information from both, LIDAR and R200 camera. But map that is generated cannot be used effectively by navigation stack. I’m looking for solution how to convert map generated by cartographer SLAM and to use it by navigation stack.", "@ ", "\nI’m already using both sensors in navigation stack, but I still need solution for using both sensors for creating more realistic map.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["/laserscan_multi_merger/cloud_destination_topic: /merged_cloud", "/laserscan_multi_merger/destination_frame: /base_link", "/laserscan_multi_merger/laserscan_topics: /scan /scan_r200", "/laserscan_multi_merger/scan_destination_topic: /scan_multi", "/rosdistro: kinetic", "/rosversion: 1.12.14", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n"], "url": "https://discourse.ros.org/t/fusing-r200-and-lidar-data-slam-gmapping/6653"},
{"title": "TurtleBot 2 for Melodic", "thread_contents": ["This ROS Answers post suggests that Turtlebot 2 packages will be released for Melodic:", "Does anyone have a rough time-line for this?  I’ll be teaching a Turtlebot-based robotics course in the spring and I need to make decisions soon about the OS and ROS versions to have installed on lab computers.", "I’m in exactly this same position. I’ve got a student standing by to start my installations for my spring robotics course but I’d really like to know whether Turtlebot 2 is likely to be available on Melodic in time. Any hint about the timing on this would be appreciated! (I certainly understand that exact timing is impossible to predict.)", "You can always build the relevant packages from source! If I recall correctly, then Turtlebot 2 (and Turtlebot) were last released in Kinetic, though I have been able to get my Turtlebot running in Lunar (have not tested with melodic yet) by just building the necessary packages with ", ".", "Thanks for the suggestion!  I may try that out.  However imaging and maintaining a large number of lab machines is much easier for our sysadmin if I can just send him a list of packages.", "Turtlebot packages don’t seem to be available for Melodic yet. There’s a ticket ", ".", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/turtlebot-2-for-melodic/6069"},
{"title": "[TB3] Introducing ROS2 Tutorials", "thread_contents": ["Hi ", "Today, we are introducing new packages about TurtleBot3 for ", " !!!", "Anyone who has TurtleBot3 can download revised Raspbian OS for Raspberry Pi 3, turtlebot3_core.ino for OpenCR and related packages(", ")", "TurtleBot3 ROS2 packages includes bringup package, tele-operation package and cartographer package.", "If you want to use TurtleBot3 in ROS2, please visit our e-manual ", "We specially thanks to OpenRobotics Memeber , ", " developer and ROS community and", "\n", " developer ", ", ", ", ", ", ", "We are releasing the software we used. Please refer if necessary.", "ROS2 source code for TurtleBot3", "One of the main points of ROS2 is MacOS and Windows support.", "\nI am able to build and run ROS2 on my Mac, but I’m having trouble getting the turtlebot3 metapackages installed and running. I’m obviously unable to do ", " commands, so I skipped them, but python crashes (segmentation fault 11) when trying to run colcon build, unfortunately. Is it possible to use turtlebot3 with MacOS at this moment? if so, could you create a tutorial for that as well? ", "Thanks a bunch for all your hard work!", "Okay, so I got a little further along. I’m not sure what exactly fixed it, but I did install ", ", ", " and ", " using brew. Right now I’m having a problem building ", " and ", " because ", " and ", " are throwing erros. Probably due to ", " not being installed. I’ll update if and when I get further along.", "Hi ", " ", "Thank you for inquiry about turtlebot3.", "\nWe have plan to support MacOS and Windows near future.", "And this tutorial don’t require dependency about ", ". We used to ", ".", "\nHow did you install ROS2 in your laptop? I tested ROS2 is installed through source not binary in Linux.", "I installed ROS2 using the official ", ". The ROS2 build is complaining about connext_cmake_module not working, but other than that, the talker/listener example seems to work fine.", "When trying to install the Turtlebot 3 dependencies, it’s not finding the ", " module, which I had fixed before, but is back after installing RTI Connext.", "Full logs after ", " and ", ":", "Sorry, I think your case is not proper to discuss in this thread.", "\nIf you get a ticket in ", ", you are going to get a comment.", "\nOr you can use ", "It’s great to see Turtlebot3 support for ROS2. Out of curiosity, why did you move to using a micro-rtps client for the LIDAR data instead of using roscpp directly? Additionally, it would be nice to see the source code for the new LIDAR node checked in directly instead of bundled in a tar file.", "Hi ", "Of course, using roscpp to publish LIDAR data is more suitable. But we had some problem to publish it in Raspberry Pi 3 (", "). We are going to debug what is problem.", "And code for LIDAR node will be uploaded in github. Thank you for your suggestions ", "Wondering about support for the Waffle instead of the burger?", "\nThat is the instructions for downloading the opencr_update shows in the instructions to", "I was assuming I could also choose waffle, but noticed the update file only appears to have burger. files…", "I am assuming that for the OpenCr, I can probably simply build on my Windows machine using my fork/branch of OpenCR where I need to choose the ROS2 branch?", "Thanks", "Hello ", "We have not provide firmware for Waffle yet.", "\nBut we are ready for new firmware and ros2 packages for TB3 including Waffle.", "\nWe will notice when new version is updated ", "Thanks you for your interest.", "This question might be weird but what is the major difference between catkin_make and colcon make? Thanks in advance. This is just out of curiosity:)", " This is off topic for this thread. Please ask questions on ", " And before you do, please search there for similar questions that someone may have already asked and gotten an answer.", "Hi,", "I’m having trouble following the Bringup tutorial. I don’t seem to have MicroRTPSAgent installed, there doesn’t seem to be any docs on it. The two links (", ") and (", ") are broken. Trying to install it from this tutorial (", ") fails to build both for FastRTPS and Agent. Can you please help me out on this one.", "Thank you", "Hi, ", "Please refer to ", ".", "\nIn this regard, we will make an official announcement.", "Hi ", "MicroRTSAgent lately suffers a renaming to Micro XRCE-DDS Agent. With such renaming links to documentation changed accordingly, in this case, you could find the official Micro XRCE-DDS documentation here: ", "Hi, ", " .", "\nI do not quite understand how ros2arduino comes here, I have TB3 Burger and struggling to follow the new ROS2 bringup emanual. I have a couple of errors with the lidar startup example,namely during ./turtlebot3_lidar:", "\" Error at create entities: participant 132 topic: 132 publisher: 132 darawriter:132 \"", "\nThe lidar then stops spinning.", "\n(Also is that a typo for datawriter?)", "And when I just want to teleop key the wheels do not move, Is it a firmware issue as 1.0.0 has a bug with wheels?", " Thank you, I believe ROBOTIS just recently updated their tutorials to fit the name changes. It is just my luck that I got a TB3 when all of these changes are happening.", "Thank You", ",", "I do not quite understand how ros2arduino comes here,", "The reason I described ros2arduino in the link I mentioned is that I applied ros2arduino with Micro-XRCE-DDS support to the TB3 firmware.", "\nThe existing firmware used MicroRTPS, but Micro-XRCE-DDS has not only changed its name, but also many internal codes. Therefore, we developed the ros2arduino library to support this and applied it to the TB3 firmware. So ros2arduino is very closely related to TB3.", "Anyway, we modified e-manual because Micro-XRCE-DDS and new firmware were released.", "\" Error at create entities: participant 132 topic: 132 publisher: 132 darawriter:132 \"", "Have you run Micro-XRCE-DDS-Agent properly?", "\nThis error occurs because Agent and client cannot communicate and XRCE-DDS entity cannot be created.", "Please follow ", " to make sure that your SBC is properly set up.", "Hi Robotis,", "I am trying to get my turtlebot3 running with ROS2. As I understand from the emanual ", " there is no revised Raspbian image available. Is that correctly understood?", "I have then tried to follow the guide “", "” with the Ubuntu Mate that I installed when I got the Turtlebot3. When I do this I get an error on an too old version of boost when doing the build of the lidar client. I only get boost version 1.58, but the CMakeLists require Boost 1.62.", "What is currently the recommended way to get ROS2 on the turtlebot3 with Raspberry Pi3?", "Thanks Tommy", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-introducing-ros2-tutorials/5959"},
{"title": "Turrtlebot3 and OpenCR Fx0200 error", "thread_contents": ["All -", "\nI am trying to updated OpenCr by following these instructions", "\n", "I keep encountering following error after running these steps.", "Here is the output I am getting.", "Resolving ", " (", ")… 192.30.253.113, 192.30.253.112", "\nConnecting to ", " (", ")|192.30.253.113|:443… connected.", "\nHTTP request sent, awaiting response… 302 Found", "\nLocation: ", " [following]", "\n–2019-01-27 18:11:28--  ", "\nResolving ", " (", ")… 151.101.0.133, 151.101.128.133, 151.101.192.133, …", "\nConnecting to ", " (", ")|151.101.0.133|:443… connected.", "\nHTTP request sent, awaiting response… 200 OK", "\nLength: 400666 (391K) [application/octet-stream]", "\nSaving to: ‘opencr_update.tar.bz2’", "opencr_update.tar.b 100%[===================>] 391.28K  20.4KB/s    in 16s", "2019-01-27 18:11:45 (24.9 KB/s) - ‘opencr_update.tar.bz2’ saved [400666/400666]", "opencr_update/burger_turtlebot3_core.ino.bin", "\nopencr_update/open_manipulator.opencr", "\nopencr_update/waffle_turtlebot3_core.ino.bin", "\nopencr_update/opencr_ld_shell_arm", "\nopencr_update/update.sh", "\nopencr_update/", "\nopencr_update/released_1.2.3.txt", "\nopencr_update/waffle.opencr", "\nopencr_update/opencr_ld_shell_x86", "\nopencr_update/burger.opencr", "\nopencr_update/open_manipulator_turtlebot3_core.ino.bin", "\narmv7l", "\narm", "\nOpenCR Update Start…", "\nopencr_ld_shell ver 1.0.0", "\nopencr_ld_main", "\n[  ] file name   \t: burger.opencr", "\n[  ] file size   \t: 178 KB", "\n[  ] fw_name     \t: burger", "\n[  ] fw_ver      \t: 1.2.3", "\n[OK] Open port   \t: /dev/ttyACM0", "\n[  ]", "\n[NG] cmd_read_board_name fail : 0xF020", "\n[  ] file name   \t: burger.opencr", "\n[  ] file size   \t: 178 KB", "\n[  ] fw_name     \t: burger", "\n[  ] fw_ver      \t: 1.2.3", "\n[OK] Open port   \t: /dev/ttyACM0", "\n[  ]", "\n[NG] cmd_read_board_name fail : 0xF020", "\n[  ] file name   \t: burger.opencr", "\n[  ] file size   \t: 178 KB", "\n[  ] fw_name     \t: burger", "\n[  ] fw_ver      \t: 1.2.3", "\n[OK] Open port   \t: /dev/ttyACM0", "\n[  ]", "\n[NG] cmd_read_board_name fail : 0xF020", "I am now have the same issue on two of my boards. Not updating anything until this is solved.", "I think that connecting OpenCR to PC is something wrong.", "\nIf you have a issue with turtlebot3, please visit our github. ", "\nWe will help you.", "I guess this should be posted at ", "Actually the answer:  (EDIT RTFM page 248 ", " (reset and switch 2 then reset boot, and all is fine", "\nIn there E-manual it can be found here: after Section 7 Recovery mode", "\n", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/turrtlebot3-and-opencr-fx0200-error/7629"},
{"title": "A do-it-yourself Turtlebot", "thread_contents": ["I am teaching a class to Computer Science students (clever software but not hardware types). I thought it would be a good experience to actually build or own turtlebot-like robot, not literally from a kit, but from a pre-acquired set of parts that I knew would go together. It would give them a more visceral experience of building. Our goal is to do mobile navigation with ROS, so we are also using off-the-shelf Robotis Turtlebot3 but they are very small and a “real” Turtlebot2 costs like $2K. Any links or suggestions from those of you who have traveled the same road?", "(Not sure if this question should’ve been on ", ".)", "Hi pitosalas, while not exactly the same specs as Turtlebot, I am working on a ROS + OpenCV Raspberry Pi based robot kit called ROSbots - ", ".", "It is a differential drive robot that has a camera, wheel encoders, and a motor driver, and off course runs ROS and OpenCV pre-installed.", "Would that fit your needs?", "Jack", "Hi Jack", "Yes that’s along the lines but I am looking for something a bit bigger and with a more powerful main computer. Do you have any other leads? Thanks!", "Pito Salas", "\nBrandeis Computer Science", "\nVolen 134", "If you don’t want to build the TurtleBot2 from a kit, the full designs are available to build it from scratch at: ", " Many people have done that. And while you’re at it you can modify the design for your usecase or application.", "Hi Pito,", "I apologize if you had already thought of this but if you can tolerate the network latency and your robot isn’t too sensitive to slightly “late” sensor data (but still accurately timestamped), you can always have a more powerful computer (ie laptop or desktop) run the more computationally heavy ROS nodes as secondary processors - no need to have these processors actually on the robot (which just sucks up more power and requires heavier duty motors). Just another architectural thought to help your students keep cost down while still being able to build their own full fledged ROS robot.", "Happy to continue to hear your thoughts, and “discourse” (harhar!).", "Cheers", "\nJack", "The TB2 “full designs” look quite intimidating. Did you say that the components are available to buy or is the idea that I literally 3d print the parts as specced out there?", "Hi Jack. Yes I was aware of that option but I also am aiming (maybe mistakenly) for building up the experience and skills to allow us to make a robot that will be able to carry a small load (1kg say) and eventually go outdoors. I know that’s a lot. But that’s why I am looking for something with a base the size of an iRobot create or something else… Thoughts?", "Hi Pito,", "You can check out ", " . It’s not exactly a Turtlebot but it offers a “blueprint” for building a variety of DIY ROS compatible robots (2WD, 4WD, Mecanum Drive, and Car-Like steering) . The platforms are computer agnostic so you can choose a much capable board.", "Hope this helps. Cheers!", "You can buy individual parts for the Turtlebot 2 from Dabit Industries for around $800/kit plus the cost of a computer", "For a cheaper cost, you can grab a iRobot Create2 base ($200), iRobot Create2 Mounting Kit ($125), Orbbec Astra ($150), and some computer.", "\n", "**The Kinect and iRobot Create2 are NOT included in this kit   This is a kit meant to screw directly into the iRobot Create2 Boss locations, and provide an adaptable and scalable base for all sorts of fun projects!   Included in this kit: 1 x Middle...", "\n    ", "\n", "As for computers:", "For SBCs, you can take a look at:", "\nRaspberry Pi3: ", "\nASUS Tinker Board: ", "\nODROID-C2: ", "As for laptops, you can check out the following recommended Lenovo laptops:", "\nrefurbished x240 at $419:", "\n", "\n  \n  \n  \n  \n  ", "\n", "\n", "\nLenovo 11e at $369: ", "Hi Pito, you got some great suggestions from the community. Last but not least, while not exactly a kit but definitely a platform you can build on (capable of huge payload) - check out the Magni platform from the awesome folks at Ubiquity Robotics -", "\n", "Jack", "Besides the Ubiquity platform, you can download both their RPi sd card or Virtual Box images. The small Loki platform may become available this Spring if crowd funding is successful.  Also check out the SV-ROS github for how to convert a Neato Botvac to a Turtlebot like platform. I published two articles in Servo Magazine entitled Roll your own Turtlebot. So I think it is easiest to go with an existing platform. Putting together a platform from scratch, with motors, encoders and controllers from scratch just takes too long.", "Some of the autonomous racing folks are building around a rc car platform, but I don’t think that’s good for education. I believe Cousera used the Neato in their course on intro to autonomous robots.", "Disclaimer, I coordinate SV-ROS, and am a member of Ubiquity Robotics", "Good luck. The only way to get better at robotics is to build better robots.", " - do you happen to have pdfs of your two articles? Reading them online in servo is hard ", " Thanks!", "I can send you the botvac article plus youtube videos of  interest.  I have to look for the original Roll Your Own Turtlebot article. (about 3 laptops ago!)   Sending raw odt:", "Roll Your Own Turtlebot Part II", "By Alan N. Federman (Dr. Bot)", "Several years ago I wrote a “Servo” article showing how you could convert an old Roomba vacuum cleaner and a Microsoft Kinect into a robot training platform capable of teaching yourself  ROS, the Robot Operating System from Willow Garage.  Willow Garage has now closed, and Clearpath Robotics can sell you a complete brand new Turtlebot for about $2100. Recently OSRF and Robotis has announced a less expensive Turtlebot, but this is still a bit out of the range for most serious amateurs  What if you could easily build the equivalent of a Turtlebot for under $300?  I am going to show you how easy it is to convert a Neato robotic vacuum cleaner into a fully functional training platform in less than a day.  Very little hardware skill or special tools are needed. Everything is available COTS, and the software is all Open Source.", "What you need to get, if you don’t already have them:", "A laptop or wifi connected desktop running Unbuntu. This should be at least 14.04 and running ROS Indigo, but it would be better to upgrade to the same versions if running cross platform. ROS versions are usually matched to Ubuntu releases.", "\nA Neato Botvac or equivalent (I have seen used XV-12s for under $200, and new basic models for under $300)", "\nA Raspberry Pi 3 (camera is optional but highly recommended) ~$50", "\n16 Gig Sd Card for Pi ~$10", "\nRechargeable 5v power pack (Those for recharging cell phone are fine) ~$20", "\nUSB cables for battery pack to Pi (micro) and Pi to Botvac (can be mini or micro depending)", "\nSmall scraps of aluminum or a tin from can.", "\nSmall scraps of flat plywood or acrylic", "\nVelcro, double sided tape or other easy to remove adhesives", "Step 1 Modifying the Botvac", "Depending on your model, you may chose to ignore any hardware modifications entirely. Then if you mess up, you can just use it to cleanup your house!  I removed the brushes, the dust bin and used a stip of metal to disable the bin detector switch (See Photo 1)", "STEP 2 Preparing the Pi and attaching to Botvac", "Artfully arrange the Pi, battery pack and optional camera on a 6” by 6” flat piece of wood or plastic. Attach with double sided tape. On the bottom of the assembly, attach a piece of Velcro or similar quick release fastener. Attach the matching Velcro to the top of the Botvacs Lidar unit. Lastly plug in the USB cables.  You might want to charge your batteries.  It would be a shame to have all the software loaded and than have to wait to test it.", "STEP 3 Loading the software onto the PI.", "At the time of this writing, an official version of Ubuntu 16.04 was not available fro the Pi 3. I used the Ubuntu Mate (pronounced “ma tay”) version. Instructions for loading Mate are found here:", "Download a copy of Ubuntu MATE", "And follow the instructions for 16.04 – Raspberry PI 2/3.", "You can use an HDMI TV and attached keyboard to initially set up the Pi, using the Graphical Environment.  It also helps to have a direct Ethernet connection when doing the initial set up, because you need to load a lot of software initially. Using the Desktop, it is pretty easy to get WiFi working.", "I suggest creating an 8 gig image on a 16gig SD card. After the initial software is on and you can bring up a graphical desktop, follow the intro screen and click on Raspberry PI info – it will enable you to expand the image to 16gig. It also will allow you to configure your WiFi.  I suggest you still use the Ethernet Connection, but you can at this point open a terminal, type sudo graphical disable, and then use ssh over WiFi to complete the installation.", "Once Ubuntu is working, continue loading ROS onto the PI,", "(", "\nYou may have to maintain your Ubuntu distributions; the following commands are useful:", "sudo apt-get update", "\nsudo apt-get upgrade  (must run both in sequence)", "and sometimes to clear dpkg errors:", "sudo dpkg –configure -a", ")", "Summary:", "sudo sh -c ‘echo “deb ", " $(lsb_release -sc) main” > /etc/apt/sources.list.d/ros-latest.list’", "sudo apt-key adv --keyserver hkp://ha.pool.sks-keyservers.net:80 --recv-key 0xB01FA116", "sudo apt-get update", "\nsudo apt-get install ros-kinetic-desktop-full", "(if -full is not available, just get ros-kinetic-desktop)", "sudo rosdep init", "\nrosdep update", "\necho “source /opt/ros/kinetic/setup.bash” >> ~/.bashrc", "\nsource ~/.bashrc", "\nsudo apt-get install python-rosinstall", "ROS Catkin Workspace installation", "mkdir -p ~/catkin_ws/src", "\ncd ~/catkin_ws/src", "\ncatkin_init_workspace", "\ncd …", "\ncatkin_make", "And then edit .bashrc to change the source /opt/ros/kinetic/setup.bash to ~/catkin_ws/devel/setup.bash", "\nalso it helps to add the following line if the Pi is hosting the robot:", "export ROS_MASTER_URI=http://$HOSTNAME.local:11311", "Where “$HOSTNAME” is the name you have in the /etc/hostname file", "Your /etc/hosts file should look like this:", "127.0.0.1\tlocalhost", "\n127.0.1.1\t“your hostname”", "::1     ip6-localhost ip6-loopback", "\nfe00::0 ip6-localnet", "\nff00::0 ip6-mcastprefix", "\nff02::1 ip6-allnodes", "\nff02::2 ip6-allrouters", "This will support ROS networking.", "You also may wish to install “chrony” to synchronize the time different ‘nodes’ are running at, this is because the Pi doesn’t have a real time clock, and if your Wifi is not connected to the Internet, the Pi will have the wrong time.", "Next I suggest you load the following ROS packages into your catkin_ws/src workspace:", "ROS by Example part one (RBX1) from Patrick Goebel", "     This should go on both your laptop and the PI", "and", "the SV-ROS Botvac nodes courtesy of mostly Mr.  Ralph Gnauck", "Repository of packages and info for the SV-ROS Intro To ROS training series - SV-ROS/intro_to_ros", "follow the instructions in the README files to install and test.", "Example", "cd ~/catkin_ws/src", "git clone ", "  (this also should go on both)", "cd …", "catkin_make", "TESTING", "On the laptop:", "roscd teleop", "If nothing is found,", "sudo apt-get install ros-kinetic-teleop-twist-keyboard", "On the Botvac, turn on the pi, and sign on via a terminal window from the laptop.", "I like to launch a custom base only node on the Pi", "roslaunch bv80bot_node bv80bot_njoy.launch (code included at the end of this article)", "Then you should hear the Neato Lidar unit start to spin.", "On the Laptop open up another terminal window and", "set up the ROS_IP  and ROS_MASTER_URI environment variables via the ‘export’ command.", "Test to see if you are getting topics:", "rostopic list", "and scans", "rostopic echo /scan", "Finally launch teleop", "rosrun teleop_twist_keyboard teleop_twist_keyboard.py", "You should be able to drive your robot.", "If you open RVIZ in another window, you should see the LIDAR returns.", "What Next?", "With just this simple robot, you can begin to learn how to accomplish advanced robotics tasks and begin to learn the subtleties of autonomous navigation. Because of the Neato’s XV-11 LIDAR unit, you can simultaneously accomplish localization and obstacle avoidance. Support for webcams and the Raspberry Pi Camera are available through ROS nodes. I have gotten teleop via a blue tooth joystick to work through the laptop, but not directly on the Rpi.  Please note that though the Rpi has 4 USB slots, there is seldom enough power to run more than the Botvac interface and a WiFi dongle. A typical USB webcam will draw too much current and crash the Rpi.", "With a WiFi connected phone and some ingenuity, you would be able to issue voice commands. So you can call up your home robot from the office and ask it to find the cat. The Botvac is a little underpowered for bringing you a snack from the kitchen, but when the next more powerful platform is available, you’ll know just how to program it.", "Figures and Code", "LISTING 1  /catkin_ws/src/intro_to_ros/bv80bot/bv80bot_node/launch/include/bv80bot_njoy.launch", "LISTING 2  Terminal output from launching startup nodes:", "roslaunch bv80bot_node bv80bot_njoy.launch &", "rostopic list", "/button", "\n/cmd_vel", "\n/cmd_vel_mux/active", "\n/cmd_vel_mux/parameter_descriptions", "\n/cmd_vel_mux/parameter_updates", "\n/joint_states", "\n/mobile_base_nodelet_manager/bond", "\n/odom", "\n/raw_cmd_vel", "\n/robot_cmd_vel", "\n/rosout", "\n/rosout_agg", "\n/scan", "\n/sensor", "\n/smoothed_cmd_vel", "\n/teleop_velocity_smoother/parameter_descriptions", "\n/teleop_velocity_smoother/parameter_updates", "\n/tf", "\n/tf_static", "Figures:", "   Fig 1  XV-12 dustbin removed", "  Fig 2  XV-12 Name Plate", "    Fig 3  XV-12  Brush Removed", "   Fig 4 RPi 3 mounted", "Youtubes of Turtlebot I from create base and voice control ~2013-2014? :", "Other Youtubes of interest:", "   Botvac 2015", "  Magni 2016", "  Loki 2015", "Very interesting and thank for your information. I am interested in building a robot that can carry a larger weight (>100kg). But I am lost when Raspberry Pi control the motor because, in comparison with Turtlebot, this robot will have a more powerfull motor. In your article it does not appear any other MCU, so my question is how is the motor controled?", "\nThank you.", "The Botvac has its own microprocessor, motor drivers, etc. The Pi connects via a USB cable. There is no interface required. This was not the case on the original Turtlebot 1 which required a USB to serial TTL converter.", "I am going to make your project and i am a beginner in ROS can you provide more details to build this project", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/a-do-it-yourself-turtlebot/3978"},
{"title": "Where to buy Turtlebot 3 at Singapore", "thread_contents": ["Hi, I’m Thong, a programmer from Vietnam. I’m working at Singapore as a Software Engineer. I’m interested in Autonomous driving car, so I want to find a place in Singapore to buy buy a Turtle bot 3. I found this ", " but the price is very high compared to this one ", ".", "Are there any place in Singapore which I can find the cheaper one? Thank you very much.", "It looks like there are distributors in Malaysia.", "\nNot sure whether they are shipping aboard though or not.", "\n", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/where-to-buy-turtlebot-3-at-singapore/7871"},
{"title": "[TB3] How to leverage the Intel ROS Project", "thread_contents": ["I brought up the Intel ROS Project and don’t know how to test it, port it to the TB3, or leverage it.", "\n", "I installed the Intel ROS Project because the diagram on it home page (see link above) suggested I should be able to use it to do interesting things. It also assures that the Movidius and RealSense APIs work well together. It was difficult to install because of the number of packages and instructions were written using different documentation, installation and test conventions. But I managed to complete that install after a couple false starts.", "In the following paragraphs I document installation and test status to provide confidence that the install is promising. I am currently stuck. I don’t know what the next steps are.", "I executed the following in separate terminal windows. They executed without crashing and I could display an interesting rqt_graph.", "rviz displays “No Image” in its Image window. Clearly I have a publisher/subscriber message mismatch. My /camera/realsense2_camera node is publishing /camera/realseanse2_camera_manager/bond. I see nothing in the rqt_graph subscribed to this message.", "/moving_object subscribes to the /object_analytics/tracking message from /object_analytics and it also subscribes to /tf_static from /camera. This demonstrates that a lot is working. rqt_graph image below.", "QUESTIONS", "The rqt_graph indicates that I have a fundamental disconnect about how to integrate the capabilities I have installed. Where do I go from here? Is there an example implementation and description that I can use to integrate all this into a proof of concept?", "I think rviz is supposed to display the output of the RealSense camera. How do I make that happen?", "I don’t have a well defined project. I’m having fun learning something new.", "My current setup supports Kobuki. I have a tb3. What messaging capabilities must I port to tb3 to start that process? Does this question even make sense?", "Support appears to be migrating to ROS2 more quickly than I expected. I am hoping to get a basic understanding of the ROS Intel Projecting using ROS1 before moving to ROS2. The transition will probably take me several months so I am getting this project to work in ROS1 will provide the reenforcement I need while I work on that transition. I want to see the power of the ROS Intel Project to motivate me. Is that reasonable?", "Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ", " provides a forum which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Movidius and RealSense ROS demos work.", "I had to install the Kobuki message package before I could complete the ROS Moving Object install: ros-kinetic-kobuki-msgs.", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n"], "url": "https://discourse.ros.org/t/tb3-how-to-leverage-the-intel-ros-project/8655"},
{"title": "Turtlebot Installation error", "thread_contents": ["installed Ubuntu 14.04 on Virtual box machine.", "\nthen installed ROS INDIGO.", "\nafter that I tried to install turtlebot from the ROS Wiki.", "\nbut it gives an error in installation.", "dpkg: error processing package ros-indigo-turtlebot-simulator (–configure):", "\ndependency problems - leaving unconfigured", "\nErrors were encountered while processing:", "\nros-indigo-librealsense", "\nros-indigo-realsense-camera", "\nros-indigo-turtlebot-bringup", "\nros-indigo-turtlebot-teleop", "\nros-indigo-turtlebot", "\nros-indigo-turtlebot-actions", "\nros-indigo-turtlebot-calibration", "\nros-indigo-turtlebot-follower", "\nros-indigo-turtlebot-navigation", "\nros-indigo-turtlebot-rapps", "\nros-indigo-turtlebot-apps", "\nros-indigo-turtlebot-gazebo", "\nros-indigo-turtlebot-interactive-markers", "\nros-indigo-turtlebot-rviz-launchers", "\nros-indigo-turtlebot-interactions", "\nros-indigo-turtlebot-stage", "\nros-indigo-turtlebot-stdr", "\nros-indigo-turtlebot-simulator", "\nE: Sub-process /usr/bin/dpkg returned an error code (1)", "pls help me to sort out this problem.", "\nthank you", "\nRegards", "Samnan", "Did you find a solution to this? I am seeing the exact same error while trying to install turtlebot on an Ubuntu 14.04 machine with ros indigo on it.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/turtlebot-installation-error/4912"},
{"title": "[TB3] ROS 2 Dashing Release", "thread_contents": ["Hi ", "We are happy to announce TurtleBot3 ROS 2 Dashing Release.", "This updates includes", "When you visit our ", ", you can find step by step from installation to launch tele-operation, cartographer and navigation2  ", "If you have any issue or questions, please feel free to get new ticket on github issue page.", "ROS packages for Turtlebot3. Contribute to ROBOTIS-GIT/turtlebot3 development by creating an account on GitHub.", "We specially thanks to OpenRobotics Memeber,  every ", " developer and ROS community,", "\n", " at ", " , ", ", ", ", ", ",  ", " at ", ", ", " at ", " and My colleague ", " and ", " at ", ".", "Great stuff, thank you very much!", "Great, many thanks. ", "\nI will have to try working with Jetson Nano.", "Here’s video’s about Cartographer and Navigation2 ", "[ROS 2 Dashing Diademata Cartographer]", "[ROS 2 Dashing Diademata Navigation2]", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["OpenCR(Embedded Board) communicate with ", " by ", "\n(For more detailed, please refer to attached picture below)", "\n", " package was ported to ROS 2 Dashing", "Added some services (/sound, /motor_power, /reset)", "Added some parameters", "Applied message filter to calculate ", " topic"], "url": "https://discourse.ros.org/t/tb3-ros-2-dashing-release/10364"},
{"title": "Sensors supported in ROS2", "thread_contents": ["Do you have a list or recommendation on sensors supported by ROS2 (dashing)? I can see a list of sensors supported by ROS - > ", ". Is this list supported by ROS2 ?", "I want to buy a 3d Lidar and/or a 3d camera for 3D slam. I have a turtlebot3 waffle_pi. If anyone has had success with ROS2 and a 3d sensor, I would be very happy to hear about it.", "I’ve had success using the Intel RealSense D435 RGB-D camera with ROS2 systems. Intel provides a ROS2 driver for it at ", ".", "A couple of months ago I ported the velodyne driver to ROS 2: ", " .  It isn’t released into Dashing yet, but you can build it from source and it works pretty well.", "There is another effort going on to make a more realtime version of the Velodyne driver: ", "I think the documents and GitHub page below will help you.", "I am using Orbbec Astra under ROS2 with this driver: ", ".", "Thanks for your answer! Do you need the intel board to interface with these cams? I current have the rpi.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Intel Robot DevKit\n", "\n"], "url": "https://discourse.ros.org/t/sensors-supported-in-ros2/10580"},
{"title": "[TB3] TurtleBot3 Autorace 2019", "thread_contents": ["Hello,", "I will introduce about Turtlebot3 autorace from 2017 to 2019.", "\nI think many Turtlebot users will be interested in autonomous driving competition.", "Turtlebot 3 Autorace was held only in Korea in 2017 and 2018, and in 2019, In order to the representatives of each country or local competition will be held and Finally, In January 2020, we will host an international competition through the STEAM CUP Challenge.", "Participants were already gone through preliminaries by excellent ideas, and pursuing with TurtleBot3, which is an easy-to-customize platform, they are now rock-n-rolling in this competition by fulfilling their vision processing wise, machine learning and artificial intelligence wise, mechanical wise imaginations.", "2017 R-BIZ Challenge Turtlebot3 Autorace", "\n", "2018 R-BIZ Challenge Turtlebot3 Autorace", "\n", "2020 STEAM CUP Turtlebot3 Autorace", "\n", "It doesn’t matter who you are. If you are interested in Turtlebot3 Autorace, please let me know your inquiry.", "Do the judges get temporary access to the repositories or is the code made available open source after the competition? It would be most interesting to see all the teams build upon the “best” design of last year, or at least get insight in what made the winning team perform so well.", "I’m not directly interested in competing (at this time) but I am interested in having a look at the repositories and seeing the developments.", "Kije this is amazing.", "Let me introduce myself, I am the new Developer Advocate at Open Robotics. Please let me know if there is anything we can assist you with. I am going to go and post this on the Open Robotics twitter feed.", "Please do keep us posted with updates.", "Hello Martin!", "You can refer to the participants’ sources code at the link below.", "\nWe have been preparing to share the source code and improve our next competition since the end of the competition.", "Each repository is managed by the participating teams, so some teams have good documentation and others have no clear information. So, since from this year, the format of hardware configuration and execution method will be decided so that others can easily follow.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-autorace-2019/10566"},
{"title": "Building a better TurtleBot3", "thread_contents": ["Hi everyone-", "I’ve written a ", " about TurtleBot3 assembly and component placement. If you’re just building your TurtleBot3 take a look and let me know what are some of your own suggestions related to component placement.", "Thanks in advance", "Hi Dragan,", "I’ve been setting up a TB3 burger this week with ROS2. I was wondering if you would want to chat for a minute about how the experience has been for you.", "Hi ", ",", "can you jump on IRC on freenode? A bunch of us from Canonical are in ", "Hi ", "\nThis is a very impressive article. We seem to be able to use ROS more easily in a variety of ways with a little more thought. ", " Thank you very much and I will consider how to make it easier for users.", "Glad more people are using tmux/screen for their bringup sequences ", " definitely helps.", "Hi ", "-", "thank you and feel free to ping me anytime you want to bounce ideas around.", "Thanks", "Hi ", "-", "yes it most definitely helps and the tmuxinator scripting is a great addition. There a couple of tmux extensions that also help with session save and restore, so if you modified a session you don’t lose that when you come back… Definitely a great tool.", "For interested parties search for tmux-resurrect or tmux-continuum plugins on github", "A few things that I found missing is about upgrading the default computer which is raspberry pi to a more powerful one such as Intel NUC or NVIDIA Jetson TX. In order to do processing from depth and tracking cameras.", "I have myself tried to interface NUC directly via USB to OpenCR. But, it only works after I re-upload the Arduino firmware from the master branch of OpenCR.", "But, it behaves slightly different than the latest binary release for raspberry pi. Also, each NUC and OpenCR requires its own power in order to move the dynamixel motors. As the NUC doesn’t seem to supply enough power via the USB.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/building-a-better-turtlebot3/10533"},
{"title": "[TB3] Reinforcement Learning with TB3!", "thread_contents": ["Hello everyone! ", "We introduce a teaser video about the Machine Learning with TurtleBot3.", "We’ve started deploying Machine Learning onto TurtleBot3 to make progress in navigation using Deep Q Network (DQN).", "We’ll keep posting how-to videos and source code later on.", "Thanks!", " It’s cool and interesting. I’d like to check with you:", "Thanks for your sharing !", "Hi ", " ", "Thanks for your interesting!", "Good work! Liked the moving obstacles scenario, specially.", ", if I’m not mistaken, the simulation has been (at least partially) inspired by ", " environments. Is that right ", "?", "A very cool project would be to extend this and try a few policy gradient methods. You could even go ahead an compare it with the value iteration one you just tried (DQN). I did a while ago ", " comparing different methods for a simple environment but yours is indeed much cooler.", "Hello, ", " ", "Actually, It was helpful to me to refer ", " environments.", "\nBut, I used just gazebo for the simulation.", "I absolutely agree with your advice and will find better policy.", "\nThanks for your interesting!", "I just released ", " which allows you to over 100 robots at the same time. At the moment Proximal Policy Optimization is used as it seems to provide the best results.", "The backend is a ROS service so you should be able to adopt your robots pretty easily. I’d be also glad to provide you with some support.", "Hi ", " ", " It’s cool work!", "I’m studying on using reincorcement learning for turtlebot3. And I tried various reinfocement algorithm with gym-gazebo.  Next step try on real turtlebot3 not simulation. Have you tried it on a real Turtlebot3?", "Hello ", ", glad to hear you’ve been using gym-gazebo. We are about to release a few additional algorithms so in case you’re interested, I’d suggest to stay tuned for them!", "Hi everyone", "\nI am currently training turtle bot 3 using DQN from ", ". I will later do real- world simulation. My current simulation on gazebo shows a lot of collision for the turtlebot. Is there anywhere I could reduce the collisions? Or do I have to use a different optimizer?", "Hi bro.", "\nHave you tried this in a real environment?", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["What does your current solution base on ? pure vision or Lidar invovled ?", "I’m really curious about whether you have a try in the actual nature environment after tuning the model well within the simulation ?", "Where to find your details or will you open it the others ?", "I used the lidar and odometry data without vision.", "Yes, I will try in real environment after solving some problem.", "This is our site : ", "\nWe will keep posting more detail video and source code later on."], "url": "https://discourse.ros.org/t/tb3-reinforcement-learning-with-tb3/4842"},
{"title": "[TB3] TurtleBot3 Championship in Thailand", "thread_contents": ["Hi all,", "INEX in Thailand successfully hosted TurtleBot3 Championship.", "About 60 competitors in 12 teams participated in this championship and high ranked team will get a chance to compete at ", " in Seoul, Korea.", "For more pictures and videos please visit at ", ".", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-championship-in-thailand/11407"},
{"title": "[ISO] TurtleBot Kinetic ISO - Beta Testers needed!", "thread_contents": ["After significant work refactoring our build systems for maintainability, we are pleased to announce that ", " is now available for beta testing on x86_64.", "The Intel RealSense driver ", " with 16.04.5 or later", "The ROS repository is pre-configured in ", " and most commonly used ROS packages should be pre-installed.", "The ROS environment  is pre-configured", "\n", " runs ", "ISO defaults to KHA1 Loadout in ", "Manufacturers will be able to have custom ISOs to install a loadout matching the  equipped hardware. ", " rules for these devices are preconfigured.", "Updates to 18.04 are currently disabled pending work on Melodic.", "Please submit pull  requests against ", "Did we miss installing your favorite package?", "Is this a priority for anyone?", "How much effort should we spend adding things like the rqt tools to the launcher?", "\nShould we prioritize Melodic / ROS2 support?", "Prior to ", " we built a fairly robust ", " for upstart.", "\nSystem bootup automation still needs to be  refactored for launching", "ISO adds the user to  group  dialout", "\nCan we stop setting ", " permissions for devices?", " we talked NetworkManager into helping to configure ROS networking. This needs to be updated and tested with Xenial. The current thinking is  to move  this into a pure python package, but depending  on interest this work could be delayed to Melodic.", "Please file ISO  bug reports ", "After a Kinetic release we hope to quickly produce a Melodic release followed by some sort of ROS2 release", "The TurtleBot Kinetic ISO has been sponsored in part by ", "It now ships with automatic startup and network auto-configuration", "\n", "Systemd Robot Initialization. Contribute to LucidOne/robot_systemd development by creating an account on GitHub.", "\n", "\n", "ROS Network Autoconfiguration. Contribute to LucidOne/network_autoconfig development by creating an account on GitHub.", "\n", "Uploaded!", "This release includes a basic GUI for ", "\n", "ROS Robot Status Indicator. Contribute to LucidOne/robot_indicator development by creating an account on GitHub.", "\n", "Updated ", " to support GUI for launching new systemd roslaunch units", "\nHoping for a release this week before starting on Melodic support.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Kobuki Mobile Base", "Hexagonal Plate Stack", "Orbec Astra 3D Camera", "Laptop Battery /sys/class/power_supply/BAT1", "We are planning to use an indicator like the volume control in the top right", "\nGUI to enable and disable startup", "\n", " + ", " launched by default", "\nEnables RViz to display pointclouds after first boot without opening a terminal", "ROS Startup", "\nAs ", " user?", "\nAs user ", "?", "\nWhat happens If the initial user is not named ", "?"], "url": "https://discourse.ros.org/t/iso-turtlebot-kinetic-iso-beta-testers-needed/11095"},
{"title": "[TB3] Turtlebot3 upgrade", "thread_contents": ["hey all,", "I would like to share some upgrades of turtlebot3 burger designed by us:", "OLED and buttons menu;", "\nBumper sensor;", "\ncamera pi with servo-motor;", "\narm clamp claw with servo-motor;", "Documentação das atualizações realizadas pelo time do laboratório de informática do Insper  para robô TurtleBot3.  - Insper/turtlebot3", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-upgrade/11634"},
{"title": "[TB3] Assembling the TurtleBot3", "thread_contents": ["The TurtleBot3 will be available as a non-assembled product. The two videos below are videos of TurtleBot3 Basic and Premium version. You can see the SBCs and sensors used in each version of TurtleBot3. Though it is a hassle to assemble, I think it is reasonable that the user is a reconfigurable product. What do you think?", "Now we have 3 months left to launch. We will do our best to launch cool robots with ", " and ", ".", "\n", "\n", "Thanks for sharing this awesome video. Where did you buy all the parts? My friend and I are thinking about putting together one TurtleBot3 premium.", "Hi ", ",", "\nFor information on the ROS’s official platform TurtleBot series, you can find the resources on the official website below. ", "\n", "Hello, I’m a newbie in field of mobile robot. Can you share me the shopping link, where you bought these components online? I’m currently living in Germany. I don not know whether there is kind of website or offline community?", "\nThere’s a reseller in Germany. You’ll be able to purchase TurtleBot3 from below link.", "\n", "Further information regarding the platform can be found from below eManual.", "\n", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-assembling-the-turtlebot3/1208"},
{"title": "[TB3] Printing / Buying Waffle Plates", "thread_contents": ["I am looking to build some prototypes and would like to get 20-50 Waffle plates as an initial order.", "Looking at the material cost it’s about $1-10/unit for ABS ($1 for generic, $10 for ABSplus). I’m looking for a local ABS printer, but should be able to find some PLA options easily.", "Shapeways is offering them for about $30 each in what I assume is ABS, or $20 in PLA.", "A few questions:", "Thanks", "I’ve found a printer who can do them in ABS for $6/each. I’ve sent that off for production and I’ll let you know the results. I think an injection moulded option would be much preferred tho, so I’m still keen to hear on that.", "Hi ", "Waffle plates are main components of TurtleBot3. We already uploaded it on ", ". So, Anyone can get design files and 3D print it.", "We have tested the file of waffle plates using general 3D printer(NOT exclusive) with common PLA. The results are fairly respectable. Furthermore, it doesn’t need to additional support material. We already designed it.", "Above capture shows uploaded waffle plate. The support is marked in orange color. When it printed, the supports should be attached on 3D printer’s desk.", "Unfortunately, we don’t have any plan to support injection moulded waffle plates. But we assure that the uploaded files are works fine.", "Thanks", "I’ve printed out a couple Waffle Plates here @ home, one in PLA and the other in nGen.", "\nIME, the Waffle Plate is a bit of a torture test for 3D printing. The STL from ROBOTIS loads oriented on one of the narrow ends and, suprisingly, should probably be printed that ways with Support=“everywhere” and a sizable Brim.", "I tried multiple times to print it flat, but the print always failed, tearing from the bed after the first few layers. I tried different speeds, densities, different loop and overlay widths, none of that worked. If somebody out there has gotten the waffle plate to print flat, I’d love to know what your settings are.", "That said, printing it on the long or short end works with support enabled. You’ll have to pick it at the end, but the bits come out pretty easily with a file or pointed tweezers.", "Print times for me have ranged from 7-10 hours depending on resolution, infill and various other settings. I’m using a Raise3D N2+ with the V2 hot-end. For nGen I’m printing at 240C with 100C bed temp. For PLA I’m printing at 220C with 70C bed temp.", "I like the nGen one better and will probably print the rest of them using that. If you have a printer at home, I’m thinking it will take probably about a week to print out a Burger set or maybe a long weekend if you obsessed over it and just chained yourself to the printer.", "Hope that helps some of you with your buy vs. print decision.", "Pic below.", "\n", "routiful,", "\nThanks for pointing out the support bits. I’d cleared off the obvious support bits on my waffle plates a while back but the orange area you highlighted came out pretty solid for me and not at all like a support structure so I thought it was part of the actual model ", "\nI cleared those off and it all fits together much better now ", "Since this is too big for my 3d printer I gave it to 3D Hubs to print a couple. Result works for me.", "Does anybody know where I could find the big side-caster holder shown here:", "\n", "I’ve printed out most of the parts at this point, but can’t seem to find this in the OnShape catalog that ROBOTIS have put online.", "\nThanks!", "Use the ", " on onshape and go to parts. It has the caster holder. But the inner parts look like they need to be split from the wheel.", "Hi,", "I tried to download the CAD file from onshape. But it is only viewable to me, not downloadable. How should I get the file? Thank you!", "Some here. Does anyone now how to download? Do I need to register? ", " any tips?", "\nYou can download the stl file from thingiverse as well.", "\nExtract the file and you’ll be able to find the waffle plate stl file.", "\n", "3D-printable parts:\nSEGWAY_ASM - PCB Support\nSEGWAY_ASM - WAFFLE PLATE\nSEGWAY_ASM - Wheel\nNon-3D-printable parts:\nSEGWAY_ASM - HEX Support M3X35mm\nSEGWAY_ASM - HEX Support M3X45mm\nSEGWAY_ASM - HV Converter\nSEGWAY_ASM -...", "\n", "This was eventually also my solution. I wondered if I am just not able to figure this onshape thing out…", "\nIt seems like exporting file requires log in.", "\nAfter log in to Onshape then right click on one of the tabs at the bottom and select ", " to download the model.", "\n", "Onshape is a cloud-based, 3D CAD document system.\nOnshape can export models in STL format for use on Sketchfab.\nSelect your Part/Assembly and choose Export from the context menu. Or, choose Expor...", "\n", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Is there a source for injection moulded waffle plates?", "Can anyone comment on strength and durability of PLA waffle plates, or on durability of generic ABS vs ABSplus?", "Can the waffle plate be printed without support material? The overhang looks to me like it would be challenging, but maybe an angle can be introduced to address that."], "url": "https://discourse.ros.org/t/tb3-printing-buying-waffle-plates/1890"},
{"title": "LIDAR of Turtleblot3 starts spinning once power on?", "thread_contents": ["Just wondering is it normal that the LIDAR starts spinning when I switch on TB3???", "In my understanding, the LIDAR should start spinning after we roslaunch turtlebot3_bringup turtlebot3_robot.launch…", "Anyone face the same condition?", "Hi,", "Since October, 2017, the LIDAR which comes with the TurtleBot3 gets the firmware that makes automatically run from booting on. It is not a malfunction.", "Look here:", "and hopefully (as Tully always says):", "The TurtleBot category here on ROS Discourse is the right forum for general discussions.", "For questions with direct answers or debugging please use ", " with the tag turtlebot or turtlebot3 with waffle or burger depending on your model.", "There are guidelines for asking questions at ", "Thanks", "Leon", "Thanks Leon for your reply and the reminder of ", " ^^", "hello, I am also having the same problem. have you solved this problem? if you solved please help me to get out of this…", "\nUnfortunately, spinning the LDS with power up is an inherited feature of the sensor firmware itself since 2017.", "ok.", "\nDoes turtlebot3 needs host computer?", "\ncan you help me to do without host computer if possible…", "Generally if you are going to need a machine to ssh into the turtlebot and kick-off a launch file. I would suggest that if you have general turtlebot questions you ask Robotis directly or use ", ".", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["#include <hls_lfcd_lds_driver/lfcd_laser.h>", "#include <std_msgs/UInt16.h>", "\n", "namespace hls_lfcd_lds", "{", "LFCDLaser::LFCDLaser(const std::string& port, uint32_t baud_rate, boost::asio::io_service& io)", ": port_(port), baud_rate_(baud_rate), shutting_down_(false), serial_(io, port_)", "{", "serial_.set_option(boost::asio::serial_port_base::baud_rate(baud_rate_));", "\n", "// Below command is not required after firmware upgrade (2017.10)", "boost::asio::write(serial_, boost::asio::buffer(\"b\", 1));  // start motor", "}", "\n", "LFCDLaser::~LFCDLaser()", "{", "boost::asio::write(serial_, boost::asio::buffer(\"e\", 1));  // stop motor", "}", "\n", "void LFCDLaser::poll(sensor_msgs::LaserScan::Ptr scan)", "{"], "url": "https://discourse.ros.org/t/lidar-of-turtleblot3-starts-spinning-once-power-on/3332"},
{"title": "About the TurtleBot category", "thread_contents": ["This is a forum for TurtleBot users to communicate.", "If you are looking for help solving a problem or getting something working please continue to ask questions on ", " There is a large knowledge base there of ", " on the site.", "This is a forum for discussions of interest to large portions of the TurtleBot users community.", "Please use this for:", "This category is replacing our ", " Content from this forum will be cc’d there for archival purposes, but posting there will not longer be supported.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Community discussions", "Announcements"], "url": "https://discourse.ros.org/t/about-the-turtlebot-category/242"}
{"title": "[TB3] Curious IMU values?", "thread_contents": ["Hello,", "I am working on turtlebot Buger and Waffle, but I get curious values from IMU.", "\nLinear acceleration on z axis in not equal to ~9.8 m/s². And when the robot is static, I have non zeros values on x and y axis.", "\nI have those strange values on both Burger and Waffle robots. Curiously IMU on Waffle was working fine last week.", "Some idea ?", "Matt", "It seems that  linear acceleration units are mm/s². So ~400 and ~500 would represent noise", "\nI have compared opencr IMU and Myahrs IMU, results are below.", "So, I suppose that x and y linear acceleration are fine except on z axis. It is a calibration problem ?", "It seems that  linear acceleration units are mm/s².", "Not quite… There was a bit more to it than that. The original OpenCR code doesn’t convert from the raw values. That was fixed in ", ".", "That fix and others are present on the ", " branch on the OpenCR repo. If you checkout those changes and flash the image, then your IMU values will be correct.", "Ok, thank you for those explanation and also for your contribution", "Matt", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-curious-imu-values/3631"},
{"title": "[TB3] Inconsistent localization in gmapping", "thread_contents": ["Hello,", "I am trying to map the turtlebot3.world as explain in wiki. Thus i run this world with gazebo", "\n", "then fake TB3", "\n", "and finally launch default SLAM file with its associated .rviz", "\nroslaunch turtlebot3_slam turtlebot3_slam.launch", "\nrosrun rviz rviz -d ", "/rviz/turtlebot3_slam.rviz", "But I am facing a curious behavior: the robot’s localization is constantly jumping between its right location in Gazebo and another location. This second location correspond to the second array of columns, it looks like the particle filter is hesitating between because of the similarity of the map and the lack of differentiating features.", "You can see the result ", "I have tried to play with gmapping parameters without success, regarding those posts:", "\n", "\n", "However, the default turtlebot3_slam settings are working pretty well with robot in real life.", "Has anyone ever tried to map the default world that come with the TB3 package ?  Or had an idea about parameters to tune in turtlebot3_slam.launch file ?", "Regards", "Matt", "Finally found what was wrong.", "Fake node and turtlebot3_world robot’s node were conflicting.", "I don’t run anymore turtlebot3_fake and it’s now working", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-inconsistent-localization-in-gmapping/3650"},
{"title": "[TB3] TurtleBot3 with Laser Distance Sensor (LDS)", "thread_contents": ["Hi everyone ", "\nTurtleBot3 release come just next month.", "\nAre you curious about the LDS on the TurtleBot3?", "LDS can be rotated 360 degrees.", "\nIt is a key part in create slam and navigation.  even create 3D map!!!", "\nAnd less than half the price of a lidar sold on the market. But the functions are almost the same.", "You can see it soon. ", "\nThank you ", "This is the cheapest 360 degrees LiDAR in the world I know. ", "\nFor more information; Please see the detailed spec on TurtleBot3 wiki.", "\n", "The design reminds me of the RP-LIDAR (", ").", "Can you comment on expected uptime? E.g., if I begin to operate the sensor and do not stop, how long before the device may need to be rebooted?", "I am motivated to ask because I noticed recently that after approximately 3 days of continuous operation of an RP-LIDAR that I have, the motor stopped and would not return to operation until after I cycled power. I plan to conduct a more thorough study of product lifetime and durability of the RP-LIDAR.", ", do you have any information on the cost?", "I think it is hard to expect long operation life in low-cost LiDAR.", "\nI will ask the engineer about the expected time for the operation time. ", "After the launch of TurtleBot 3, the products for each accessory are going to start selling in June.", "\nThe price is still undecided, but we think it is under $150. ", " did you get any data about expected lifetime under continuous operation?", "The following attachments include the contents like basic performance, measurement performance, mechanism layout, optical path, data information, pin description, command. But, I can’t find information about the lifetime from the manufacturer.", "14.56 KB", "Ask you engineers what is the mean time between failures (MTBF) data they should have and hopefully share.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-with-laser-distance-sensor-lds/1644"},
{"title": "TurtleBot3 projects in KAIST", "thread_contents": ["Hi guys ", "I introduce a interesting video.", "\nThis video shows several fall semester projects using TurtleBot3 in ", "(South Korea).", "\nIt contains Cannon-shooting Bot, Face-recognizing PetBot,  Alarm-detecting PoliceBot, Hand-detecting Manipulator, Door-keeping Bot and Emotion-Drawing Bot.", "Let’s make your own Bot with TurtleBot3 ", "Haha thank you for sharing, awesome work! ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/turtlebot3-projects-in-kaist/3794"},
{"title": "[TB3] How to use LDS-01 of TurtleBot3", "thread_contents": ["Hello, everyone! ", "We explained how we use LDS-01 through this video.", "Until now, it has been used as one sensor of TurtleBot3.", "\nHowever, you can use LDS in a variety of ways as shown in this video.", "[How to use LDS-01]", "\nNo 0. Specification", "\nNo 1. ROS", "\nNo 2. Windows, Linux, macOS", "\nNo 3. Embedded Board", "\nNo 4. SLAM and Navigation", "\nNo 5. Self-Parking", "\nNo 6. 3D Sensing", "\nNo 7. for Makers", "Enjoy ROS and TurtleBot ", " [Video] ", "\n", " [Documents] ", "\n", " [Source Code] ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-how-to-use-lds-01-of-turtlebot3/3862"},
{"title": "VirtualBox and Turtlebot 3. During RVIZ, unable to contact my own server at 10.0.2.15", "thread_contents": ["I am using VirtualBox to run LINUX and ROS. The Turtlebot IP address is 192.168.3.68 but my virtualbox ip address is 10.0.2.15(this may be due to wired connection to my main OS, Windows)", "I would like to use WiFi connection for communication between turtlebot and remote pc. Any idea how to resolve this issue? I’m just this close to achieving SLAM and navigation.", "Thank you!", "Your VM is not connected to WiFi network which is needed. Try to change VM network settings to Bridged Network.", "I saw this problem multiple times. I am pretty sure that, as commented before, your VM is stablishing a private network with your windows. To check that:", "In windows, go to the search box and type “cmd”. There type “ipconfig”. You will get the external IP of your PC, in your case, 192.168.x.x", "\nIn linux, in a terminal, the command “ifconfig” will return a different IP. If it is the same, the error is somewhere else…", "To fix it, close your VM and go to its configuration in VirtualBox. If I remember well, it was right click on the name of the VM and configuration (I have no a VM here, sorry). In network there should be a drop-down liste. I think that by default is set to NAT (Network Address Translation). Change it to Bridget networking", "Anyways, just change it there and open the VM again. Check if now the IPs are the same for your windows and your VM.", "I have tried changing to bridged connection, then my WiFi(in VM) stops working altogether.", "\nThis is extremely, extremely, extremelyyyyy annoying. ", "Ok, let me see. I installed VM Virtual Box 5.2.6 and downloaded a ros indigo64bits VM from here: ", ". 2.8Gb…men…To make it work it was also required the VM VirtualBox Extension Pack 5.2.6", "Anyways, if I type in the “cmd” of Windows “ipconfig” I get the following information:", "\nEthernet-Adapter IPv4: 192.168.99.111  (numbers are a fake since I do not want to share my public IP)", "I open the VM image, import the configuration as it comes and start it. If I type “ifconfig” I get an ethernet port with the direction 10.0.2.15.", "I close the machine, right click on it. Settings > Network > Adapter1 > Attached to (change from NAT to bridget connection). I left the name of the adapter as it was, maybe you have to change it to use the WLAN adapter.", "\nOppening the VM again it shows me the following ip: 192.168.99.185", "\nI can make “ping 192.168.99.226” without problem. This is an other machine where I have ROS installed.", "\nI set up the environemnt for both…", "The configuration works…", "By the way…shouldn’t this thing be posted in ROS answers?", "By the way…shouldn’t this thing be posted in ROS answers?", "It was: ", ".", ": could you please close either this thread or the ROS Answers post?", "Sorry, I made this post then I realized it was on the wrong platform, hence I went to answers.ros after.", "I will most certainly be trying the methods.", "Thank you guys so much.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/virtualbox-and-turtlebot-3-during-rviz-unable-to-contact-my-own-server-at-10-0-2-15/3859"},
{"title": "Turtlebot2 can not find a path", "thread_contents": ["Hello,", "\nI am new to ROS and trying to learn it. I have been experimenting with a turtle bot. I was able to to make a rough map of it on Rviz.  The  “2D Nav Goal” option works works if it is around the same area.", "\nThe problem I faced is that it couldnt find a path from one room to another.", "If my bot is in  location point A… “2D Nav Goal” set to Point C, The bot gets confused and just keeps rotating, thinking it is stuck.", "\nThe displacement between the 2 points are short but the bot cant analyze and take the possible path.", "What is your take on it?", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/turtlebot2-can-not-find-a-path/3893"},
{"title": "Waffle - HDMI no signal", "thread_contents": ["Hello,", "I need help installing Ubuntu on TurtleBot3 Waffle.", "\nI flashed Joule BIOS with version 193 (since 1J2 didn’t worked and seemed a lot of people had trouble with it).", "\nLooked good :", "However after that I can’t get any screen with micro HDMI-HDMI cable, still no signal.", "\nI plugged power supply one openCR, keyboard, mouse and USB with Ubuntu on USB hub (which is connected to the Joule). All leds are green, plus the white/blue one.", "Any suggestion ?", "\nThanks", "Hello r00t,", "\nThe below link is the method that worked for us to recover the joule.", "\nIt seems like the sequence of connecting and disconnecting cables do matter.", "\n", "Thank you for your reply.", "Tried everything, still can’t get it working.", "\nFirst connecting type C USB, first connecting power supply, waiting 10min first boot before connecting HDMI, really everything. With both bios version 193 and 1J2. Even re-done exactly like in the video tutorial. Did it with two different Joule board (we got three of them), same thing.", "Flashing is always fine, but can’t get that output working.", "Anyone with an other idea ? (Hardware is fine, test moves worked)", "According to McCool, sometimes specific monitors would not connect to the Joule.", "\n", "\nWere you able to connect them with your current monitor before updating firmware?", "Yep, it was working before updating…", "I’m trying to reproduce the problem with my Joule and if I figure out what the problem is, I’ll share the solution for it.", "Well, I took my chance installing directly the “Alternative Ubuntu for Joule” on a second Joule not flashed (since this way I did have acces to BIOS to boot on USB), and it works properly… (ROS install and turtlebot teleop working with no problem)", "\nSeems weird 'cause there must be a reason the guide tells us to flash before doing it, but i am not complaining, it works.", "I’ll keep trying make the first one work, and come back to you if I find a solution.", "Thanks ", "Hello r00t,", "As far as I understand, BIOS 193 is required in order to install Ubuntu with a USB flash drive. Since it was one of requirements from Ubuntu Developer(", "), I didn’t doubt about updating the BIOS firmware.", "\nAt least you figured out your solution with the second Joule which is definitely a good news ", "\nPlease let me know if your second Joule has different BIOS version other than 193(", ") so I can also try with the same version.", "\nCheers!", "I was able to use joule-firmware-2017-06-26-1J2-public, specifically the debug bin file.  My initial flash with the release file would not boot, nor display anything on screen.  With the debug bin the board does run, although bootup times are very slow.", "That said, the Joule board has proven to be unstable.  I’m unsure on the root cause, be it BIOS, Ubuntu, or hardware, but since Intel has discontinued the board I don’t expect much in the way of software improvements.  At present, I’ve swapped over to a Raspberry Pi, and have an Odroid XU4 which will eventually end up in the Turtlebot.  I’ll go back to the Joule at some point, but it’s not a long term solution for development.", "Hello,", "\nI got the same problem. The board was displaying the bios using hdmi but when I flashed bios version 193 I could not get hdmi output anymore. The flashing process didn’t give any errors. I also tried newer bios versions with same negative results.", "\nI can connect to the board using serial connection. It seems to recognize the display when I execute xrandr -q. If I reboot the board it displays the whole boot sequence. These are the last commands before stopping:", "[   12.378641] Bluetooth: RFCOMM ver 1.11", "\n[   12.820056] HDMI HDA Codec ehdaudio0D1: HDMI: failed to get afg sub nodes", "\n[   12.827761] HDMI HDA Codec ehdaudio0D1: Failed in parse and map nid with err: -22", "\n[   12.836166] HDMI HDA Codec: probe of ehdaudio0D1 failed with error -22", "It seems to be some sort of hdmi error. Any idea how to correct the issue?", "\nThanks", "Just a data point.", "\nMy Joule running 193 works with my Dell and Samsung monitors, with a generic type A to type A HDMI cable, and generic type A to type D adapter.", "\nIt won’t work with my Elecrow monitor, its included type A to C cable, and the above generic type A to type D adapter", "\nIt will work with my Elecrow monitor, its included type A to C cable, and a Rocketfish type A to D adapter.", "Ed", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Downloading BIOS", "Clearing NvStorage…"], "url": "https://discourse.ros.org/t/waffle-hdmi-no-signal/2687"},
{"title": "Buying a second hand Turtlebot or affordable mobile platform", "thread_contents": ["Does anybody know where I could buy a second hand Turtlebot?", "I am hoping to buy a Turtlebot 3 waffle but without the RealSense camera (I already have access to one). This will help to save costs.", "\nAlternatively, a TurtleBot 2 is also fine.", "I looked into other alternatives like the iRobot Create 2 but they do not ship outside of the USA.", "Hi RoboLady.", "For the Turtlebot 3, you may be able to purchase individual parts (look at the bottom of the page):", "\n", "For the Turtlebot 2, you can purchase individual parts from the Dabit Industries website:", "\n", "Dabit Industries", "\n", "Thank you! This is very helpful", "You can buy a used TurtleBot 2 from eBay.", "Hi,", "Newly, the TurtleBot3 Waffle Pi, which is a low-cost-version of the TurtleBot3 Waffle, is being ready to be afforded in the market place", "Don’t hesitate to look at!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/buying-a-second-hand-turtlebot-or-affordable-mobile-platform/3801"},
{"title": "[TB3] TurtleBot3 Waffle Pi - Raspberry Pi Camera applications", "thread_contents": ["Hi,", "it was very long time since I uploaded my last video of autonomous driving.", "\nBTW, new TurtleBot3 series - the TurtleBot3 Waffle Pi comes out with Raspberry Pi Model 3B and the Raspberry Pi Camera v2. They are very well-matched, having great performance on dealing with Images, Recognition works, and will give you more achievable solution by low-price.", "Here is the Video", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-waffle-pi-raspberry-pi-camera-applications/3951"},
{"title": "[TB3] TurtleBot3 Basic operation demo", "thread_contents": ["Hi, everyone ", "We developed the basic operation packages for TB3 tutorial.", "\nThis demo video has 4 basic operation.", "We hope this packages help your study with TB3.", "\nYou can download our source from the link below.", "ROS packages for Turtlebot3. Contribute to ROBOTIS-GIT/turtlebot3 development by creating an account on GitHub.", "music:", "\nAerial Ace by Muciojad ", " Creative Commons — Attribution-ShareAlike 3.0 Unported— CC BY-SA 3.0 ", "… Music promoted by Audio Library ", "Thank you. ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Move to using interactive marker.", "Move and stop using LDS(Laser Distance Sensor).", "Move to goal position.", "Move to custom route."], "url": "https://discourse.ros.org/t/tb3-turtlebot3-basic-operation-demo/3840"},
{"title": "[TB3] TurtleBot3 Automatic parking demo", "thread_contents": ["Hi, everyone ", "This Demo video is turtlebot3 parks automatically.", "\nwe use the intensity and distance of LDS(Laser Distance Sensor) and a reflective tape in this demo.", "\nYou don’t need to more sensor, you just need a reflective tape.", "Do you have a better idea? Challenge it with turtlebot3. ", "Applications for TurtleBot3. Contribute to ROBOTIS-GIT/turtlebot3_applications development by creating an account on GitHub.", "Morning Sun by Nicolai Heidlas Music ", " Creative Commons — Attribution 3.0 Unported— CC BY 3.0 ", "… Music promoted by Audio Library ", "thank you.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-automatic-parking-demo/3720"},
{"title": "TurtleBot3 software and firmware update and 'waffle_pi'", "thread_contents": ["Hello everyone ", "I announce that TurtleBot3 is huge updated!!!", "\nThis update considered many issues and requests from users. We are sincerely thankful to them.", "\nMore interest makes more progress. If you have any issues or suggestions, please feel free to get ", "Existing users need to download new version in master branch of turtlebot3 and turtlebot3_msgs", "Direct download in repository ", ", ", "or using command line", " sudo rm -rf turtlebot3/", "\n$ git clone ", " sudo rm -rf turtlebot3_msgs/", "\n$ git clone ", "Open Arduino -> Toos -> Board: -> Board Manager… -> Update (v 1.0.15)", "Best regards!", "\nDarby", "I assume the Waffle Pi is a lower-cost waffle with a Raspberry Pi instead of the Joule. This is great news!", "Is there any progress on a Burger or Waffle version that comes with no sensors or compute boards, for those of us who have all that stuff already?", "Hi ", " thanks alot for the update.", "\ni have a question… Do we need to update the OpenCr board? and How? i get “Checksum does not match” error . thanks alot… ", "Hello ", "You can follow below instruction", "or you can find more detail in ", "Thanks", "\nDarby", "I am interested in using the new software update on my TB3 and thank you for these instructions. Are there also updates planned or available to the documentation to describe the ROS commands necessary to show the new Publisher /diagnostic, /battery_state information and to connect a speaker to the RasPi3 or OpenCR to hear the generated sounds? Ross", "Hello ", " ", "We have a plan to be compatible with ROS2 though we don’t have any details.", "\nWe provide a ", " and it will be added more information soon for these software updates.", "\nAdditionally, you don’t need to connect separate speaker due to OpenCR already has it ", "Thanks", "\nDarby", "Darby, Following your good instructions and compiling the revised catkin_ws/src, I easily updated the ROS SBC TB3 and OpenCR software and very pleased that it all works well, including “rostopic echo /diagnostics” node that is very informative. I look forward to the new wiki to learn how to connect the new /sound Subscription that roswtf reports as unconnected. I note there is a reference to a Adafruit display driver in the TB3 github-Is that a future additional feature? A small request is make available the pdf version of the previous wiki.Thank you and your colleagues for their hard work and producing an excellent, fun and educational robot :).", "I’m still getting a checksum mismatch. I upgraded to OpenCR 1.0.15 and also tried 1.0.16. I upgraded with turtlebot3.git and on turtlebot3_msg.git on both my RemotePC and TurtleBot.", "This is the execution", "\n<", "\n$ roslaunch turtlebot3_bringup turtlebot3_core.launch", "\n… logging to /home/eepp/.ros/log/5a7d18a4-0545-11e8-9b6b-080027c0cb1e/roslaun", "\nch-orras-3438.log", "\nChecking log directory for disk usage. This may take awhile.", "\nPress Ctrl-C to interrupt", "\nDone checking log file disk usage. Usage is <1GB.", "started roslaunch server ", "PARAMETERS", "NODES", "ROS_MASTER_URI=http://10.0.0.159:11311", "process[turtlebot3_core-1]: started with pid [3447]", "\n[INFO] [1517266129.977476]: ROS Serial Python Node", "\n[INFO] [1517266130.051262]: Connecting to /dev/ttyACM0 at 115200 baud", "\n[ERROR] [1517266132.304481]: Creation of publisher failed: Checksum does not ma", "\ntch: 427f77f85da38bc1aa3f65ffb673c94c,d537ed7b8d95065b6c83830430b93911", "\n[INFO] [1517266132.362502]: Note: publish buffer size is 1024 bytes", "\n…", "\n/>", "Nice! we are preparing updated wiki including your requests.", "\nThanks you for your interest ", "Hello ", " ", "Have you set network config??", "\nYou can check how to config network btw RemotePC and TB3 on ", "Best regards", "\nDarby", "ROS guys ", "Thank you for your interest on TB3 ! (I am happy as if i get a sweet coffee)", "\nBut ", " is not proper page to create issue ", "If you have any question for TB3, please use Github ", " or ", ".", "\nYou can meet me in there ", "Thanks", "\nDarby", "Darby,", "Thanks for your quick response. This is how I set it up", "Remote PC", "$ ifconfig", "\nenp0s3    Link encap:Ethernet  HWaddr 08:00:27:c0:cb:1e", "\ninet addr:10.0.0.159  Bcast:10.0.0.255  Mask:255.255.255.0", "$ tail .bashrc", "\nexport ROS_MASTER_URI=http://10.0.0.159:11311", "\nexport ROS_HOSTNAME=10.0.0.159", "\nexport PATH=$PATH:$HOME/tools/arduino-1.8.5", "turtlebot3", "$ ifconfig", "\nwlp1s0    Link encap:Ethernet  HWaddr a0:c5:89:4b:3a:e3", "\ninet addr:10.0.0.158  Bcast:10.0.0.255  Mask:255.255.255.0", "$ tail .bashrc", "\nexport ROS_MASTER_URI=http://10.0.0.159:11311", "\nexport ROS_HOSTNAME=10.0.0.158", "\nexport TURTLEBOT3_MODEL=waffle", "Ed", "I followed the instructions in 7.1.5  for Porting OpenCR1.0 to Arduino IDE. I want to reason through my issue. I’m not familiar with Arduino checksum generation. I connected my OpenCR to my Remote PC. I ran the Arduino IDE from there and loaded the bootloader. So I assume I can load the OpenCR from any machine as long as I have the right bootloader version. Where and how are the checksums being generated and compared? Will I have the same bootloader checksum as everyone else in the world? If that is correct, someone should be able to tell me if I have the correct one and tell me which side is incorrect. If not correct, does the checksum depend on my hardware and/or software.", "ed", "Hi Darby", "Just wanted to confirm when you pointed to this article for updating, you meant: ", "Is it possible to update the board- manager as defined in the wiki using dfu-util?", "Or you meant some other steps such as: ", "Can you please confirm?", "Thanks", "\nSandip", "Hi ", " ", "You don’t need to enter dfu mode.", "\nIf you have used OpenCR, you just update it using ", ".", "Please follow below link, it will help you", "Thanks", "\nDarby", "Thanks Darby for the reply,", "\nI updated the Board Manager on Arduino IDE to 1.0.15 (also tried 1.0.16) --> the tried updating the Bootloader using Arduino IDE (but failed) with the following error message:", "I made sure the", "lsusb", "is showing the STMicroelectronics (NOTE: There is no DFU mode written as you mention in the emanual - but this entry in lsusb starts showing up only after DFU mode triggered on using Boot + Reset button)", "Can you let me know some tips to go ahead with debugging?", "Thanks", "\nSandip", "Hi ", ",", "This is a space for discussion, so the question is not appropriate.", "\nI will continue on the issue page of the link below.", "\n", "ROS packages for Turtlebot3. Contribute to ROBOTIS-GIT/turtlebot3 development by creating an account on GitHub.", "\n", "Thanks!", "Exactly same Checksum error here - before I start digging…was it solved? any ideas? Tnx Michael", "BIG SORRY - my fault…didn´t read the error messages after uploading correctly…no issue anymore!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["turtlebot3_controller - include RC100(for remote control) library", "turtlebot3_diagnosis - include diagnostic functions", "turtlebot3_motor_driver - include DYNAMIXEL SDK", "turtlebot3_sensor - include functions for IMU, battery, magnetic filed and analog Input", "/version_info - Contains the hardware, firmware and software information", "/battery_state - Contains battery voltage and status", "/magnetic_field - Contains magnetic field information", "/diagnostic - Contains self diagnostic information", "/sound - Output beep sound", "/motor_power - Dynamixel torque on/off", "/reset - Reset odometry and re-calibration IMU", "add Sound.msg", "Simple command makes USB setup", "It shows state of IMU, motor, lidar, battery, button and version information", "Add Waffle PI", "Now, we are preparing new version of TurtleBot3 called ", ".  Meet Waffle PI in ", " before you get an it.", "Software (v 1.0.0)", "Firmware", "I did a roscore on my RemotePC", "a ssh into the TurtleBot", "did a “roslaunch turtlebot3_bringup turtlebot3_core.launch” on the TurtleBot", "/rosdistro: kinetic", "/rosversion: 1.12.12", "/turtlebot3_core/baud: 115200", "/turtlebot3_core/port: /dev/ttyACM0"], "url": "https://discourse.ros.org/t/turtlebot3-software-and-firmware-update-and-waffle-pi/3729"},
{"title": "Presentation and some doubts", "thread_contents": ["Hello everybody!", "my name is Antonino Vara. I’m a teacher in a Secondary School in Spain and we want to build a robot. For this, we have thought to use a turtlebot platform. Firstly, we thought to use TB3 but now, due to discontinuing of Joule, we are thinking about using TB2.", "Our local authorities are going to get the material we need but, before that, we are doing some texts. We have installed everything and we can control the turtlebot in Gazebo. We have built the map file in a YAML file but now we don’t know how to add this to Gazebo.", "I hope some of you can help us. I know we are going to need a lot of help in the near future.", "Thank you very much.", "Best regards,", "Antonino", "Hello Antonio!", "Sounds like you are trying to do navigation?", "\nWe have a (free) minimal setup simulator tutorial here:", "\n", "\n(You should read the earlier pages on how to setup the sim)", "Take a look at it, and tear it apart to see how it works.", "We also have more general tutorials here:", "\n", "Best wishes, and good luck!", "\nIlia B.", "Hello ", " ", "Thank you for your interest about TB3!", "\nAs you said that the sale of TB3 Waffle has ended last year.", "However, today we introduce new TB3 called ", " ", "\nThe big difference between Waffle and Waffle Pi is that the main SBC(Single Board Computer) and Camera are substituted with ", ".", "\n(More detailed about it, please following ", ")", "TB3 series provide simple bringup. So secondary school students easily setup and operate it by following ", ".", "\nTB3 supports simple examples including ", " and advanced examples ", "We also already update Waffle Pi in ", ". You can operate it how it works even on your map (Ref : ", ")", "If you have any information about TB3, please visit our ", " or ", "Or Have any question about development with TB3, take a ticket in  ", ".", "Best regards", "\nDarby", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/presentation-and-some-doubts/4003"},
{"title": "[TB3] Waffle Pi Launching Event!", "thread_contents": ["Hello everyone, ", "I have a good news. As of FEB 19, TB3 WafflePi has been launched!", "To celebrate this, ROBOTIS is giving out 500 X ROS Programming Handbook(written by TB3 developers, printed edition) to be included in the Waffle Pi package as first-come-first-served basis.", "The following links provide TB3 H/W specification, TB3 tutorial, and various other packages.", "The biggest difference with TB3 Waffle is that TB3 WafflePi used raspberry pi3 as SBC for the convenience of users. And TB3 Wafflepi has Raspberry Pi Camera Module. The video below shows what you can do with the camera.", "For more detailed purchase info,", "\nplease talk to official distributors near your region.", "\n", "Thanks. ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-waffle-pi-launching-event/4005"},
{"title": "Turtlebot3 - Joule stalled", "thread_contents": ["Hi", "Turtlebot 3 - Waffle … Joule - after installing Joule following the official documentation (Ubuntu 16.04 LTS) : everything works fine…problem: Joule stops working/running after approx 10min up - independently if operated on 12V/3A external power supply or with the battery provided with the Turtlebo3 kit. Logs don’t show any weird symptoms…", "Any ideas? pls help…", "Tnx in advance", "\nml", "First thing to check, what is the temperature doing? Is the module overheating?", "Also, does anyone know what the replacement for the Joule is, now that they are EOL?", "\nThanks ", "Tnx Ilia for the hint…checking continously temp via /sys/class/thermal zones 0-7 - max. 45C … assuming that isn´t the root cause. Keep on digging…Best ml", "…quick update: if you push the Power button (SW2) the “stalled” system recovers - even the Unix sessions…", "\n…did I miss something here - kind of “sleep mode” /   hibernation mode - some BIOS settings?", "Interesting.  Our bot was doing the same thing, with symptoms just like a software crash, so that’s what I assumed.  Maybe it is going into a sleep mode of some sort.", "I experience the same stalling that you describe.  Have you managed to figure out a workaround?", "Hey ashoed,", "unfortunately not - tried all 3 BIOS versions, including the recommended ", " … same negative results.", "Any luck on your side?", "Best ml", "Hi Michael,", "Have you checked to see if there are settings within Ubuntu 16.04 for screensaver or power savings?", "You should also check if you can update to the latest Linux kernel.", "If you can type  ", " in the terminal on your Intel Joule and post the output, I may be able to load up my Intel Joule with your versions and check to see if I encounter the same issue.", "Please keep us updated on any other efforts you may try.", "Hi MyNameIsCosmo,", "tnx for your support…some progress but not 100% done yet:", "all updates based on “apt-get update” installed", "HDMI not working - need to work with cli", "uname -a:", "\nLinux turtle 4.4.0-1000-joule #0+joule21-Ubuntu SMP PREEMPT Thu Mar 16 14:46:45 UTC 2017 x86_64 x86_64 x86_64 GNU/Linux", "following your hint “power saving” -> focussing on Ubuntu not Joule I did the following:", "sudo systemctl mask sleep.target suspend.target hibernate.target hybrid-sleep.target", "-> unix processes will not get stopped/suspended anymore -> seems ok !", "\n-> issue: every 30min the network manager gets a request to “sleep” (syslog) -> wifi connection goes down", "\n-> can’t restart it automatically (service network-manager restart -  nmcli network on - ifup -a)", "No clue what causes the request for network manager to sleep…given that it is reproducible it seems a “feature”. Any idea how to tackle it? Seems I didn’t disable all “power saving” options (or what soever causes the nm shutdown…) - can’t find anything on the net that fixed it…", "Every hint/comment welcome…", "SOLVED: guess the “GUI” environment triggered the request to sleep after 30min - given that I run the Joule headless: disabling “Gnome” and “lightdm” did the trick - system up and running for hours (didn’t reverse the masking of sleep, suspend, hibernate, hybrid…)", "\nThank to all of you for the hints - Best Michael", "Had the same issue, disabling gnome and lightdm did the trick! Thanks for sharing!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n"], "url": "https://discourse.ros.org/t/turtlebot3-joule-stalled/2739"},
{"title": "Welcome to the TurtleBot Category on Discourse.ros.org", "thread_contents": ["Hi TurtleBot Users, Contributors, Maintainers etc,", "As many of you are likely aware we’re working to consolidate ROS communications onto this instance of Discourse. We’re slowly migrating each SIG and it’s TurtleBot’s turn to migrate.", "We’ve created this new category: ", " and it will be the new forum for TurtleBot discussions. A description of the category is ", ".", "The old mailing list ", " will no longer accept postings, but will receive copies of posts made to this category.", "If you have not already please sign up with an account on ", " and join the discussions here.", "Cheers,", "\nTully", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/welcome-to-the-turtlebot-category-on-discourse-ros-org/244"},
{"title": "Kobuki base external power supplies: can be set OFF by default?", "thread_contents": ["When you switch on the robot, the external power supplies already provide current, until you publish OFF state on mobile_base/commands/external_power topic.", "Can be somehow disabled by default on robot switch on and then enabled by publishing ON on mobile_base/commands/external_power topic?", "Thanks!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/kobuki-base-external-power-supplies-can-be-set-off-by-default/271"},
{"title": "TurtleBot 2e", "thread_contents": ["As many of you may have seen we’ve been working hard on improving support of ROS on smaller embedded computers during the recent release ", " the product of this I’m happy to announce the TurtleBot 2e, an embedded version of the TurtleBot 2.", "Documentation of the TurtleBot2e can be found on github at: ", " and you can get it in pdf format ", "The TurtleBot 2e is a new revision of the TurtleBot primarily defined by replacing the netbook with a single board computer(SBC)", "\nsuch as the 96 Boards CE computer, the DB410c.", "The other big change is that we’ve added support for the ", " depth sensor.", "\nThis is important because both the sensors, the Microsoft Kinect and the Asus Xtion, we previously used as standard sensors are now no longer in production. This upgrade is available to all TurtleBot users. There are some ", " If you have trouble with the Astra take a look there. As well as visiting Orbbec’s forums ", "We’ve validated the basic demos such as gmapping, following, and joystick teleoperation are functional on the DB410c.", "\nHowever there may be tuning needed for different SBCs.", "Please try things out! And any contributions for improvements to the documentation code etc are always welcome.", "\nSo jump in and try it out if you already have a TurtleBot 2 and an SBC.", "\nThe more people who are involved the better this will become.", "Dabit Industries has the TurtleBot 2e for presale.", "\"TurtleBot 2 is an open robotics platform designed for education and research on state of art robotics. It is also a powerful  tool to teach and learn ROS (Robo", "also the accessories pack: ", "email: ", " if you have any questions or need help with anything.", "We just ordered the pieces to build the heat sinks, expect to get them done in 2-3 weeks for the robot to ship.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/turtlebot-2e/307"},
{"title": "Intel Realsense?", "thread_contents": ["Hi All,", "Related a bit to the Astra thread… has anyone tried the Intel Realsense?", "\nIt appears there is no OpenNI for Realsense, but is that important?", "\nAny disadvantages you foresee?", "Thank you,", "\ndougbot01", "I did see this from Clearpath.", "\n", "Hi All,", "We do have a couple of pending PR’s to add the Realsense R200 as an available camera in the default turtlebot stack: ", " and ", " we hope to get landed soon.", "Until then there’s a minorly forked version and documentation for using Realsense w/ Turtlebot at ", "There are new versions in Indigo and Kinetic of the realsense drivers:", "\n", "And the TurtleBot PRs have been merged too.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/intel-realsense/378"},
{"title": "Announcing TurtleBot3", "thread_contents": ["I’m happy to announce the TurtleBot3 is coming.", "We officially announced it at ROSCon in collaboration with ", ". The talk will be posted online with the rest of the ROSCon talks once the videos have been rendered properly.", "In the mean time Evan Ackerman was at ROSCon and wrote about the TurtleBot3 in IEEE Spectrum ", "It’s going to be much smaller, less expensive, able to do SLAM,", "and support many different configurations.", "Here’s a photo of prototypes of several configurations shown in the rendering above:", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/announcing-turtlebot3/623"},
{"title": "[TB3] The Turtlebot3 Example #01 Parallel Translation with 4 Joints and 4 Wheels", "thread_contents": ["Hi guys,", "We started making the Turtlebot3 examples that we announced in the ROSCon2016 ", ".", "This is the Turtlebot3 example ", " which can move based on parallel translation with 4 joints and 4 wheels", "TurtleBot3 example ", " road test @ ROBOTIS Office (using Dynamixel XM-430 for Turtlebot3 Premium)", "Leon", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-the-turtlebot3-example-01-parallel-translation-with-4-joints-and-4-wheels/838"},
{"title": "What is the speed controll system of Turtlebot2(kobuki base) like?", "thread_contents": ["I’m using Turtlebot 2(kobuki base) & kobuki_core and  trying to control the velocity (& angular velocity) of turtlebot 2.", "I would like to know kobuki’s speed controll system.", "Please tell me what the speed control system of Turtlebot2 is like?", "(I already know that “Twist.msg” controls the speed of turtlebot", "\nand “ControllerInfo.msg” may be related with PID gain.", "\nI would like to know what the system between these parameters and turtlebot2(kobuki)'s “real” speed is like.", "\nI read slightly codes of kobuki_core (", "),but I could’t understand them well…)", "hello ", ",", "\nthe best place to post questions as the one you have, is ", "\nwe use these forums mostly for discussions and developments.", "\nthanks.", "Hello ", ",", "\nIt is kind of you to tell me appropriate forum.", "\nI think I’ll do so.", "\nThank you.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/what-is-the-speed-controll-system-of-turtlebot2-kobuki-base-like/870"},
{"title": "[TB3] SLAM with the TurtleBot3", "thread_contents": ["Hello, ", "Have you seen IEEE Spectrum’s video Friday last? A video with Turtlebot3 was introduced. We will share the development news of Turtlebot3 every week. ", "Your weekly selection of awesome robot videos", "Today, I would like to introduce the video related to SLAM which is the basic function of TurtleBot3.", "\nEven if it is small size, low cost, we will do our best to SLAM and Navigation which is the basic function of Turtlebot brand.", "Date: 2016.11.29", "\nRobot: TurtleBot3 basic model", "\nSensor: Laser Distance Sensor", "\nROS package for SLAM: Gmapping / Cartographer", "\nPlace: ROBOTIS Labs & HQ, 15th-floor corridor", "\nDuration: 55 minutes", "\nTotal travel distance: 351 meters", "\n", "Best regards,", "\nPyo", "Could you share the associated bag for this video? I think the Cartographer results could be easily improved and we’d be happy to host a TB3 configuration with a demo bag.", "You mentioned that you are using a “Laser Distance Sensor”, can you share which one you are using specifically?", "It would be interesting to know how well mapping performs with a lower FOV sensor, like an Astra or Realsense.", "Also is this running in real-time, if so which SBC are you using?", "Hi Damon Kohler,", "We are still lacking, but I think we can do better if we get your help.", "\nWe share our bag data. ", "Thanks ", "We are using a variety of LDS. Typically, these sensors are RPLidar A1 and A2, SICK, Hokuyo.", "\nAlso, we have recently found a LDS that is cheaper, but satisfactory in performance. It is in testing.", "\nIt will be released soon.", "We will support various SBCs for TurtleBot3.", "\nAmong them, we will use Raspberry Pi for the basic version of TurtleBot3 and Intel Joule for the premium version of TurtleBot3.", "The bag doesn’t seem to contain odometry. I assume you had that available for gmapping, though? Cartographer would also benefit from it.", "\nThank you for your comments, I think that you can get the odometry information from /tf of above bag data.", "\nActually, we are currently using Gmapping as our main SLAM package. But we will soon change to the Cartographer package. You will need your help. ", "Thanks, Pyo. Glad to hear it!", "Odometry is usually provided via nav_msgs/Odometry messages. The /odom frame in /tf is then a product of some node that processes the odometry messages.", "Thank you.", "We are awaiting the Kinetic version of the cartographer. It is very difficult to install the current indigo version on ROS Kinetic. It is not easy due to the problem of ceres-solver and errors during installation. So we were using the modified package of the link below for ROS kinetic. We are hoping to be able to install the Google Cartographer as binary from ROS kinetic soon.", "\n", "cartographer - Cartographer is a system that provides real-time simultaneous localization and mapping (SLAM) in 2D and 3D across multiple platforms and sensor configurations.", "\n", "\n", "cartographer_ros - Provides ROS integration for Cartographer.More details in Chinese http://www.cnblogs.com/hitcm/", "\n", "We’ll work on some documentation for installing from source on Kinetic. But, having a binary release is blocked on having an updated Ceres package for Kinetic. I believe ", " is working on that.", "Can you add a nav_msgs/Odometry publisher?", "I saw your thread. ", "\nI also believe ", " is working on that. ", "And, I will add an odometry publisher you mentioned into the next update as soon as possible.", "Thanks,", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-slam-with-the-turtlebot3/927"},
{"title": "New depth sensor, Orbbec Astra, call for testing", "thread_contents": ["As many of you are aware the Microsoft Kinect, and Asus Xtion are now out of production and are getting harder to obtain. As such we need to find a new depth sensor to use for the TurtleBot.", "Thanks to the work of several of the TurtleBot distributors as well as support from Orbbec I’m happy to announce that we have initial versions of ROS drivers for the ", " available as debian packages.", "If you have an astra please take some time to try out the new packages. They are definitely still under development but should be a drop in replacement for the openni_camera.", "There are packages currently in ros-shadow-fixed for both indigo and kinetic. The package name is ", ", and there’s an ", " package as well.", "To get things working you may need to install ", "I made the latest release from my fork, but I’ve submitted it back upstream to orbbec at: ", " If you have issues please file tickets there.", "If you’d like to try out the TurtleBot with an Astra there’s an ", " of the turtlebot repository which has added ", " as a possible ", "Does anyone have a short rosbag from the Astra, just to get an impression of the quality?", "Sorry for the slightly off-topic comment. We might buy an Astra though, which would give you one more beta tester!", "Does anyone have a short rosbag from the Astra, just to get an impression of the quality?", "+1, would love to get feedback from actual users.", "We’re also purchasing one so hopefully we can contribute as well. Thanks for the driver ", "!", "hey,", "\nThanks for the driver ", " !", "I gave it a try but there is a lot of noise on the depth measurement,", "\ncompared to the openni2_camera driver.", "\ncomparison videos:", "what is the best way of sharing the bag files with you?", "cheers", "here are the bag files taken with the openni2_camera and astra_camera drivers… enjoy.", "Dropbox is a free service that lets you bring your photos, docs, and videos anywhere and share them easily. Never email yourself a file again!", "Dropbox is a free service that lets you bring your photos, docs, and videos anywhere and share them easily. Never email yourself a file again!", "note: we are using the model ASTRA S", "cheers", "I see three versions, the “Astra”, “Astra S” and the “Astra Pro”. They are even all the same price.", "Can you be specific about which version you are targetting or will work best with the TurtleBot?", "We are looking at the Astra for the TurtleBot. It’s spec is closest to the current default sensor - the Asus Xtion Pro Live.", "Right now the Astra Pro’s high-res image stream is not available through OpenNI and hence not available for ROS with the current wrapper.", "The Astra S could be used as well. Personally, I don’t see the few centimetres you get extra at close range worth for what you lose in range.", "+1 Same problem as Procopio here. Heavy noise is around the borders.", "Also rviz crashes when trying to view any image stream.", "I tried the ROS driver with the Astra S (the short range model) and it was unusably noisy. The best way I can describe the point cloud is “blizzard in a glass pyramid”. As a sanity check, I tried using the standard SDK on my mac, and it was fine (although the data was definitely not nearly as good as a short range carmine). Has anyone had success with the Astra S and the ROS driver?", "I wasn’t able to test their SDK on linux because the link to download that from their developer page goes to a 404 for a Dropbox file. Sketchy…", "I believe you can get their modified OpenNI2 version from Github: ", "Thanks ", ", I’ll try that out.", "I made an issue for the weird noise ad the edges of objects:", "\n", "\n", "For anyone interested, here are the openni drivers provided by orbbec:", "Dropbox is a free service that lets you bring your photos, docs, and videos anywhere and share them easily. Never email yourself a file again!", "There’s apparently an unreleased filter applied to the prebuilt binaries:", "\n", "Hallo guys,    I am a geek from china, i'd like to use Astra as a primary sensor on my AGV to do some gmapping stuff.   Now There is very tricky problem for me at the moment, hope u guys can help me :slightly_smiling:   firstly, i have tried OpenNI2...", "\n    ", "\n", "I’ve opened a ticket at:", "In case you haven’t seen we’ve successfully run the TurtleBot demo applications using the Astra on the TurtleBot.", "Thanks for the Astra driver Tully. We have made some tests and despite the noise, it works well with the Turtlebot.", "Hi folks, sorry if this is not the proper place to post.", "I am having some disturbing issues with the Astra sensor. It seems that", "\nafter a couple of hours of usage, the pointcloud published starts to get", "\ndistorted, as if the camera is changing its roll. You can find more details", "\nhere: ", "Did you have any similar issues when testing it with turtlebot??", "\nAny ideas on how to address this issue?", "Thank you,", "\nBest", "Your question on the Orbbec forums is likely the right place to ask. I have not observed it but our demos are not especially sensitive to small roll angles to we might not have noticed.", "Hi everyone,", "I am a new user of turtlebot2. I got a problem on setting up the Astra sensor.", "First, I failed to set up the video stream in this ", " . The error is “uvc_get_stream_ctrl_format_size: Invalid mode (-51)”. Is there anyone got this problem, and could you please let me know how to solve it?", "Second, when I cakin_make astra_camera, there is a error “/usr/bin/ld: cannot find -lOpenNI2Orbbec”. Can you please let me know how to fix it?", "Thank you very much!", "Best,", "\nYuchen", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["with astra_camera: ", "\n", "with openni2_camera: ", "\n"], "url": "https://discourse.ros.org/t/new-depth-sensor-orbbec-astra-call-for-testing/252"},
{"title": "[TB3] The Turtlebot3 Example #10 The Journey of the Turtlebot", "thread_contents": ["The Turtlebot example ", " : Turtlebot Blue (so-called Real Turtlebot) which can move based on 4 legs locomotion with 8 joints", "The journey have just begun", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-the-turtlebot3-example-10-the-journey-of-the-turtlebot/965"},
{"title": "[TB3] The TurtleBot3 - The Journey of the Turtlebot with R2D2", "thread_contents": ["Hi,", "This time we filmed the extra scene but not the example video, and it seems like the Turtlebot Blue (we called this before as Real Turtlebot) just wanted to share the exciting feelings came by upcoming new Starwars series.", "The composition is just simple: A few kinds of ollo parts, 4 waffles (we decided to call the basic plates of the TurtleBot3 as this), and 3 Dynamixel XM-430-210.", "I think that you’d have a fun with your family while you make your own starwars characters in the Christmas next year ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-the-turtlebot3-the-journey-of-the-turtlebot-with-r2d2/998"},
{"title": "[TB3] TurtleBot3 Autonomous Car", "thread_contents": ["TurtleBot3 example ", " Autonomous Car with 2 Dynamixels:", "\n1 x XM430-350 for steering, 1 x XM430-210 for driving", "\nand 2 x TurtleBot3 waffle plates, ROBOTIS Ollo parts is used.", "\nIt looks like you can use two XM430-210 for both controls.", "\nWe are planning to make real autonomous car with this, and also that uses the camera or the laser scanner for line tracking & object recognition.", "\nIf you have any ideas for making TurtleBot3 Autonomous Car, feel free to let us know ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-autonomous-car/1011"},
{"title": "Need help i'm working on a turtelbot project", "thread_contents": ["Hello,", "\nfirst of all excuse my bad english, i don’t if i’m in the good section or no.", "\nI’m working on a turtlebot 2 project.", "\nmy subject is to make a PID controller of the robot to control each wheel", "\ni started with a trajectory pathing where i estimate the error", "\nafter that, i managed to find the expression of the velocity ( angular and linear ) from the errors", "\nnow i am modeling the dynamical of the robot but ", "\nbecause i can’t find other way to model it", "\ni’m working with simulink to do my project and  after i will implant it directlly in the turtlebot 2", "\nThank you", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/need-help-im-working-on-a-turtelbot-project/1032"},
{"title": "Teleop_twist_joy - Inconvenient button settings", "thread_contents": ["Is there anyone who knows why the TurtleBots ancestors keeps the joystick system which has seperated keys to move and stop? Many video games like RPG, Mechanic games and stuffs make always the character move only when the button is being pressed or the joystick is being pulled, and I’m also adapted to this.", "As I have carried on making the TurtleBot3 examples, I used latter one, and the key utility was pretty good. If theres some needs to use the former, I should follow it but I really wondered if there wasn’t any single person that felt inconvenience by pressing stop button everytime when they want to stop the robot.", "The design of the TurtleBot controls is that if you want to stop the robot you can just let go and it will stop if it does not continue to receive commands driving forward.", "Can you explain what you mean by having different keys to move and turn? Usually driving the TurtleBot is done by holding the deadman and then the analog joystick controls forward speed and turn rate.", "When you let go of the deadman switch the vehicle stops itself based on a timeout. if you release the joystick, keeping the deadman pressed,  it springs back to center and the vehicle also stops gently.", "If your joystick has different axes/button orders you may need to set parameters to adjust for your joystick’s mapping.  The parameters for teleop_twist_joy are documented here: ", "See ", " and ", " for examples of tuning instructions.", "At OSRF we mostly test with the F710 wireless Gampad: ", ".", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/teleop-twist-joy-inconvenient-button-settings/1035"},
{"title": "Project about turtlebot", "thread_contents": ["Hello.", "\ni’m trying to modelise the turtlebot on simulink with a PID conroller", "\ni’m wondering if you know what kind of motors the wheels turn with.", "\nand if you have ever worked with a similar project i’ll be greatful if you share them with me", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/project-about-turtlebot/1046"},
{"title": "[TB3] TurtleBot3 Tank", "thread_contents": ["Hi ", "TurtleBot3 has sprockets that enable anyone to easily change from general wheels to caterpillars.", "\nIf you want to replace it, you would just pull rubber wheels out of the sprockets and assemble pieces of caterpillars on it.", "\nIt makes to efficiently drive on piled woods or books rather than using general wheels.", "\nFurthermore, TurtleBot3 can ride on the off-road conveniently. (e.g. debris, grass, bushes and even rocks!!)", "\nThis example is made of two Dynamixels (XM430-W210-R), two Dynamixels dummy and 72 pieces for caterpillars. (The One side of caterpillars needs 36 pieces)", "Thanks.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-tank/1169"},
{"title": "Using NUC with Kobuki", "thread_contents": ["Hi,", "It seems to becoming harder to find netbook size laptops to use with the Kobuki base and so I’m looking into using the Intel NUC (e.g. NUC6i5SYH). I want fully autonomous operation where the Kobuki can dock and charge its batteries and the PC, so I wondered if anyone was aware of a power solution e.g. external battery that can connect to the Kobuki 19v output AND will allow the NUC to get a reading of the battery level e.g. via USB. Alternatively, is it possible to use a dc-dc converter with one of the other Kobuki power outputs (e.g. 12v 5A) to power the NUC?", "Or if anyone knows of a good choice of small laptop to use then that might be preferable.", "Thanks,", "\nLee.", "Hi,", "Have a look at the ", ", it’s a DC-DC converter as well as UPS (6-30V input, 6-24V output). It supports multiple battery chemistries (e.g. Li-Po, SLA) and has an adjustable DC output.", "It has a USB interface, and Linux drivers, supporting ", ".", "I’ve been using this device on my robot, I wrote a very simple Python ROS interface for this, which just publishes the charging state and individual Li-Po cell voltages. I’ll upload this script and link it on this thread when I get the chance (I’m currently away from my robot).", "Alex", "Thanks for the response. After posting I did end up looking at that and it looks like a good solution. Good to know that you have it up and running and that the Linux drivers work etc.", "I’m thinking of using 6 of these batteries:", "\n", "7926", "\n", "\nwhich based on my very quick calculations should drive a NUC for about 6 hours (assuming NUC consumes 15W)?", "I asked the OpenUPS company if they could recommend any enclosures - did you find one that works well?", "Hi,", "we have a NUCi7 on our Turtlebot. We ordered an i5 but got an i7 due to", "\nsome issue while ordering. The i5 had a notebook powerbank with it which", "\nis not powerful enough for an i7 (it lasts about 30 minutes). Thus we", "\nare now testing a custom LiIon battery. It seems to be able to run the", "\ni7 for about 4-5 hours now but we are still working on a battery status", "\nintegration. Additionally, we need about 4-6A for charging the robot", "\nnow. From the internal wiring, this should not be a problem, but the", "\nwall charger only gives us 3.2A. So we also still need to get a powerful", "\nwall charger (right now using adjustable lab power supplies).", "Once the battery runs well, I can send you our setup. The OpenUPS looks", "\nvery nice as well, especially the already integrated battery status and", "\ncharging state. If you deploy it to your Turtlebot, could you give", "\nfeedback about it?", "Best,", "\nLasse", "Hi!", "We are also using Turtlebot (version 1) with an i7 NUC which actually requires 19V / 65 W. So far, we didn’t use any DC/DC converters or something similar, but instead, we powered the NUC directly from the 12V / 5A output port on the Kobuki.", "This is certainly not ideal, and we experienced the NUC shutting down because of a “processor thermal trip” after some time (sometimes only 30 mins when the Kobuki battery would still last for long). First we thought it’s a problem with the NUC (old thermal paste or something), but later we realized that the output voltage from the Kobuki is monotonically decreasing and will be too low at some point. This seems to have caused the overheating problems then.", "Either ", " or ", " seem like good solutions for this problem, but I’m not very experienced with DC-DC converters or UPS and I’m glad for any advice.", "Can anyone tell me if this would be a good buy for more reliable mobile NUC operation?", "We had a similar problem and solved it by purchasing a power bank. It charges from the kobuki base, provides 19V to the NUC and does not kill the Kobuki battery. We use one of the 19V connectors on the back of the Kobuki and make an adapter to charge the powerbank when the robot is on the charger.", "This is the one we used: ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/using-nuc-with-kobuki/489"},
{"title": "[TB3] TurtleBot3 Segway", "thread_contents": ["Hi!! Happy new year ", "Did you think that TurtleBot3 can stand only two wheels??  Of course, it can’t stand.", "\nBut OpenCR and math makes it real!! The 6-DOF IMU (Acceleration and Gyro sensor) in OpenCR and PID control theory help the TurtleBot3.", "\nThe OpenCR is open project like TurtleBot3. If you have any interest of it then contact ", ".", "\nAlso, If you want to study about PID control theory and apply the robot, then Buy This Cool Stuff after 3 months ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-segway/1247"},
{"title": "[TB3] TurtleBot3 RoadTrain", "thread_contents": ["Hi!!", "What is the limit of transformation of TurtleBot3?", "\nIt can be a motorcycle, a segway, a tank, or even a road train!!! as it looks like in the video now!", "Guess what can TurtleBot3 do in this video?", "\nAs you can see, they serve food to people.", "\nAs an example, TurtleBot3 has shown that its use can be expanded service areas.", "\nChallenge your TurtleBot3 in a various areas!!", "\nMake your ideas and imagination to reality with TurtleBot3!!! ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-roadtrain/1364"},
{"title": "[TB3] Payload Test of TurtleBot3", "thread_contents": ["Hi All,", "How much do you think the appropriate payload of the new turtlebot3?", "\nWe tried several tests last week to measure the payload of turtlebot3.", "Payload Test of TurtleBot3 @ ROBOTIS Office (using Dynamixel XM-430 for Turtlebot3 Premium)", "Thanks, ", "\nPyo", "Robot specification cloud sourced? Nice!", "I assume the question here is the max payload. And I don’t have an answer to that, sorry. Just a comment.", "I’m not a robot builder but a software guy, so apologies that I’m likely overlooking technical difficulties. From you video there seems to be discrepancy in the point the robot returns to for almost all weights. Also AFAI understand correctly TB3 is designed to be customizable structure-wise. Provided, software to compensate the payload weight for wheel control seems to be a required component for this robot. So to me the question may become like “what max payload weight should the software handle?”. Hope I’m not mistaken ", "Good question!", "The reason of the failure of the robot to rotate in this video was a problem of the plate structure. As we put the weight on the robot, the bottom plate hit the floor and could not make the desired turn when it rotated. So, now, we are making the plate stronger and making it easier to assemble.", "If I answer your question, the maximum load will depend on the type of hardware you have assembled. For example, the maximum load may vary depending on the torque of the motor used, the method of coupling the plates, and the support used. As you know, the shape of Turtlebot 3 is very diverse. Turtlebot 3 in the video is just one example. Attach a picture of the examples we are currently testing. Please enjoy the following videos and news.", "I d like to know when will  turtlebot 3 be available ?", " Will it be released in Jan. 2017? Hope I have answer now! Thanks!", "Thanks, ", "\nTurtleBot 3 is expected to launch in the spring of 2017. ", "So, it would be late in March or April?", " So late", "These are amazing, I just heard about the project today (tb3 compared to tb1 which I knew of).", "Any chance you can test one with a space in the middle, or even an upside down U shape, because I want to run a gantry along the middle with hopefully cnc 3d print/route/drill along the full length, ideally it would be able to print skeleton supports to drive up as it printed an object.", "Imagine it printing a corkscrew pair of ramps which it drove up as the model layers were printed. A bit wasteful until you consider it could then potentially do prints of any size…", "I am very grateful for your advice.", "\nWe are working on an improved version of this. Thank you. ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-payload-test-of-turtlebot3/827"},
{"title": "Speech recognition", "thread_contents": ["i am using pocketsphinx for speech recognition to move turtlebot. but my words are not recognized correctly except one word or two? can anybody help me how can i recognize correctly only four words forward backward, left, right. i have used many other packages as well, and also read how to make my own language model as mentioned in cmusphinx but i cannot understand the steps i should follow. what should i do to recognize only four words by pocketsphinx", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/speech-recognition/1464"},
{"title": "Acessing TurtleBot camera", "thread_contents": ["I am new to ROS and TurtleBot. For a project I need to get live video from TurtleBot’s camera. Is it possible to do, If yes what are the steps. Thanks in advance.", "I am using ROS indigo in a Ubuntu 14.04 OS.", "Hi ", ",", "Glad to hear you’re getting started using ROS and the TurtleBot. Please ask for help doing specific things on ", " We work to reserve the forums here for community discussions.", "For more information and guidelines on asking questions please see ", " the more details that you provide the more helpful the answers from people will be.", "Also there are several tutorials I’d recommend going through to get some more background before asking questions:", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/acessing-turtlebot-camera/1524"},
{"title": "[TB3] Gazebo simulator", "thread_contents": ["Hello, everyone.", "TurtleBot3 is coming!! It will be launched on next month ", ". But, don’t you want to take TurtleBot3 ASAP??", "\nFor now, you can meet TurtleBot3 in ", " with ROS. You may clone ", " and enjoy it !!!", "\nTurtleBot3 Gazebo tutorial is written in ", "If you have any question or request, feel free to remain Reply.", "Thanks ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-gazebo-simulator/1608"},
{"title": "[TB3] TurtleBot3 Friends", "thread_contents": ["Hi all,", "You can check out the latest TurtleBot3 wiki site ", "Onshape : Search for “ROBOTIS” or “Turtlebot3” to find 3D modelings of the Friends", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-friends/1717"},
{"title": "[TB3] Very informative and detailed review by Erico Guizzo and Evan Ackerman", "thread_contents": ["I’ve found a couple of reviews about TurtleBot3 that might give you an idea of what the TurtleBot3.", "\nI find these articles are amazingly informative when it comes down to get ready to spend some money.", "\nYou will find bunch of pros and cons about TurtleBot3 based on objective investigation.", "\nTake a few minute breaks while reading them ", "We take an in-depth look at the new TurtleBot 3 Burger and Waffle from Robotis", "My TurtleBot doesn't do anything useful at all, but it deserves an upgrade", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-very-informative-and-detailed-review-by-erico-guizzo-and-evan-ackerman/1808"},
{"title": "[TB3] Don't miss FREE TB3 Burger event!", "thread_contents": ["Hey guys, just in case you might not notice that there’s a facebook event going on for FREE TurtleBot3 Burger.", "\nThe event ends on May 15th, so hurry up and don’t let the TB3 slip through your hands!", "\nEven if you missed the chance, don’t worry. You still have time to apply for Early-Bird discount offer by May 29th ", "\nGood Luck!", "**This event has ended**\n\n[EVENT] TurtleBot3 Give-away \nHelp TB3 Cross the Cliff and Come Back Home! \nShare your creative & fun ideas with us.\nFree TB3 Burger to the top 3 best ideas! (due by May 15...", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-dont-miss-free-tb3-burger-event/1809"},
{"title": "[TB3] TurtleBot3 Early-Bird Discount Offer (until May 29)", "thread_contents": ["Hi all,", "Finally! We start selling the TurtleBot3! ", "Since the announcement of ROSCon2016,", "\nit has become possible with a lot of feedback from the ROS community. Thank you. ", "\nBurger $549 -> ", " / Waffle $1,799 -> ", "Don’t miss it !!", "\n", "For the more information:", "\n", "\n", "We are an Open Source Team of ROBOTIS. With the open source hardware/software, our robot friends are hoping to enrich our lives. We mainly develop/support th...", "\n", "Hi Yoonseok Pyo,", "Do you offer individual component purchasing ability (for example 360 lidar ) .?", "thank you", "Hi ", "Yes, you can purchase the individual component like a LDS below.", "\nBut, it can’t right now. It is expected that the time of purchase will be approximately from the end of June to July.", "Thanks!", "Pyo,", "I’m excited to start playing with a TB3. I filled out the form to order a burger model but haven’t received anything from Robotis. When will we be sent the quotes for what we want to order?", "Thanks,", "\n-Marq", "\nIt is now in preparation for mass production. Once you submit the form, you will receive a quotation from the nearest distributor from your location. If you have any questions, contact ROBOTIS at ", "Thanks,", "\nPyo", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-early-bird-discount-offer-until-may-29/1830"},
{"title": "[TB3] Exhibition, Party, and Tutorials with TurtleBot3 at ICRA2017", "thread_contents": ["Hi, all", "The 2017 IEEE International Conference on Robotics and Automation (ICRA) will be held from May 29 to June 3, 2017 at Sands Expo and Convention Centre, Marina Bay Sands in Singapore. Here is the TurtleBot 3 development team with ROBOTIS, INTEL and Open Robotics, Tully Foote and Morgan Quigley.", "We are waiting for your participation on Exhibition, Party, and Tutorials with ROS and TurtleBot3. ", "\n", "\n", "Please contact us at ROBOTIS booths ", ", Level 5 ICRA2017 or contact Lucy Oh at ", " for any questions or comments.", "Below link is a message from Open Robotics ", "\n", "Good luck with your exhibition! Is there any estimate when the preordered Turtlebots will be shipped?", "\nBest,", "\nRalph", "We are preparing to ship the product by the end of June. ", "Thanks!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-exhibition-party-and-tutorials-with-turtlebot3-at-icra2017/1878"},
{"title": "[TB3] TurtleBot3 Follow Demo", "thread_contents": ["Hi everyone ", "This time I came to show you a new demo video.", "\nThis Demo video TurtleBots are follow people. Just like baby duck follows a mother duck!", "\nThe follow demo uses only one LDS(Laser Distance Sensor).", "You can do a lot of things with TurtleBot3.", "\nTurtlebot is release now.", "Thank you ", "For more information:", "\n", "Very cuuuute! And very good programming.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-follow-demo/1897"},
{"title": "TB3 Launch details", "thread_contents": ["Hi all,", "Does anyone have any information about when the TB3 will be officially available, how we will be able to purchase it, costs, etc?", "Curious minds want to know!", "//Mike", "Thanks, Mike", "The official launch date of TurtleBot3 is not yet known, but it is seen from the end of April to the beginning of May. Also, we will post a notice for the beta tester this month. The number of people is about 30 to 40.", "In addition, the public information is published every week through this ", " forum, and the wiki site is also in preparation, and it will be open to the public next week so that all questions can be resolved. ", "Good to know, thanks for the info, Pyo!", "We release a wiki page which contains specifications and various information so that we can solve your question about the TurtleBot3. Please visit TurtleBot 3 Wiki page and let us know what you want more ", "Will we be able to get spare parts, e.g. if we like to have more wheels?", "Hi ", "You can find the parts list of TurtleBot 3 from the link below.", "The bolts and nuts include extra quantities, but do not include spare parts for other parts.", "\nBut we will make it possible for users to buy the parts they need.", "Perfect, thanks for the info.", "Hi ", ",", "there is some documentation about various “turtlebot friends”. To build them additional parts to extend Burger/Waffle are necessary. This there any info about the availability of these extra parts? Or will a friend be an complete different package?", "Thx for the info", "Hi ", "We released the TurtleBot3 Friends hardware design file at the link below.", "So, you can download the STL files directly from each Onshape address as shown in the following figures.", "Hi ", ",", "\nyes, thank you for providing all these designs on Onshape - I think it really helps boosting creativity.", "\nHowever, for some “friends” very special parts are needed you can’t probably 3D print, e.g. meccanum wheels and strong brackets for the servos.", "So my question is: is Robotis thinking about providing these “special” not-really-3-d-printable parts. Like: first you buy the Waffle, then there is a box with additional parts to build the Converyor?", "Thx", "Hi ", "There are so many kinds of mecanum wheels and omni wheels. Making it for all users’ needs is hard.", "\nSo, we provide 3D design files that can be edited for each user’s desired purpose on the web.", "\nAlso, we have plans to sell the “special” parts for the user, if many users want it.  ", "Thanks!", "Will there be an option to purchase the burger or waffle without any sensors or the raspberry pi/joule? I don’t think I am the only person who already has the sensors and computer, and just wants a platform to put them on.", "Hi ", "Thank you for your comments.", "We are also considering selling parts of TurtleBot3 separately.", "\nWe can’t sell all parts individually. But if many users think so, I think that it is not impossible. ", "Thanks!", "Selling parts individually is definitely a great idea. I think you’d get a lot of people buying extra parts to modify their robots. But what I most want to see is the burger and waffle kits just without the sensors or computer boards.", "I would like to see the injection-molded waffle plates for sale if they are stronger than 3d printed ones.", "Besides, home 3d-printers are both slow and they can stink. I live in a motorhome which means that any place I am at a place where I have time to run my printer I have to balance it very carefully.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Sign in. (If you do not have an ID, you have to create one.)", "Click the “toggle tab manager” (A menu will appear on the left side of the browser.)", "Click the “Parts folder”", "Right-click on the icon of the file you want to download.", "Click the “Export…”", "Finally, you can download the output file type you want."], "url": "https://discourse.ros.org/t/tb3-launch-details/1420"},
{"title": "Try to get turtlebot running failed (need help)", "thread_contents": ["Hello All,", "I am trying to get the turtlebot Project (Simulator) running on my system, but I do not get it to run.", "I have done the following steps:", "\n$mkdir -p ~/turtlebot_ws/src", "\n$catkin_make", "get the folder", "// needed to get gazepo run in VMware", "\nexport SVGA_VGPU10=0", "\necho export SVGA_VGPU10=0", "// needed for the base installation of ROS", "\nsource /opt/ros/kinetic/setup.bash", "\necho source /opt/ros/kinetic/setup.bash", "\necho open “.bashrc” to modify the active ROS project", "// for the beginner project needed", "\n//cd ~/catkin_ws", "\n//source devel/setup.bash", "\n//roscd beginner_tutorials", "// for the Turtlebot project needed", "\ncd ~/turtlebot_ws", "\nsource devel/setup.bash", "\n$  printenv | grep ROS", "ROS_ROOT=/opt/ros/kinetic/share/ros", "\nROS_PACKAGE_PATH=/home/ros/turtlebot_ws/src:/opt/ros/kinetic/share", "\nROS_MASTER_URI=http://localhost:11311", "\nROSLISP_PACKAGE_DIRECTORIES=/home/ros/turtlebot_ws/devel/share/common-lisp", "\nROS_DISTRO=kinetic", "\nROS_ETC_DIR=/opt/ros/kinetic/etc/ros", "\n$~/turtlebot_ws$ git clone ", "\n$~/turtlebot_ws$roslaunch turtlebot_gazebo turtlebot_world.launch", "\nget the follwoing error message", "\n[turtlebot_world.launch] is neither a launch file in package [turtlebot_gazebo] nor is [turtlebot_gazebo] a launch file name", "\nThe traceback for the exception was written to the log file", "\nan get the following result:", "Loaded plugin tf.tfwtf", "\nNo package or stack in context", "No errors or warnings", "Beginning tests of your ROS graph. These may take awhile…", "\nanalyzing graph…", "\n… done analyzing graph", "\nrunning graph rules…", "\n… done running graph rules", "Online checks summary:", "Found 1 warning(s).", "\nWarnings are things that may be just fine, but are sometimes at fault", "WARNING The following node subscriptions are unconnected:", "Can somebody help me to fix this. Maybe I have forgot something.", "I have to admit, I am new in ROS, but I have already  read and execute the beginner_tutorials,", "\nwhich has worked fine for me.", "Best regards", "\nRitchie", "Hi Ritchie,", "Thanks for the detailed question. However we ask for debugging questions on ", " That’s a website optimized to get you your answers whereas discourse is focused on announcements and discussions.", "Please reask your question there.", "Having read your post, here are some tips to improve your question. Please check that you’re putting the turtlebot source in the ", " subfolder of your workspace. And be sure to build after you checkout the source. Also you don’t appear to be checking out the ", " repository which has the ", " package. You may also want to look at the output of ", ".", "I’d also suggest that for getting the demo running you simply use the binary debian packages instead of trying to build it from source. You can just apt-get install ", " and the whole demo will be installed.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["build", "devel", "/rosout:\n", "/rosout", "\n"], "url": "https://discourse.ros.org/t/try-to-get-turtlebot-running-failed-need-help/2117"},
{"title": "Clarify on versions usable by Turtlebot", "thread_contents": ["I am curious how come:", "“Able to install ROS Indigo - we recommend Ubuntu Trusty (14).”", "Is this in general for TB3, or TB3/Waffle vs. Burger? And what is the technical reason for this?\\", "(meta question: is this the best forum to discuss TB and ROS?)", "We recommend the Ubuntu 16.04 and ROS Kinetic Kame for TurtleBot3.", "The TurtleBot category here on ROS Discourse is the right forum for general discussions.", "For questions with direct answers or debugging please use ", " with the tag ", " or ", " with ", " or ", " depending on your model.", "There are guidelines for asking questions at ", "Honestly I really want to follow the guidelines but for example I am not at all sure whether the “Question” I posed here was considered within bounds or whether you think it should’ve been posted to Answers.", "Who is “we” ? Could you post a link to that recommendation within the TB3 documentation?", "Honestly I really want to follow the guidelines but for example I am not at all sure whether the “Question” I posed here was considered within bounds or whether you think it should’ve been posted to Answers.", "I commented because I would have recommended that your question be asked on ", ". In general if you’re question has a direct answer that can be considered resolved, then you should use ", " If it’s an announcement that you want to share or a general discussion which you are looking for multiple people to reply to and start a discussion here is right.", "For background it’s mostly about being respectful of others inboxes. Posts here on the forums are broadcasts and go directly to people’s inboxes. Where as ", " is polled and people have alerts setup on topics of interest that they would like to help resolve. The subscriptions to those are voluntary and greatly appreciated, but not recommended for most people.", "We encourage everyone to subscribe to ROS Discourse General as well as any subcategories of interest so they can stay abreast of latest announcements and discussions. Whereas we do not recommend that all users subscribe to ", ", only maintainers and contributors who care about specific tags. The many volunteers who help answer questions on ", " are what helps make this community special and welcoming and their efforts are awesome! But we know that we cannot require that of everyone.", "For reference there are a lot of debugging questions that we service through ", " and from experience if those get broadcast to everyone’s inbox people will simply unsubscribe and then miss the lower volume higher value broadcasts. (For reference ", " averages over ", " questions per day. And with comments and answers that can easily provide up to 100 notifications per day. And if we broadcast that to all of the several thousand subscribers to ROS Discourse + ros-users legacy forwarding that becomes ~200000 inbox messages. And if everyone only skims the posts and archives it in 6 seconds. That would still be over 300 hours of the communities time spent per day reading the emails, without accounting for any effort used to actually answer the questions.", "Instead many people use a polling method and browse recent questions on tags that they are interested in. And just follow up on unresolved questions. For if the question has already been resolved there’s no need to look at it anymore. Whereas discussion posts you cannot filter them in the same way to know if they’re resolved.", "Could you post a link to that recommendation within the TB3 documentation?", "In the TurtleBot3 documentation ", " section as well as the ", " both call out the use of Ubuntu 16.04 specifically.", "We recommend the Ubuntu 16.04 and ROS Kinetic Kame for TurtleBot3.", "Great answer. Are you and ", " developers of Tb3 sw?", "Yes, I coordinate TurtleBot in general at Open Robotics and ", " is the lead on the TurtleBot3 at ROBOTIS.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/clarify-on-versions-usable-by-turtlebot/2133"},
{"title": "Intel discontinued Joule used in Turtlebot 3", "thread_contents": ["See the link: ", "\nIntel just discontinued Joule, which is the SBC of Turtlebot 3.", "\nI tried my best not to say F-word to Intel. Now Turtlebot team what is you plan? Are you going to find another SBC and can we get replacement to Joule some time later?", "Thanks", "\nK", "Thanks ", " for your interest in Turtlebot3", "A conversation already started on ", ", please ask your questions there so that we have a single place to consolidate information", "Thanks ", ",", "Intel will support it through the ", " until 2020.", "Intel will archive its online resources and maintain availability to the Intel Joule community until June 15, 2020. ", "TurtleBot team will also support it, and we are going to find another SBC which replacement to Joule.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/intel-discontinued-joule-used-in-turtlebot-3/2216"},
{"title": "OpenCR and encoders", "thread_contents": ["I want to use my OpenCR board to interface with two quadrature encoders for odometry and wanted to get your thoughts on different approaches.", "I did some searching and the STM32F7 is capable of reading quadrature encoders (I’m not sure how many yet) but this may conflict with the current firmware settings on the board.", "\nAnyone know if the Low-power timer (LPTIM1) is being used for anything?", "\n", "My other option would be to use external counters and interface to them via SPI…", "\n", "Other methods I should consider?", "I’m leaning towards the external counters but  is there anything I’m missing that would interfere with the above shield?", "Any suggestions would be greatly appreciated!!!", "Have you looked at the Turtlebot3 source? You can find it in the OpenCR code. The turtlebot3 uses encoders for odometry. It uses dynamixel’s sdk, which you can definitely find the source for.", "I have slowly been working my way through the source, but haven’t made it to the odometry section yet. The Dynamixel motors are “smart” servos and perform their own position/velocity control and just report this info back the the Opencr board.", "Sorry I wasn’t very clear with my plans. I want to use the Opencr board exactly as the TurtleBot3 does, but swap out the Dynamixel’s for larger motors with encoders. This will require the Opencr board to take on the servoing of the wheel motors and calculate odomerty on its own. I feel comfortable modifying the source to do this but wanted to see if anyone had advice or suggestions on adding encoders to into the mix.", "I have experimented with the STM32 processor and did want to use it’s builtin ability to read quadrature encoders.   I had to give up because of a conflict over timber use.", "But I did find the CPU has zero trouble at all with VERY high interrupt rates  I have four motors each spins up to about 11,000 PRM and has 64 pulses per revolution.   The processor can handle the maximum rate and still do quite a lot else.  that would be (4 x 11,000 x 64)/60 interrupts per second.    That said the interrupt handler in C++ is very short and fast.", "You can further speed  up the  processing by a large factor if you remember the last time the motor changed directions and then you can ignore that the encoder is using quadrature.  And your handler becomes “i = i + direction”  Just one statement.", "So the simplest way to to do the encoder handing inside an interrupt handler in software.", "But if you can use the STM32 counter hardware that just seems so much more efficient but in my case I ran out of timers", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/opencr-and-encoders/2335"},
{"title": "[TB3] TurtleBot3 Burger Assembly Video", "thread_contents": ["Hi all,", "I’ve been planning to post this assembly video[43minute] from long ago and today is the day!", "\nSometimes reading assembly manual seems hectic and often confused.", "\nI have to confess that connecting power pin to the Raspberry Pi 3 board required me some googling :’(", "\nAlthough this video cannot be a perfect manual, saving at least one Raspberry Pi board would be awesome.", "Also, there is an amazing series of ", " recorded by Michael Overstreet so go ahead and check his videos as well.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-burger-assembly-video/2340"},
{"title": "Does Turtlebot 3 supports Kinect", "thread_contents": ["Hello my friends, I’m interested at ROS for like 1 year and  now we want to do something about robotics. That why decided to get Turtlebot for it. Now Turtlebot has launched but I didn’t find about this question. Does Turtlebot 3 supports Kinect for SLAM ?", "I would check on ", ". This is a question which has a specific answer and probably belongs there. One answer is ", "Another possibility is to do a google search (“Does ROS support the kinect sensor”).", "I am not sure that the Kinect will work on the Raspberry Pi.", "I don’t have a Kinect so I can’t experiment with it.", "Jay", "The Kinect works fine with the Raspberry pi 3 and slam although using gmapping is very slow", "\nI have to do that on a desktop then transfer the map to the robot.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/does-turtlebot-3-supports-kinect/2339"},
{"title": "[TB3] problem to connect wiimote to Turtlebot 3", "thread_contents": ["I have two issues:", "\nIssue#1:", "\nIn Teleoperation chapter:  ", ", for every listed remote controller, all operations are marked as “[Remote PC]”. Should it be “[Turtlebot]” instead? We need to connect the remote controller directly with TB3, in order to control TB3 via the remote controller. It has nothing to do with the “Remote PC”. Please clarify this.", "Issue#2:", "\nI am not able to connect wiimote to TB3.", "\nHere is what I did:", "\nAt first, run:", "\nsudo apt-get install ros-kinetic-wiimote", "\nthen:", "\nrosdep install wiimote", "\nthen:", "\nrosmake wiimote", "Everything is fine. No error found.", "Then I try to pair wiimote with TB3. I get the following error:", "$ rosrun wiimote wiimote_node.py", "\nPress buttons 1 and 2 together to pair (within 6 seconds.)", "\n(If no blinking lights, press power button for ~3 seconds.)", "\nWiimote read error", "\nRead error (nunchuk cal)", "\n/opt/ros/kinetic/lib/python2.7/dist-packages/wiimote/wiistate.py:157: RuntimeWarning: divide by zero encountered in divide", "\nself.acc = WIIReading((self.accRaw - self._accCalibrationZero) / (self._accCalibrationOne - self.accCalibrationZero), self.time)", "Then I added some logs in wiimote_node.py. and I found that the following line is not working:", "wiimoteDevice = wiimode.WIIMote.WIIMote()", "I went through the source code of wiimote module: ", " and then found that the following line is causing the problem:", "\nself._wm = cwiid.Wiimote()", "\nSee ", "Anyway, I am able to pair wiimote directly with Ubuntu. But I am not able to pair it with TB3.", "\nHave you seen similar problem? Any solutions?", "Thank you very much.", "\n–Kening", "Issue#1:", "In Teleoperation chapter:  ", ", for every listed remote controller, all operations are marked as “[Remote PC]”. Should it be “[Turtlebot]” instead? We need to connect the remote controller directly with TB3, in order to control TB3 via the remote controller. It has nothing to do with the “Remote PC”. Please clarify this.", "The tutorials are designed for you to plug your device joystick into the Remote PC. You can modify the configuration.", "With respect to your wiimote issue that doesn’t seem to be TurtleBot related. The TurtleBots are running Ubuntu so they should work as any other Ubuntu computer. I’d suggest that you search for similar issues and if nothing is found ask on ", "One side note:", "Here is what I did:", "At first, run:", "sudo apt-get install ros-kinetic-wiimote", "then:", "rosdep install wiimote", "then:", "rosmake wiimote", "If you’ve used the binary installations you shouldn’t need to use ", " to install dependencies. And the wiimote package is a catkin package so you shouldn’t be trying to use ", " to build it. If you’re still having trouble when you ask on ", " please make sure to include your full environment setup etc. Including what code you’ve checked out and what environment setup files you’ve sourced.", "If you can reproduce a problem in the constructor of the Wiimote class, a ", " is the right place to follow up.", "Hi ", "As ", " said that, Teleoperation examples are tested in Remote PC and RP3. But we recommend that this examples are run into the Remote PC due to stable bluetooth connection.", "\nSo ", " have to ", " TurtleBot3 before start Teleoperation examples.", "And I checked ‘sudo apt-get install ros-kinetic-wiimote’ is working and ‘wiimote_node’ is more reliable than ‘wiimote_node.py’. I changed some information about wiimote teleoperation in ", ".", "Give it a try and let me know how it works.", "Thanks", "\nDarby", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-problem-to-connect-wiimote-to-turtlebot-3/2251"},
{"title": "[TB3] 64 Bit Gentoo Image", "thread_contents": ["Hey all!", "As you may have seen, there’s been some significant improvement with respect to Running ROS on Gentoo in the past few months. As such, I’ve compiled a 64-Bit Raspberry Pi 3 image with the necessary ROS components pre-installed!", "Link to the image is ", "Not much needs to be adjusted (woot). you’ll need to set up the wifi, however.", "Edit the file ", " as needed.", "After the wireless is established, you should be able to ssh to the host ", ".", "The only thing to change here (as usual) is the ", ". Just change this value, and you should be good to go!", "Let me know if you run into any issues! This is certainly not restricted only to turtlebot3 people – you can install most packages now through portage.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", ": 128M, vfat", "\n", ": 512 M", "\n", ": 14 G, ext4", "GCC 6.4.0", "No ", " flags are enabled, I left that to you", "kinetic, installed in ", "\n", "workspace in ", "\n", "username is “turtlebot”", "password is “turtlebot”", "root password is also “turtlebot”", "You may consider emerging ", ", if you want.", "I know for a fact that the wireless is working.", "All turtlebot3 packages", "64-bit mode", "Video acceleration (though, if you want to install a desktop, you should remove the line that says ", " in the ", " file."], "url": "https://discourse.ros.org/t/tb3-64-bit-gentoo-image/2435"},
{"title": "[TB3] TurtleBot3 AutoRace 2017 teaser #1", "thread_contents": ["Hi, and how are you", "We have big days (2017.09.13~09.16) in RobotWorld (", "), a most huge international robot industry show annually held in Korea, being presented by Korean government and many great companies. But here are also many competition held, and that’s called “International Robotics Challenge”, and 15 teams come from universities, workplaces, laboratories, will join with their TurtleBots and their professionalism, enthusiasm in RBIZ Challenge 2017 TurtleBot3 AutoRace.", "These TurtleBots are very special: they use many kind of sensors that was not tried much in the other previous autonomous challenges, and that’s not just running with the webcam for lane tracking but should deal with the LIDAR, the untrasonic sensor, the IR sensor, the light sensor, illuminance sensors, and so on, to overpass specific situations, such as the no-light tunnel.", "They were already gone through preliminaries by excellent ideas, and pursuings with TurtleBot3, which is an easy-to-customize platform, they are now rock-n-rolling in this competition by fulfilling their vision processing wise, machine learning and artificial intelligence wise, mechanical wise imaginations. Let’s see how their TurtleBots run in the next clip (this showing will happen the day after tomorrow; 17.09.15).", "BTW, watch this, and let’s think about your participation on next year (maybe at ROSCon2018?) autonomous driving challenge with TurtleBot3! Do you think thats easy? of course thats easy for you, so come, and cheer with the others come from around the world! (but I guess it must be difficult to beat another team actually XD).", "and if you have any ideas or want to talk about this issue, please come ROSCon 2017 Canada, ROBOTIS booth", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-autorace-2017-teaser-1/2626"},
{"title": "[TB3] TurtleBot3 Omni wheel and Mecanum wheel Example", "thread_contents": ["Hi ", "TurtleBot3 can drive omni direction with omni wheel or mecanum wheel.", "\nThis video is based on the concept of it together with ", ".", "\nAn omni wheel has not only the form of a regular wheel but has a degree of freedom in a direction perpendicular to them. This feature creates the advantage of moving the mobile platform in all directions.", "\nThe mecanum wheel is also a kind of Omniwheel that can move the mobile platform in all directions. The different is that it has small discs that are inclined by 45 degrees are arranged along the circumference of the wheel.", "\nThe omni wheel has the advantage that the arrangement should be in the form of an equilateral triangle (three wheels) or a diamond (four wheels), but the mecanum wheel can be used in the same square shape as a regular car (four wheels).", "\nWe used three XM430-W210-R for omni wheel example and four identical motors for mecanum wheel example. Enjoy it ", "do you know when the turtlebot 3 will be available …?", "thanks ,", "TurtleBot3 is expected to launch in April 2017. ", "Do you have a model, file which can work with omni wheel?", "\nActually, I want to implement robot designed by omni wheel in GAZEBO.", "You can find it at the link below.", "\n", "To download the model file from onshape:", "\n", "Thanks, ", "Thanks a lot, but I already saw the information of the links.", "\nAfter I encountered it, I rather have a mind to make a model(omni-wheel robot) in GAZEBO.", "\nIn other words, I need the source or package(for example open-package like pr2 robot, atlas robot, etc) related to the turtlebot or others moved by omni wheel", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-omni-wheel-and-mecanum-wheel-example/1028"},
{"title": "[TB3] TurtleBot3 official wiki site (technical information)", "thread_contents": [" is working hard to make TurtleBot3 not only for physical computing but also for the virtual environment.", "\nSo we set up the fake node of TutleBot3 on RVIZ, the most popular visualization tool on ROS.", "\nWe’ll move on to Gazebo 3D and other simulation tools soon.", "Also, we officially release a wiki page which contains specifications and various information.", "\nIf you need more information, please let us know. ", " (technical information)", "\n", " (main website / TurtleBot3 information will be updated soon)", "Hello. I have installed the turtlebot3 simulator as I am interested in learning as much as possible before deciding to make a purchase of an actual turtlebot3. However, I noticed that the “fake Node” command does not work. More specifically, the following command : ", ", results in the following output:", "[turtlebot3_fake.launch] is neither a launch file in package [turtlebot3_fake] nor is [turtlebot3_fake] a launch file name", "\nThe traceback for the exception was written to the log file", "Can you kindly point me in the correct direction to solve this problem?", "Thanks", "Hi ", "This message is because you did not install the ", " package.", "\nThe related packages are described in the following links and how to use them. ", "Thanks,", "\nPyo", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-official-wiki-site-technical-information/1536"},
{"title": "[TB3] TurtleBot3 AutoRace 2017 teaser #2", "thread_contents": ["Hi again", "As mentioned in previous topic (", "), 15 teams brang their customized TurtleBots into the field of RBIZ Challenge 2017 TurtleBot3 AutoRace, RobotWorld (2017.09.13~09.16), South Korea, and showed their exciting skills and dreams of Autonomous Driving technology.", "In the field, three out of 15 teams had succeeded to overcome all 4 missions in time. The robots have never used just a simple line tracing algorithm that can be easily seen in Black & White IR sensoring Line Tracer Competition, but used various recognition technology region from common vision recognition techniques to Advanced Machine Learning methods, such as Tensor Flow, CAFFE, and so on, which can match their database with many real artifacts, i.e. stop sign, parking sign, flags, etc.", "The participants made Autonomy algorithms based on given LIDAR but also put a series of sensors which are not only USB WebCam but also Infra Red sensor, Ultrasonic sensor additionally on their TurtleBots to optimize their hardware to the algorithms they built.", "The team ‘Real Rice Thief (aka rial-bop-doduk)’ wons 1st prize is a group from Hanyang University, a famous in Vehicle Autonomy fields in Korea, next to DongA University (2nd place), KwangUn University (3rd place). In 4th and 5th place, two teams from OROCA (Open RObotics Community Association), a biggest Robotics Community in Korea, took prizes by their brilliant ideas and full of enthusiasm.", "This year, the TurtleBot3 AutoRace Challenge is just beginning, and the next competition is already under scheduling. Watch the races that those teams presented in front of over 1,000 audiences. See you guys on next year with your TurtleBots (maybe at ROSCon2018?).", "\n(All devices for judging are also running by ROS, too!!)", "To see previous clip, go ", "\nThen, see you in next clip!", "Oh, we will be in ROSCon2017 Vancouver, so come to us to talk more about.", "\nThank you!", "Wow so COOOOOOOOOOOOOL !!!", "This is amazing, i am very much interested to see how it has been done. I am also trying to do something like this using Camera but without LiDar", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-autorace-2017-teaser-2/2701"},
{"title": "[TB3] TurtleBot3 with OpenCR", "thread_contents": ["Hi everyone ", "Today I will introduce the board used TurtleBot3.", "\nThis board is called OpenCR.", "OpenCR support ROS and also Arduino IDE.", "\nIt has communications interfaces, including USB, which communicates with the PC, and UART, SPI, I2C, CAN for other embedded device.", "\nAnd various Sensors too.", "Opencr has a lot of possibilities.", "\nIt’s also used on TurtleBot3 and other robots.", "Thanks ", "hi,", "\nwhere you buy that board?", "Hello ", " This board is still in preparation.", "\nThis is supposed to be released in June.", "I’m sorry for give the wrong information to you.", "\nOpenCR will be release in August.", "Thank you ", "Is this available for purchase yet?", "Where can I order new OpenCR? Unfortunately connected Raspberry Pi wrongly and now OpenCR is dead. Fuse is ok, checked that but that is all I am able to do! Orderer Turetlebot3 from ", " but they dont offer OpenCR alone?", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-with-opencr/1488"},
{"title": "OpenCR Software Setup", "thread_contents": ["Can’t add TurtleBot3 Firmware to OpenCR following Docs, get error. What could be the problem?", "Arduino: 1.8.5 (Linux), Board: “OpenCR Board, OpenCR Bootloader”", "In file included from /home/seeggel/Arduino/libraries/ros_lib/ros.h:39:0,", "\nfrom sketch/turtlebot3_core_config.h:24,", "\nfrom /home/seeggel/.arduino15/packages/OpenCR/hardware/OpenCR/1.0.13/libraries/turtlebot3/turtlebot3_burger/turtlebot3_core/turtlebot3_core.ino:19:", "\n/home/seeggel/Arduino/libraries/ros_lib/ArduinoHardware.h: In constructor ‘ArduinoHardware::ArduinoHardware()’:", "\n/home/seeggel/Arduino/libraries/ros_lib/ArduinoHardware.h:76:16: error: cannot convert ‘USBSerial*’ to ‘HardwareSerial*’ in assignment", "\niostream = &Serial;", "\n^", "\nMultiple libraries were found for \"ros.h\"", "\nUsed: /home/seeggel/Arduino/libraries/ros_lib", "\nNot used: /home/seeggel/.arduino15/packages/OpenCR/hardware/OpenCR/1.0.13/libraries/turtlebot3_ros_lib", "\nexit status 1", "\nError compiling for board OpenCR Board.", "This report would have more information with", "\n\"Show verbose output during compilation\"", "\noption enabled in File -> Preferences.", "I was able to compile and flash the OpenCR firmware, but had to upgrade my Arduino software to do so.  What version are you running?", "I’m running Arduino 1.8.5", "Same here.  I did have to follow the procedure on the wiki site (", ") for the USB setup of the OpenCR before flashing.", "I followed procedure exactly but got this error. I will try to reinstall arduino completely!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/opencr-software-setup/2851"},
{"title": "TurtleBot3 - Output from Intel Joule HDMI stopped working", "thread_contents": ["I am working with the TurtleBot 3. The issues I am having are outlined in the following points:", "Out of the box, the Intel Joule displayed correctly to a monitor.", "I wanted to install Ubuntu Core on the Joule, so a BIOS update was required. To do this, I followed the instructions on ", ".", "Once the BIOS was flashed into the Joule, the Joule no longer displayed on the monitor (or other monitors I tried). I tried connecting the cable in different orders but it had no effect.", "I reflashed the BIOS onto the Joule, with the addition of the -clear option, using the following command: Flash.bat -clear Joule_C0-X64-Release-1J2-Public_DNX.bin (suggested in ", ")", "The Joule then connected correctly to the monitor and I was able to install Ubuntu correctly. (A second Joule I was working with experienced the same display issue; however, the above solution did not resolve it.)", "This worked for a time and I was able to control the TurtleBot3 using the android app, but the Joule returned to the state where it doesn’t output from the HDMI.", "I have attempted to reflash the BIOS as above, but it had no effect.", "The Joule still responds when pinged as it did before the display issue rearose.", "How can I resolve this issue to allow the Joule to output correctly to the monitor? Is it possible to restore the Joule to its factory settings?", "Thanks for your question. However we ask that you please ask questions on", "\n", " following our support guidelines:", "\n", "ROS Discourse is for news and general interest discussions. ROS Answers", "\n", " provides a forum which can be filtered by tags to", "\nmake sure the relevant people can find and/or answer the question, and not", "\noverload everyone with hundreds of posts.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/turtlebot3-output-from-intel-joule-hdmi-stopped-working/2905"},
{"title": "Turtlebot3 - Impressions so far", "thread_contents": ["It’s taken longer than expected, but our Turtlebot3 is running.  Here are some brief impressions and lessons learned - contrasting thoughts and experiences are welcome!", "The build instructions are good, but not great.  Adding some emphasis to the orientation of components would be helpful.  I had the motors swapped initially, and it was maddening to get no response from the board, particularly when there is no real display of an error anywhere.  Is there a legend somewhere on the Internet stating what the OpenCR user LEDs mean with the base software?  Maybe it was signaling the problem, but I couldn’t tell.  Also, the build instructions could use a plan view of the OpenCR board showing where things are plugged in.  I know, some of that stuff is available on line, but hunting for it is more difficult than it should be.", "The Intel Joule board is a significant weakness, for several reasons.  First, having the new user flash the board is understandable, but should be highlighted in the instructions well ", " the board is mounted in the bot.  The requirement to reflash the BIOS is also understandable, but maddening - I run Linux, not Windows 10, so finding a machine to flash the BIOS is a pain.  It also seems that more than one person has had to flash the board multiple times before it boots.  Installing Ubuntu - that was worse than it should have been.  How many of us have micro HDMI adapters handy, so we can actually do the install?  Also, how about pointing out in the instructions that charger power supply will also serve as a Joule power supply for the flashing and install?", "More Joule issues - the BIOS checks cause an amazingly slow boot up, particularly for an embedded board.  It also runs pretty darn hot for an embedded board.  Worst of all, it seems quite unstable.  I don’t know if it’s the fault of the Ubuntu distribution or the hardware, but it crashes far too often.", "The OpenCR board seems quite nice, and I like having all of the sensors integrated.  I have had one lock up where communication between the Joule and the OpenCR ceased - no idea where the fault lies.  In that particular case, the bot just kept chugging along until it ran into something.  It would be beneficial to add a power or reset button on the top platform.", "The overall kit quality and part quality are outstanding.  The Dynamixels are quite nice drive units, all of the cabling is well thought out, and the possibilities for expansion are great.", "The Turtlebot wiki page (", ") is very well done.  It lays out the required steps to get the machine running in a clear and logical manner (minus things like provisioning the Joule before build).  I do think it would benefit from a troubleshooting section, including screenshots of what the various steps should look like.", "So, summing up the lessons learned:", "Flash the Joule BIOS before anything else.  You will need a Windows 10 computer, the downloaded BIOS file, and the USB-C to A cable that comes with the Joule.  Be prepared to do this more than once, and to try different BIOS files - the first one didn’t work for me.", "Install Ubuntu on the Joule next.  You will need the power supply, a micro-HDMI cable or adapter, a powered USB hub, a USB memory stick with a bootable Ubuntu image loaded, and a keyboard, display, and mouse.", "Pay obsessive attention to the build instructions, making sure that every part is oriented correctly.  When in doubt, check several pictures in the manual to be sure.", "The ROS learning curve is steep, and a lot of things are taken for granted.  Rviz looks friendly, but it’s definitely not simple.  Reviewing tutorials on the ROS web site is very helpful, but plan to spend a significant amount of time figuring things out.", "Thank you so much for the detailed feedback ", "\nI agree with you for several points in sequence of assembly and software installation.", "\nI hope your feedback can help a lot of users for joining ROS community with TurtleBot3.", "\nWe’ll see what we can improve on our manual.", "\nThanks a lot!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n"], "url": "https://discourse.ros.org/t/turtlebot3-impressions-so-far/2907"},
{"title": "Turtlebot 3: Successfully upload Alternative Ubuntu Desktop 16.04 to Joule?", "thread_contents": ["When I set Turtlebot 3, I met some problems:", "\nIt is very hard to upload the Ubuntu image to Intel Joule board. I am not able to get my PC to connect to Joule board through USB-C successfully. And After that I am not able to upload Ubuntu image to Joule board successfully. It is very hard to find any useful info online regarding these issues.", "After some study, I finally got it work. Here I would like to share with you some critical info.", "1, Connect your PC with Intel Joule board via USB-C connector.", "\nBefore doing anything, we need to make our PC recognize and connect to Joule board. We should see “Intel DnX device” under “Universal Serial Devices” in Device manager. If not, you have a problem.", "\nIf you get it work by following Intel’s description. It is great. If not, it is normal. Here is what you need to do:", "\nAt first, follow the link ", ".  User “vraoresearch” provides a solution. (Thank you, vraoresearch.)", "\nIf you still cannot get it work, here is my suggestion:", "\nStep#1, disconnect 12VDC power supply.", "\nStep#2, Connect PC to USB-B of the Intel Joule board, if you want to see how Joule runs through UART terminal.", "\nStep#3, In Device manager in your PC, select “Show Hidden Devices”. And choose “Uninstall device” on all failed devices.", "\nStep#4, Connect PC to USB-C of the Intel Joule board, at the same time press “DnX” button on the Joule board. Wait for PC to detect the DnX device and then release the button. If it does not work, try it multiple times.", "2, Upgrade the BIOS image to Intel Joule board.", "\nThere is a bug in the file DNX/Flash.bat in the downloaded and unzipped Joule BIOS image. “clearRpmbFlag” needs to changed to “ClearRpmbFlag”. And its value should be defined as “TRUE”", "When running Flash.bat, you should see the following output:", "\nClearing NvStorage…", "After this, you can disconnect PC from USB-C of Joule Board, and connect the 12VDC power supply, the board should be able to boot up properly, Then you go ahead to follow the description to use a USB flash drive to upload the Ubuntu image to Joule board.", "By the way, the bug I mentioned is found in the version 1J2 of Joule BIOS image. Since Intel discontinued Joule. I believe this is the last release of Joule BIOS image.", "Hi rknlhrqy,", "Thank you so much for sharing your method for solving Joule’s USB-C issue when updating BIOS!", "\nI’ll create a suggested solution link to your post from TurtleBot3 wiki FAQ page if you don’t mind.", "Sincerely,", "\nWill", "Hi Will,", "\nNot at all. It is my great pleasure.", "\nThank you.", "\n–Kening", "I’m sooooooooooooooooooooooooooo happy ㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜ  you are SOOOOOOO genius!!! I have suffered for a long long long!!! time. Because I couldn’t enter the BIOS even after installing the BIOS successfully… At first I thought that the connection method of my HDMI wire would be a problem, but when I tried to connect the serial port with putty, I could not enter the BIOS too!!! I searched all the questions related to the bios of the joule board to find the answer. “joule Bios not boot”, “joule board putty serial bios”, “joule hdmi not output” etc… For a very very!!! long~~~~~~ time … and I was able to solve the problem through “”\"\"“your answers”\"\"!!!. My BIOS was the latest version, and Flash.bat was False. After I changed this to True, I was finally!!! free from all the problems. I can sleep well now. It’s all for you. I really love you!!!", "Hi kingbob,", "\nI am thrilled by your email.    Thank you very much for the nice words.", "\nI am so glad that it did help people.", "-Kening", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/turtlebot-3-successfully-upload-alternative-ubuntu-desktop-16-04-to-joule/2224"},
{"title": "There are some question about Turtlebot2,i want to correct position of turtlebot", "thread_contents": ["I found some similar answer on website:", "$rosservice call /turtle1/teleport_absolute “x: 0.0 y: 0.0 theta: 0.0”", "It can send x,y to the turtle and change the position", "So  i want to do this on turtlebot ,   but i can’t find the rosservice about /odom", "Is there have a way to do the same on Turtlebot2?", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/there-are-some-question-about-turtlebot2-i-want-to-correct-position-of-turtlebot/3063"},
{"title": "ARM TechCon: Best Contribution to an Open-Source Software Project", "thread_contents": ["Hello, everyone. ", "I’m pleased to announce the news that we got finalists of the Arm TechCon 2017 Innovation Awards.", "\nI think this is an achievement and good news for our ROS community.", "TurtleBot3, in cooperation with OpenRobotics and ROBOTIS, was awarded ", " at ‘ARM TechCon2017’ in Santa Clara, California from October 24 to 26.", "\n", "\n", "OpenCR in TurtleBot3 is powered by an Arm Cortex-M7 and be able to connect the servos and battery. TurtleBot3 take advantage of Raspberry Pi’s full capabilities as a central computing system for the robot platform. The hardware, firmware and software of TurtleBot3 are open-source allowing users to download, modify and share source codes. All components of TurtleBot3’s 3D CAD data are available for 3D printing.", "\n", "\n", "\n", "Although we missed the final prize, we are proud to announce that TurtleBot3, which was only five months, was finally nominated for an innovation in the open source software project at an international event. We are also proud to be recognized as a platform by many people who want to learn the ROS.", "We are especially grateful to have a great opportunity and wonderful project with Tully, Morgan, and Brian. I want to make a lot of fun things for the ROS community in the future. ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/arm-techcon-best-contribution-to-an-open-source-software-project/3129"},
{"title": "[TB3] The Turtlebot3 Teleoperation Example", "thread_contents": ["Hello ", "The Turtlebot3 would be teleoperated by various devices.", "\nWe tested it using several wireless devices e.g. PS3, XBOX360, ROBOTIS RC100, etc.", "\nThis example is operated by ROS on Ubuntu mate 16.04 with Raspberry Pi 3 (except that it tested by LEAP Motion) and OpenCR which controlls Dynamixel XM-430.", "See you soon with next video ", "Darby Lim", "I would like to use my upcoming Waffle as a part-time telepresence robot, controlled over the internet. This is specifically so that a housebound friend of mine can go to a science fiction convention. This couldn’t just be a standard remote-controlled robot-with-a-camera and face. Science fiction cons are usually extremely busy and even real people have problems not running into other people, especially in the dealer’s rooms.", "The Waffle would be modified with a few more avoidance sensors and a tall head. This should make it approximately 3.5-4 feet tall.", "I am assuming that the avoidance routines would have to be done on-robot and that my friend would be able to “steer” the Waffle with a goal and the Waffle would choose how to implement this goal.", "I’d use a larger lithium battery so that it could last at least an afternoon or day.", "It would go along with me (or I along with it) so that it wouldn’t get “lost.”", "I’m also assuming that I might have to run the Internet off of a cell phone rather than wifi so that it might have lower bandwidth and higher latency than normal.", "Has anybody made a telepresence robot specifically for these conditions?", "Hi ", "Thank you for your interest in TurtleBot3", "\nYour project is really nice! We expect a lot of people like you to transform TurtleBot3 into the robot they want.", "So We have already make some friends of TurtleBot3. I think that your robot is simillar as ", "This friend are help your project ", "Thanks.", "Thank you for the suggestion.", "I’ve looked at Carrier and it doesn’t seem to have the sensors that I need. It needs the capability of traveling on uneven floors as well as perhaps some grassy areas.", "Maybe a combination of Carrier and Monster. It must be extremely stable because I’m sure it will be bumped a lot in a crowd. Think of any kind of crowded situation where there are small tables and thin maze-like passageways. That is an SF con’s dealer rooms.", "And to make human recognition more difficult, many of the people will be in costume and there will be other robots there.", "Part of the reason for the head is that I can put additional sensors there to locate things that a floor-level sensor would miss. The other reason is so that people will think of this device as a person. Another reason is so that the human on the other end of the link can see through the camera on the head.", "I might need to plan on making the head a variable distance high. For portability, it might need to be short, but for telepresence, it might need to be tall. I’ll have to see if the camera I’ve ordered can see in a wide enough field of vision or I might need to make the head more complex than I’d like for now.", "Just thinking out loud.", "Hi Routiful", "I wanted to buy the waffle but it is out of stock.", "I would like to build the “carrier” do you have the complete partlist… the list i found here doesnt seem complete ", "And do you have the instruction for building the carrier?", "Cheers", "\nian", "Hello ", "  ", "Thank you for your inquiry.", "\nTB3 waffle was sold out last month. ", "\nBut you can buy it next year!!", "We don’t officially support instruction for building series of TB3 Friends. However, you can refer to ", " in OnShape.", "Thanks", "\nDarby", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Related packages and applications", "\nros-kinetic-teleop-twist-joy", "\nros-kinetic-teleop-twist-joy-drivers", "\nros-kinetic-joy", "\nros-kinetic-rosserial-python", "\nros-kinetic-teleop-twist-keyboard", "\nros-kinetic-wiimote", "\nros-kinetic-leap-motion", "\nturtlebot3_core (developed)", "\nlearning_wiimote (modified)", "\nrosleapmotion (modified)", "\nOpenCR Arduino", "\nAndroid App (ROS Teleop)"], "url": "https://discourse.ros.org/t/tb3-the-turtlebot3-teleoperation-example/865"},
{"title": "Looks like intel has an eol document for joule module", "thread_contents": ["Sometimes the end of a product’s production run is surrounded by publicity, a mix of a party atmosphere celebrating its impact either good or bad, and perhaps a tinge of regret at its passing…", "With the Turtlebot 3 still listed as pre-order, what does this mean for people who ordered a Waffle, which comes with the joule?", "ROBOTIS and Open Robotics will ensure that pre-order users do not inconvenience the delivery and use of Intel Joule. Currently, we have a substantial number of Intel Joule Boards for TurtleBot3 Waffle, so we have no problem with customer support.", "I’d like to ask about what you will use after Joule, but I’m guessing that this news is as much of a surprise to Robotis as it is to the rest of us and you haven’t had a chance to evaluate alternatives yet.", "I would like to take this chance, however, to ask for an option to purchase either Turtlebot 3 model without sensors and a Rasberry Pi or Joule board. Some of us have those, or suitable replacements, already.", "Thank you for your comments. ", "As you said, we are also looking for Joule’s next board. We are discussing this with Open Robotics and partners, and we plan to announce related plans in the near future.", "Also, shipment of preordered TurtleBot3 (Burger, Waffle) will start next week. In addition, the TurtleBot3 package, excluding the SBC and sensors you mentioned, is scheduled to be sold from the second half of 2017.", "Thanks. ", "That’s excellent news. ", " I’m looking forward to it!", "Intel will support it through the ", " until 2020.", "Intel will archive its online resources and maintain availability to the Intel Joule community until June 15, 2020. ", "TurtleBot team will also support it, and we are going to find another SBC which replacement to Joule.", "Another interesting SBC is the UDOO x86. It has an Intel quad-core 64-bit processor, plus an onboard Arduino-like processor. I believe that it will take Arduino shields and is programmed with a similar IDE. I haven’t had time to set mine up yet, but it’s supposed to run Ubuntu out of the box.", "What about Odroid XU4 with lib.realsense?", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/looks-like-intel-has-an-eol-document-for-joule-module/2017"},
{"title": "Is Turtlebot the right platform for us?", "thread_contents": ["I am thinking of Turtlebot for an intro robotics course I am designing. I am wondering about a few things:", "p.s. is this list active or is there another list where there’s more lively discussion?", "Also looking at ", "Hi ", "Thank you for your interest in TurtleBot3.", "First, you can check it ", " on wiki page. It shows what is in the box. TurtleBot3 officially supports ROS. It already uploaded in ", ". Furthermore, OpenCR that is included in TurtleBot3 is applied Arduino IDE. The source code and hardware already uploaded in ", "Second, it varies from person to person. Averagely TurtleBot3 burger takes 1~2 hours and waffle takes 2~3 hours.", "Third, we provide Raspberry Pi 3 and empty microSD card. So users can install what they want. We recommend Ubuntu mate 16.04 LTS for ROS compatibility.", "Thanks", "Thanks! A few followup questions:", "Thank you!", "Hi again!! ", "The assembly instruction is provided four language including English, Chinese, Japanese and Korean. The main language is English. you can check this ", "When you get the new TurtleBot3, OpenCR has latest firmware but other boards(Raspberry Pi 3 or Intel Joule) doesn’t have operating system. So, we provide all setup process in ", ". Users can easily follow this procedures.", "The ", " is ROS embedded system. The development environment for OpenCR is wide open from Arduino IDE for students.", "TurtleBot3 burger has Raspberry Pi 3 and TurtleBot3 waffle has Intel Joule board. If you order TurtleBot3 burger, you can take all components, Dynamixel, OpenCR, Lidar sensor and Raspberry Pi 3.", "Shipping will start August 1, you can receive it in the order you ordered. We will try to deliver as soon as possible.", "Some people struggle for installation of ROS. So we prepare ", ". This file will help them.", "ROS is open source community during 10 years. It has ", " and many ", " for supporting users. It might be help you when you have any errors during operating robot.", "Thanks.", "Thanks.", "The assembly instruction is provided four language including English, Chinese, Japanese and Korean. The main language is English. you can check this Assembly Manual", "Double check the link. I don’t think it has more than a few pages of English. Or just send me the pdf to avoid any misunderstanding!", "When you get the new TurtleBot3, OpenCR has latest firmware but other boards(Raspberry Pi 3 or Intel Joule) doesn’t have operating system. So, we provide all setup process in TurtleBot3 wiki pages. Users can easily follow this procedures.", "The OpenCR is ROS embedded system. The development environment for OpenCR is wide open from Arduino IDE for students.", "What does the ROS embedded system do? Does it mean that I don’t try to run ROS on the Arduino?", "Shipping will start August 1, you can receive it in the order you ordered. We will try to deliver as soon as possible.", "Can you give me a realistic estimate, because I actually need it on July 1 for my course. How much after Aug 1 do you guess?", "Thanks!", "Pito", "Hi ", "I share ", ". You can check that the all contents are provided English.", "I posted your second question in ", ".", "About shipping in US reference please contact to ", " (For more detail about shipping please contact ", ") The person interested will help you.", "Thanks.", "I think that the usefulness of the Turtle3 for a beginning robotics course would depend on many things. As somebody who has worked integrating technology into university-level education, I would suggest that ROS ", " be introduced into a beginning robotics course unless this is a graduate-level course.", "Part of this for me is the definition of “beginner.” The skill level of the students depends on their background. If they are all skilled programmers and understand basic mechanics, then perhaps “beginning robot course” might be a good place to introduce ROS.", "ROS does have a lot of code that is available for use by the programmer. However, it is a large and complex system by itself. It could easily take the entire course to explain ROS to students who are not already versed in programming.", "With ROS the students are able to program much more complex robots because they don’t have to reinvent the wheel multiple times. ROS covers many very difficult subjects like SLAM and navigation. Many sensors already have the code written to use them.", "The Arduino IDE comes into play because the OpenCR is a separate board which handles some of the low-level processing of the motors and perhaps some sensors. The OpenCR is not able to run ROS, but it can send and receive ROS messages. Therefore to ROS, it looks like a ROS node and the main computer board doesn’t care that it is a separate board.", "The other problem is the class’ budget. Even the Burger costs quite a bit for many educational budgets. One could make it a requirement that the student buy their own but that is a lot for some students.", "I hope this helps.", "Jay", "Hi Jay", "Thanks for the great info! I have some followups inline…", "I think that the usefulness of the Turtle3 for a beginning robotics course would depend on many things. As somebody who has worked integrating technology into university-level education, I would suggest that ROS not be introduced into a beginning robotics course unless this is a graduate-level course.", "It would be a senior/grad level course, the students would all be pretty good programmers already but not in C++. It would be either Java or Python for their previous experience. Also this is a “structured” independent study course so they would be expected to do a lot of digging themselves.", "Part of this for me is the definition of “beginner.” The skill level of the students depends on their background. If they are all skilled programmers and understand basic mechanics, then perhaps “beginning robot course” might be a good place to introduce ROS.", "They will be medium skilled programmers, but likely know little about mechanics. They could be strong in math and would have to learn the mechanics, matrices, transformations, and all that.", "But: I too was concerned about choosing ROS. I have done a lot of software myself and I guessed just reading about it that ROS might be delicate to configure and get to work. I installed it on a new linux laptop without too much trouble but this is just for the first few tutorials. The way these things go, I can imagine that once I got to going beyond that something would stop working and it would be hell to figure out why.", "ROS does have a lot of code that is available for use by the programmer. However, it is a large and complex system by itself. It could easily take the entire course to explain ROS to students who are not already versed in programming.", "With ROS the students are able to program much more complex robots because they don’t have to reinvent the wheel multiple times. ROS covers many very difficult subjects like SLAM and navigation. Many sensors already have the code written to use them.", "The structure of the course is a little unusual: I intend (hope) to make it something that is given every semester, but where the work of students in one semester is used as the foundation for the next, thereby allowing us to shoot for something really hard. That would be a robot that could navigate autonomously out of one office, out the building, down a path to another building, into it and to another office. I first thought this was a “solved problem” and my ambition was just to retrace what already had been done. But now I think it is actually not a solved problem. So, I don’t know if we will achieve (even over several semesters) that goal but it’s a nice inspiring goal to put in front of us.", "I describe all that because I think that to accomplish this we need either to use ROS or write a lot of “real time OS” code ourselves.", "That being said, I am already planning to get students warmed up in the basic world of robotics with a smaller project on an mBot. The smaller project, still hard I think, is to get the mBot to drive in a 2M square pattern, without line following but using sensors to correct and adjust the route. This I do think should be tractable without ROS.", "The Arduino IDE comes into play because the OpenCR is a separate board which handles some of the low-level processing of the motors and perhaps some sensors. The OpenCR is not able to run ROS, but it can send and receive ROS messages. Therefore to ROS, it looks like a ROS node and the main computer board doesn’t care that it is a separate board.", "Excellent. Then my next question is what software is on OpenCR? In other words, what does it do beyond what a bare arduino fulfilling that function do? Also what about using an OpenCR ONLY and then a wifi connection to a bigger linux computer running ROS?", "The other problem is the class’ budget. Even the Burger costs quite a bit for many educational budgets. One could make it a requirement that the student buy their own but that is a lot for some students.", "I’ve gotten a small grant to help pay for this. Still I think the class as a whole would have only 1 or 2 robots. The class initially will be kept between 2 and 8 students (I actually don’t know how many students will be interested.)", "I hope this helps.", "Extremely. With that background, where do you stand on the Turtlebot3 for my objectives? From other info I got the impression that the “burger” with a PI would not be powerful enough and that I would need to get a “Waffle”. Or maybe a “burger” configured with the other available CPU.", "All further thoughts and insights would be greatly appreciated!", "Pito", "Seems like with a budget that can barely afford two small robots, you’re asking for too much here.", "I would suggest using more leverage (e.g a bigger community which already has a lot of resources… like a Turtlebot 2), or reducing some scope. If you make a ‘robot’ with an arduino and a servo, im sorry but that’s not really a robot course. it’s a course on servo actuation. It’s got to be a ", " more complex than that.", "I highly recommend demonstrating kinematic chains (e.g arms), different drive types of robots, different types of sensors, and different types of algorithms which can navigate, move, and orchestrate the robot.", "Just keep in mind, please, that a robot is a SYSTEM as much as an entire laptop is a system. This also means a microcontroller inside a mouse, is not a laptop. (which is what is proposed by only using something as small as a microcontroller and a servo.", "Given also that the students learn from the teacher, I recommend getting a lot more knowledgeable real fast before they come along. Otherwise, you may want to step back again and reconsider using community leverage where there are those more knowledgeable that can help out. If you’re just learning about ROS, there’s no way in hell the students will be able to solely rely on you for all their questions.", "So, you need a super community supported robot/system (you HAVE to use ROS here, given the above constraint). I’ve answered that for you.", "You should also spend your budget on something that makes a lot more sense and is an entire robot system. If the class size is 8-9 students, they can take turns loading software on it, or all be ssh’d into it in the same time. They don’t all need their own robot. That’s a bit grandiose.", "Also, don’t bullshit around on anything that’s not a full computer. ROS works best on an Ubuntu 16.04/14.04 operating system and not on an ARM device. You’ll want to not be constrained by performance when picking and choosing modules. it will cost you a lot more in time and grief than the difference in price between a RaspBerryPI and a $700-800 intel NUC/mini-ITX form factor computer.", "With a platform like this, you don’t have to worry about where to go next. Software on a proper computer will take you to the sky and limit of research in robotics (mostly). Given you’re teaching introductory ROS, a platform like this could easily give you 4 semesters of course data, and with thought, 2-4 more.", "At least give the students a fighting chance. If you get the kids (If they’re graduate level) working on an mBot to do ‘research’ or ‘learn on’, the mBot is nothing like the robots in industry or used in academia, you aren’t setting them up for a future or helping them out by showing them whatever you’re coding on an mBot.", "I can tell you that if I saw an mBot on a resume or information about it (unless otherwise extremely spectacularily innovative or doing something NEVER done before), I would assume that it was a highschool project or something someone did in a weekend that showed no real effort put in towards robotics.", "My 2C.", "I’m sorry, Pito, but I don’t have the OpenCR board yet. I believe that it is programmed like an Arduino, in the same languages, but it uses an M0 ARM chip which means there may be some incompatibilities.", "I did use several of the “Teensy 3.x” boards which are also ARM-based using the Arduino IDE. These worked fine, but not all Arduino libraries were compatible. Most of the libraries were compatible due to the fine people that created the board. I think that all the official libraries were compatible (at the source level), but some unofficial libraries weren’t.", "I thnk it comes down to the programmers that programmed the core code for the OpenCR.", "Unless there is something that the OpenCR board gives us that the Teensy 3.x doesn’t, I would have preferred that they went with the Teeny’s. The Teensy is very small and still does more than an Arduino, packing a lot into a breadboard-friendly dual-inline package. They are also inexpensive.", "I will wait and see before final judgment.", "I am currently going to start experimenting with a UDOO x86 ultra. This is a quad-core x86 (faster than the Joule) with a built-in Arduino onboard. I should be able to use it for both the main processor and the sensor board for a robot.", "I haven’t had a chance to play with my own mBot yet.", "Jay", "Hi Jay", "Thanks for the info… I will investigate further about OpenCR. Also thanks for the reference to Teensy 3.0. and UDOO x86 ultra. Will check them out!", "Pito Salas", "\nBrandeis Computer Science", "\nFeldberg 131", "Hi there (name?)", "Thanks for lots of good insights… Comments inline:", "Seems like with a budget that can barely afford two small robots, you’re asking for too much here.", "I would suggest using more leverage (e.g a bigger community which already has a lot of resources… like a Turtlebot 2), or reducing some scope. If you make a ‘robot’ with an arduino and a servo, im sorry but that’s not really a robot course. it’s a course on servo actuation. It’s got to be a bit more complex than that.", "I assume you mean the ROS community vs. the arduino one? Yes, I totally agree, that’s why I am starting to participate here! Do you consider Turtlebot3 a good candidate? Because that’s the one I was digging deeper on. (I thought the 2 was discontinued?)", "I highly recommend demonstrating kinematic chains (e.g arms), different drive types of robots, different types of sensors, and different types of algorithms which can navigate, move, and orchestrate the robot.", "Gotcha.", "Just keep in mind, please, that a robot is a SYSTEM as much as an entire laptop is a system. This also means a microcontroller inside a mouse, is not a laptop. (which is what is proposed by only using something as small as a microcontroller and a servo.", "Of course: I am well aware of that ", "Given also that the students learn from the teacher, I recommend getting a lot more knowledgeable real fast before they come along.", "Working on it. But I don’t exactly agree with your model. I think the teacher creates the environment to allow students to learn and to teach themselves. Also by the way note that this is more of an independent study course.", "So, you need a super community supported robot/system (you HAVE to use ROS here, given the above constraint). I’ve answered that for you.", "I think ROS is amazing, I agree, especially because of the community. (The software architecture of ROS itself seems to me a little overly complex but that’s just my first impression. I know I have to get deeper.)", "Also, don’t bullshit around on anything that’s not a full computer. ROS works best on an Ubuntu 16.04/14.04 operating system and not on an ARM device. You’ll want to not be constrained by performance when picking and choosing modules. it will cost you a lot more in time and grief than the difference in price between a RaspBerryPI and a $700-800 intel NUC/mini-ITX form factor computer.", "Good advice. I heard elsewhere also that Pi was underpowered for the job. Intel Joule?", "With a platform like this, you don’t have to worry about where to go next. Software on a proper computer will take you to the sky and limit of research in robotics (mostly). Given you’re teaching introductory ROS, a platform like this could easily give you 4 semesters of course data, and with thought, 2-4 more.", "At least give the students a fighting chance. If you get the kids (If they’re graduate level) working on an mBot to do ‘research’ or ‘learn on’, the mBot is nothing like the robots in industry or used in academia, you aren’t setting them up for a future or helping them out by showing them whatever you’re coding on an mBot.", "My thought (maybe wrong) was this: a simple, successful experience, where they confront face to face the fact that a robot interacts with the real world and won’t just do what you tell it, i.e. even drive in a straight line. Do you not buy that?", "Thanks much. So in summary, I wonder about your opinion about the Turtelbot3 with the Joule. And of course I am keen to continue the discussion to learn more from you!", "Thanks,", "Pito", "Perhaps if you first prepared a relatively simple project for the students by having them use a specific part of ROS to do what you wanted.", "For example, the suggestion of having the robot roll in a simple square. Though I might suggest doing line or maze following. Both of these seem more ", " for students than rolling in a square which seems more like a homework problem.", "Yes, I agree that all of the above are homework problems, but people react better when there is some fun and just a little competition involved, IMHO.", "If you teach the general concepts of ROS and then concentrate on the parts of ROS that the students would need in order to achieve the goal, ROS might work out.", "After I do the basics to learn ROS with the Waffle as ordered, I will attempt to replace the Joule with a NUC and give the Joule to my preordered Burger. After this, I will keep those machines for demos and build something more complex and fun.", "Hi Jay", "Perhaps if you first prepared a relatively simple project for the students by having them use a specific part of ROS to do what you wanted.", "I assume the idea of doing something like that on an arduino robot you feel is not the best use of time. My second project I was designing is for them to create a map of a small part of the building and then using the ROS simulator train the simulated robot to find it’s way from my office to an office down the hall.", "For example, the suggestion of having the robot roll in a simple square. Though I might suggest doing line or maze following. Both of these seem more fun for students than rolling in a square which seems more like a homework problem.", "A maze is much more fun, good idea. I thought that not using line following but making them think about 2d geometry as they try to do a straight line, using some kind of sensor to find distance to walls might be a little more challenging and interesting. Line following seems too easy or am I thinking about this wrong?", "If you teach the general concepts of ROS and then concentrate on the parts of ROS that the students would need in order to achieve the goal, ROS might work out.", "After I do the basics to learn ROS with the Waffle as ordered, I will attempt to replace the Joule with a NUC and give the Joule to my preordered Burger. After this, I will keep those machines for demos and build something more complex and fun.", "Great idea for a progression! Thanks and keep any suggestions coming!", "Pito", "A maze is much more fun, good idea. I thought that not using line following but making them think about 2d geometry as they try to do a straight line, using some kind of sensor to find distance to walls might be a little more challenging and interesting. Line following seems too easy or am I thinking about this wrong?", "Well, I’d like to see you personally get it done in 3 months with starting with 0 ROS or robotics knowledge ", "If you’re going to ever do distance sensors, you have 3 options:", "Given your price range, I’d try and go for ", " if it fits the budget, and don’t bother with ", " other than for proof of concept/want people to feel the pain while learning. Actually a combination of them all would be a good way to demonstrate that your algorithms are theoretically bounded by the quality of your sensor data =)", "Pito, design the course and what you want to show first. The robot you need will be decided by that. If you are unsure of what the course needs in it/how to go about that, lets take this offline/another thread. I’ve built many a robots and i think I can help you here with coming to a close on what you need to show the students.", "Working with point clouds for distance measurement using laser or 3d cameras is a big challenge in 3 months along with getting the robot moving.", "A proximity sensor for wall following is more doable in that period.", "I disagree. There are many platforms out there where it’s one launch file (e.g one cmdline type in) to bring up a screen to show you what point data it is seeing, and consequently what data you can see from the terminal.", "Given that, you could instruct the students to do stuff with the data using python, C++. In fact, it is the exact same amount of work in ROS to get a prox sensor coming up… to ROS it doesn’t care, it’s all pointcloud data/laserscan data…", "You aren’t asking them to write an algorithm that extrapolates the depth from the images, it’s given already.", "The reason I’m not a fan of the square is that it is a highly intellectual exercise. My suggestions will encourage competition. I don’t think that you need to say anything.", "Yes, you can do these things with an Arduino-based robot. But I believe they will learn more using ROS.", "One of the most important things is that you understand ROS and the algorithms for your projects. I will be installing", "…Linux on a machine tomorrow so that I can start learning ROS in simulation soon. I have books and the web, but I learn best when I can write code!", "Thanks everyone for this thread, I learned a lot. I will continue providing small updates from time to time on my progress and experience in another topic here.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Exactly what comes in the box. In particular, to what extent is the software, ROS, etc. already configured?", "How many hours from unpacking to riding the bot in a circle?", "Asked in a different way, what software is pre-installed on the Pi?", "The assembly instructions is mostly in a non-english language. How come?", "Given that you say “it is already uploaded” that means that we have to install the software onto the actual robot, which is fine.", "I don’t understand what you said about “Applied Arduino IDE”, can you explain?", "Raspberry Pi is with the Waffle, right? Are you saying that we can easily order a Burger with a Pi? Or what exactly?", "If I order on July 1, when can I expect to receive a Burger?", "ROS seems to be pretty complicated to set up (all the xml files, etc.) And there doesn’t seem to be that much support (i.e. Stackoverflow or similar.) Is this true?", "The best: laser range finder", "Close second: 3d cameras (kinect, intel euclid, intel realsense)", "Last resort: proximity"], "url": "https://discourse.ros.org/t/is-turtlebot-the-right-platform-for-us/1892"},
{"title": "[TB3] Gazebo Simulation", "thread_contents": ["Hello ", "This tutorial represents ", " and ", ".", "\nAlso this update includes new models such as ", " and ", "and one more thing…", "You can find it below video ", "Is your laboratory,  house or office too big to SLAM by TurtleBot3??", "\nThen now you can take it more!", "[Github]", "[Wiki]", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-gazebo-simulation/4207"},
{"title": "Turtlebot 3 Localization: IMU for Odometry? Is Odometry the only localization component?", "thread_contents": ["Hey all. I am trying to understand the localization part of Turtlebot 3 Burger.", "\nFrom what I understand from turtlebot3_core, by using an IMU to calculate rotational values from the wheels and translating them into odometry and updating it in the world_map.", "Please kindly correct me if I am wrong and aside from odometry, may I know if the LIDAR plays a part in Localization?", "Regards,", "\nBobby", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/turtlebot-3-localization-imu-for-odometry-is-odometry-the-only-localization-component/4228"},
{"title": "[TB3] TurtleBot3 Auto project", "thread_contents": ["Hi,", "\nI’m going to start the TurtleBot3 Auto project for Driving Automation with TurtleBot as said in the ", " previously.", "\nAs you have been watched previous TurtleBot3 friends videos, the shape or the construction of the TurtleBot3 Auto can be decided as you think, as you wish, as you imagine.", "The video shows that the TurtleBot3 itself gets its eye by attaching a $40 Raspberry Pi Camera, and uses the ", " from ", " to tracking the lane.", "Whatever from wherever the source, algorithms that you are using, it doesn’t matter. “That was just a beginning and will not be finished until the Auto City arrives”", "Any suggestions, any ideas, any applicants for this project is welcomed.", "Hi Leon,", "This is a great functionality. Would you mind to share your code and/or instructions about how to get the same up. I have a fully functioning TB3 with the same Raspberry Pi camera installed you are using. I’m somewhat new to ROS and TB3, but getting along well with the basic functionalities, however totally new to MIT DuckieTown project, so would certainly appreciate some guidance and code drops that would put me on the fast track with this functionality.", "Thanks,", "\nNorbert", "Hi,", "TurtleBot3 - DuckieTown is like-a concept car. Now we are supporting who want to dig into the driving autonomy with TurtleBot3 by ", ", which will become ROS kinetic package soon.", "You can also download ", " and ", " system for AutoRace", "Those sources are based on the AutoRace challenge which was held end of last year.", "\nWe will officially announce those contents on everywhere including ROS Discourse sooner.", "Thanks Leon, I went through the page, it looks to be very thorough. Going to get into setting it up right now. Appreciate the feedback, thanks!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-auto-project/1402"},
{"title": "[TB3] TurtleBot3 AutoRace 2017 Tutorial & Source Codes released", "thread_contents": [" <-- Click here", "          ", "\n", "Hi,", "The source code of TurtleBot3 AutoRace 2017 has been officially released. TurtleBot3 AutoRace 2017, an autonomous driving challenge run by the robot with various sensors, had 4 missions in total; Traffic light, Parking, Level crossing (Toll gate) and Tunnel. In addition, to move from a mission to another, the robot should follow the lanes colored with yellow (left) and white (right). During every sequences, it should overcome weak WiFi connection under exquisitely integrated framework.", "Official source is released not only for whom wants to hold some driving autonomy competition in their country, their town, but doesn’t know how to start it from 0, but also for whom wants to join in crucial development on TurtleBot3 Autonomous Driving.", "I wish many brains hang their names on core contributors.", "Thanks.", "\nLeon", "Source is here:", "\n", "Autonomous Driving with TurtleBot3. Contribute to ROBOTIS-GIT/turtlebot3_autorace development by creating an account on GitHub.", "\n", "Tutorial video ", " Traffic Light", "\n", "Tutorial video ", " Lane Tracking", "\n", "Tutorial video ", " Parking", "\n", "Tutorial video ", " Node Optimization", "\n", "Tutorial video ", " Level Crossing (Toll Gate)", "\n", "Tutorial video ", " Tunnel", "\n", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-autorace-2017-tutorial-source-codes-released/4339"},
{"title": "[TB3] Toolchain Documentation", "thread_contents": ["Robotis documentation is better now, but when I started out, one of the biggest difficulties I had was trying to figure out which versions of things meshed, what worked with what. I took notes describing the setup comprehensively, from scratch and am happy to share in the hope that they might save someone some time.", "Here’s my environment:  Turtlebot3-burger, ROS kinetic, MacOSX/VirtualBox linux, Samsung Galaxy S3 tablet, Android 24.", "See: ", " and click on the “toolchain” link. This is definitely a wotk-in-progress. Comments appreciated.", "– chuck", "WoW!!! Cooooooool.", "\nI was really impressed and grateful to see your document. ", "We have been working on making TurtleBot3’s manuals for months, and are still making changes to make better documentation (", "). I will try to make better documentation by looking at the documents you have created, if there were any difficulties to understand, or if there are more details to explain. Your document is too good and has lots of good information.", "I sincerely appreciate your participation and contribution and expect your sarah-bella project to be so good and wonderful.", "Thank you very much.", "\nPyo", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-toolchain-documentation/4378"},
{"title": "Turtlebot2 Square-Path demo", "thread_contents": ["The ", ", on page 18, show how the TB2 drives a really nice-looking square, with fairly small error.", "Is the code to make it drive that square available? Otherwise I’ll write my own, but it would be good to have such a nice baseline.", "btw, I did check out “motion_square.py” from the kobuki_testsuite. It doesn’t look anything like that square. Firstly, it drives round corners, and secondly, it exhibits ", " angular error. After one square, my TB2 is already about ", " off. Actually, looking at the code, I’m not really surprised – at the speed it’s driving, the low odometry rate is really going to hurt. But I was willing to give it the benefit of doubt ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/turtlebot2-square-path-demo/4422"},
{"title": "Turtlebot2 control dead time (latency) of 200ms?", "thread_contents": ["I measured the time between when the robot receives a command (directly into the kobuki_node) and when it starts to move (as measured from odometry), and it’s about ", ", sometimes more. Looking at serial line delay, delays in the driver, the sensor data rate, and so on, I could only explain about 50ms of that. That leaves 150ms which is somehow lost in the firmware.", "Am I doing something wrong here, or is this normal?", "Check out this image for a visualization: Top plot is the command, bottom plot is the odometry velocity. I tested pure rotation.", "\n", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/turtlebot2-control-dead-time-latency-of-200ms/4443"},
{"title": "Absolute motion in serial protocol", "thread_contents": ["Does the Turtlebot2 (aka Kobuki) serial protocol have commands for absolute motion (i.e., 1m forward, rotate 90°, etc.)?", "I know that no such commands are in the official documentation, but maybe it was never asked for, and the command were just not documented?", "I need absolute motion and it seems silly to implement a position control loop over the serial line, when the internal micro-controller could probably do this trivially.", "Could, should, would have …", "The program inside the microcontroller is essentially the same, with minor modifications, to that used in Yujin’s cleaning robot products. There are a few reasons why it’s nonsensically expensive to make too many changes to microcontroller code within a company:", "We would have loved to make that code open source so others could have evolved the controller. Unfortunately given the history of that codebase, this was never going to be possible without completely rewriting it.", "Thanks for the reply. I’m not expecting you to change the firmware for me! I’ve just been wondering whether, maybe, this was already in there. From your answer I surmise that it’s not.", "btw, you mention open source firmware. Would you be prepared to make available documentation on the micro-controller and board, so that others could write one? We’re currently engaged in a micro-controller oriented project for ROS and would be interested in something like that to make a show-case on widely available hardware.", "No longer with the company, so can’t help you there, sorry.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["RFC (Request for Change) processes need to be followed to any modification of the flashed program at the factory. These processes are typically long, require a significant round of testing and QA to approve.", "If a bug gets through the cracks, you inflict re-flashing on your company’s partners and users and then you have to deal with a very very (did I already say very?) unhappy CTO/Business Director. Alternatively, inflicting a deb update on users is something that people rarely even notice has happened.", "Usually there’s only one person with the knowledge (more would be a waste) to develop the microcontroller code with its esoteric toolset AND that person is on the product team. You should be thankful for the few brief stints he has available to contribute to a research robot!", "Expanding the serial protocol is more work than just creating a ROS message and developers, unless motivated by the appropriate carrots, will always choose the path of least resistance."], "url": "https://discourse.ros.org/t/absolute-motion-in-serial-protocol/4417"},
{"title": "TB3 Parameters for narrow pathway", "thread_contents": ["Hi,", "\nI’m trying to tune my navigation parameters so that the turtlebot3 can go though pathways of ~30cm. Its a maze, with lots of turns and corners.", "\nAs seen in this video, it keeps oscillating back and forth at such corners.", "\nAnyone have any idea on how to solve this?", "\n", "Arif", "Hi ", "ROS Discourse is not as Q&A bulletin board about technical support.", "\nNext time, please use ", "I have answered about this question in ", " on TB3 repo", "Thanks", "\nDarby", "Yes sorry I get confused between the many sites. I’ll continue the discussion on TB3 repo.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-parameters-for-narrow-pathway/4453"},
{"title": "[TB3] TurtleBot3 Automatic Parking under AR detection", "thread_contents": ["Hi,", "previously, we had presented ", ". Now we are going to present new autonomous parking method which uses vision processing to detect the AR Marker.", "These methods are choosable for specific purposes or environments, such as no-light. Make your own recharge stations or like that by using these packages.", "Source code:", "Applications for TurtleBot3. Contribute to ROBOTIS-GIT/turtlebot3_applications development by creating an account on GitHub.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-automatic-parking-under-ar-detection/4476"},
{"title": "Awesome TurtleBot3 Projects like BallBot Project", "thread_contents": ["Hello ROS users!", "TurtleBot3 is open hardware platform and fully compatible with ROS.", "\nIt is released in June, last year and has been interested from a lot of peoples, such as students, researchers, makers, and hobbyists.", "So, I was wondering, what would people who bought the TurtleBot3 do with it?", "\nI found some awesome projects with TurtleBot3 on Youtube.", "\n(The order is not important.)", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "If you have been doing your project with TB3,", "\nyou could share it what you make it ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/awesome-turtlebot3-projects-like-ballbot-project/4629"},
{"title": "TurtleBot3 with OpenManipulator is released", "thread_contents": ["Finally TurtleBot3 got his own arm.", "\nThis arm is called ", ".", "OpenManipulator is composed by 4 joints and 1 gripper. This manipulator are simply assembled on the TurtleBot3 Waffle and Waffle Pi. Furthermore, because it has 5 Dynamixel which is same motor of TurtleBot3, anyone can friendly control to use ", " or ", ". If you want to get more information about OpenManipulator, please watch presentation in ROSCON 2017 (", ")", "TurtleBot3 with OpenManipulator has many function as SLAM, Navigation, Perception(For example, find an AR marker or a Ball) and Manipulation. So it can navigate anywhere based on map data it created and find an AR marker to use its own camera. Moreover, it is able to pick some object and move another pose to place it.", "Below video shows special demo. You can see it how it works.", "Next video includes a tutorial which explains how to play pick and place demo on Gazebo simulation.", "You can get a more information about setup or launch it in WIKI page and source code is uploaded on Github.", "[WIKI]", "[Source Code]", "OpenManipulator for controlling in Gazebo and Moveit with ROS - ROBOTIS-GIT/open_manipulator", "Please feel free to ask anything to reply ", "\nThanks", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/turtlebot3-with-openmanipulator-is-released/4747"},
{"title": "Turtlebot 2i with Asus Xtion Pros", "thread_contents": ["I’d like to try the new Turtlebot 2i code with Asus Xtion Pro sensors - specifically the object manipulation routines.", "Is there an easy way to specify these sensors - is it just adding the right URDFs and launch files or is there something more complex?", "Cheers", "Will", "It’s relatively easy. The Xtion Pros are a near exact clone of the Orbbec Atras and the other similar rgbd cams, so it really just involves minor tweaking.", "Also, these boards are just a bunch of poor souls looking for help without any answers aren’t they? lol", "It’s relatively easy. The Xtion Pros are a near exact clone of the Orbbec Atras and the other similar rgbd cams, so it really just involves minor tweaking.", "Actually it’s the other way around - the ASUS Xtion Pro Live came first. Unfortunately, it’s not available on the market any more. The  Orbbec Astras are (slightly crappier) clones of the Xtion Pro Live, and especially from the software side they are basically 100% replacable.", "Also, these boards are just a bunch of poor souls looking for help without any answers aren’t they? lol", "Are you talking about the Orbbec “3d club” forum? Yes, you’re absolutely right. The support by Orbbec is basically non-existent, and they don’t reply to bug reports. It’s just some poor customers trying to help each other figuring out how to work around all the Astra firmware bugs. Unfortunately, the Astra is still the closest thing you can buy today to the original Xtions.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/turtlebot-2i-with-asus-xtion-pros/2930"}
]