[
{"title": "Various updates in rosjava packages", "thread_contents": ["Hi all,", "I just wanted to announce a few updates that have been released in the last few days that may be interesting to people. These are all now available in the rosjava maven repository and can be very easily included in your Android application directly from the Web:", "I thank the different people contributing to these updates (keep them coming!) and hope everyone finds them useful.", "Julian", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Updated versions of rosjava_core, rosjava_extras and android_core which include, among other things:", "A few bug fixes", "Better support for wrapping native ROS nodes in rosjava through NativeNodeMain", "Easier use of the Android Support Library through AppCompatRosActivity", "Easier load of parameters to parameter server through ParameterLoaderNode", "Other things that I’m surely forgetting", "Published tango_ros_node in the rosjava maven repository  (", ". This the library with TangoRosNode from the ", " application by Intermodalics. It can now be included in your application to publish sensor information on Tango devices.", "Published base_controller in the rosjava maven repository (", "). This library has nodes that you can use to drive a Kobuki, Husky or Create base with your Android phone!"], "url": "https://discourse.ros.org/t/various-updates-in-rosjava-packages/1383"},
{"title": "Wrapping your native code as a rosjava node", "thread_contents": ["Hi,", "I would like to test this idea with Java 8 but this tutorial put the focus on Android.", "\n", "Some example to begin?", "I would like to use this technique on a raspberry pi 2 with Jade installed to run some ROS node on that host and later use RVIZ remotely from my OSX", "Cheers", "Juan Antonio", "Juan Antonio,", "Just curious, why do you need to use Java at all in this case? Why not just run the cross-compiled binary?", "Julian", "Hi Juan Antonio!", "\nThis technique is for using native code from your Rosjava program. It will work in a similar way if you are in Android or not.", "First you need to compile your native code using the Java Native Interface specification. To learn how to do this, you can see for example ", ". You should compile and link your code to generate a shared library targeting the system you are working on.", "After that, you need to write a java class extending the NativeRosjavaNode. This class must have defined native methods that match the exported functions in the native library. This way Java will redirect the calls to those methods as calls to the library functions. You load the library passing the a string containing the name of the library to the NativeNodeMain constructor.", "I can implement a simple example if you want.", "Ernesto", "Good night Ernesto,", "Yes, if you can implement a simplest example, I could continue later", "If the test goes nice, I would like to create a Gradle library to publish some info from Mindstorms robots: ", " to a remote ROS Master to visualize data later with RViz.", "Cheers", "Juan Antonio", "Hi ecorbellini !", "\nCan you share a simple example to me?  As for the JNI, I recommand this;", "Thank you", "Hi ", ",", "The example for ", " has been updated recently with a simple example, wrapping a native publisher as a rosjava node, and showing how to execute it. Please take a look there.", "\nAs ", " points out, the technique works out for Android and for pure rosjava, but if you are not using it on Android, using the cross compiled library would seem a simpler solution to me.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/wrapping-your-native-code-as-a-rosjava-node/33"},
{"title": "Rosjava NDK", "thread_contents": ["I’ve been looking at the ROS Android NDK stuff that Gary Servin presented at ROSCon 2015:", "\n", "My hobby is ROS, but my day job is doing Android Platform Development (custom AOSP stuff).  The ROS Android NDK stuff you’re working on is therefore super interesting to me!", "Have you guys managed to realize your goal of implementing a ROS robot entirely on an Android device?  I’m eager to follow along in your footsteps, and contribute in whatever way I can.", " yes you can run ros on Android to control your robot. There are two ways of doing so:", "We are addressing 1. by adding new functionality to Rosjava.", "\nFor 2. we have developed a building environment that cross-compiles the ros core together with the packages that you select. We are constantly adding new patches and workarounds so more packages can be used.", "\nFinally you can use the best of both worlds mixing both approaches. You can have your main ros system running with rosjava on android and a your favorite ros package loading as a native library.", " Thank you for your reply!  However, I also wanted to know a bit more about what you (and others) have managed to build using ROS on Android.", "I’m interested to know if anyone has managed to implement a robot that runs entirely on an Android device.  I know this ", " be possible (based on a combination of packages built using the methods you describe), but it would be great if there was an existing example or (even better) a reference robot.", "Hi ", "!", "\nI know the response came a bit late, but you can take a look here: ", ". This hasn’t been yet announced here (it’s a work in progress), but the code is publicly available already.", "And the answer is yes ", " it is possible indeed. It uses RosJava, RosAndroid, and the cross compiled version of the navigation stack. Feel free to take a look there!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Using Rosjava: is a port of ROS to the java language and can run on Android.", "\nPros: easier and familiar, the Android way. Most basic ROS stuff will work.", "\nCons: Not all functionality of ROS is implemented, few packages have been ported.", "Natively compiling and statically linking the C++ source code of the ROS system for the arm target.", "\nPros: potentially any package can be used; no need to rewrite the code; faster native execution.", "\nCons: complicated cross-compilation process; some functionality is not available in Android due to security limitations and sandboxing of the application; no python support."], "url": "https://discourse.ros.org/t/rosjava-ndk/234"},
{"title": "Rosjava available for Kinetic Kame", "thread_contents": ["Hi all,", "I just wanted to let you know that with the guidance of the great Daniel Stonier, I’ve taken the time to do a pass through all the oficial rosjava and android_ repos to make them available in kinetic.", "This includes, roughly:", "There are still things to do, such as testing and incorporating many great contributions people have shared but haven’t been merged, updating more of the wiki / documentation pages that haven’t been updated yet and working on key additions. Hopefully that will continue to happen over time.", "I encourage you to try this out and report (or help fix!) any important missing documentation on code nits found.", "Looking forward to any comments. I hope you will find this useful.", "Julian", "That’s great, thanks for the effort. I’ll try to update my app from Indigo to Kinetic.", "Great effort: ", ": appreciated  ", "Great work Julian.  Nice Xmas cerci for those who waited for this.", "Hi Julian,", "Thanks for the post. Do you, or anybody else know when rosjava kinetic will be support will be added for ARM64 ?", "Kevin", "Hi Kevin,", "\nRosjava itself is platform independent. What exactly do you mean when you say “rosjava support for ARM64”?", "\nThanks,", "\nJulian", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Update all packages to version 0.3.x", "Update Android build tools (i.e.: Gradle and plug-ins) to a closer to latest version", "Release new versions of 0.3.x packages to the ", "\n", "Release rosjava packages as debian in the kinetic rosdistro (they should be available in the public apt repo on the next kinetic sync)", "Updated the most salient wiki ", " ", " to work with kinetic"], "url": "https://discourse.ros.org/t/rosjava-available-for-kinetic-kame/1070"},
{"title": "ROS Java & Mind Storm", "thread_contents": ["Hello,", "I’m complete new with ROS, but I’m searching the possibility to use ROS to control a Lego Mindstorm.", "\nI’ using an artificial intelligence framework which is written in Java 8 and we would like to combine it with ROS Java to control a Lego Mindstorm robot. I have taken a look to the Mindstorm ROS component (", ") and the ROS Java / Kinetic (", ").", "My question is, is it possible to combine these two packages and use for example a Maven build workflow only with Java 8? In my case I would like to call from the Maven build the Python components for deploying to the Mindstorm.", "Hope for any feedback, thanks a lot", "There is a board/case, ", " which allows a Raspberry Pi 3 to work with Lego Mindstorms. This doesn’t include any Lego parts, just the case, the RP3, and other things to get this to work. The interface board included with this allows Lego motors and sensors to be used.", "I know that ROS will work on the RP3. It isn’t the best platform for it, but it does work.", "Jay", "The Dexter Brick is a great idea. The main constaint of the work is, that I need to use Java 8 and I would like to use ROS for getting access to the accelerators & sensors. Is there another possibility for the hardware? At the moment it should be a testing project", "The BrickPi allows full access to the Mindstorms sensors and motors. It is available ", ". It does use Pi4J to have access to the GPIO pins needed. This runs under Java 7, but there is a lot of information on Google to get it running under Java 8.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-java-mind-storm/2271"},
{"title": "Towards a stable roslaunch API?", "thread_contents": ["The roslaunch wiki page states :", "Given ROS2 is moving forward, and ROS1 dev seems to have slowed down, is it still the case ?", "\nI understand that ROS2 launcher is a different code base (", ")", "I, for one, would like to be able to rely on a stable roslaunch API and implement dynamic python launch scripts (with a more complex logic than what a xml file can allow)…", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/towards-a-stable-roslaunch-api/2403"},
{"title": "Python3 and strings", "thread_contents": ["Hi everyone,", "I am currently writing some python2/python3 libraries to work with ROS messages, and I am in need of some information.", "How to treat the ‘string’ message field in python3 ??", "\nThere is no info about that in ", " , but in python3 we need to specify encoder/decoder whenever we change a string into a list of bytes and vice versa…", "Any information about this I missed somewhere ? Thanks !", "That page does mention:", "unicode strings are currently not supported as a ROS data type. utf-8 should be used to be compatible with ROS string serialization. In python 2, this encoding is automatic for unicode objects, but decoding must be done manually. In python 3, both encoding and decoding are automatic.", "It also says :", "and", "Also in python3 both encoding and decoding are automatic, based on the platform you are running on, provided you use the right type (bytes or str).", "If two platforms use different encodings for two nodes communicating, then messages will probably arrived garbled, if we intend to send a string.", "On the other hand, if we do not send a string with an encoding, then we are sending ", ", just like for a ", " field.", "In any instance it seems the wiki page should separately list Python2 and Python3 to avoid confusion…", "From the generated python code for a msg, when serializing the message into a buffer to send it, ROS encodes the string field as a utf-8 string (x is a string field in the ROS msg):", "And similarly, when deserializing the received buffer, it is converted into a Python str with utf-8 encoding:", "So on the user side, you just need to make sure that the encoding for the string you’re sending is utf-8.", "With that in mind, that block from the msg wiki page seems sufficient to me:", "unicode strings are currently not supported as a ROS data type. utf-8 should be used to be compatible with ROS string serialization. In python 2, this encoding is automatic for unicode objects, but decoding must be done manually. In python 3, both encoding and decoding are automatic.", "Interestingly, from this code, I understand the exact opposite of", "unicode strings are currently not supported", "We are obviously using unicode codec ", " to encode and decode it, and the matching python type is a ", ". So looking at this code, I would say :", "\n’ A ", " field in a ROS message is a unicode string, and will be encoded/decoded using UTF-8 for serialization/deserialization’", "And in that case the wiki should state :", ", if this is not true and the ROS serialization is only supporting ASCII, then the python matching type should be bytes, and the wiki should say :", "and the serialization code needs to be fixed ( no need to encode/decode, unicode is not supported ).", "Yes you’re right, that statement doesn’t seem to be correct.", "As per your recommendation, I think mentioning utf-8 string as the serialization type would be fine (though not sure if that is the right thing with the C++ client library), but it would be better to use/recommend the str type for Python2 since there is no automatic decoding into a unicode string for Python 2. So it would just be type str for both Python 2 and 3.", "But ", " in Python3 is ", " in Python2, and having different ways to serialize data between different versions of python will break a few things in many places (“why my message is garbled on this node and not that one?”).", "\nWe could do that, but it would require a “big warning” everywhere we mention this topic…", "=> I ", " specification regarding the message serialization, and how to match the types of the supported languages and integrate deserialization with it. I seems it’s something we need to drive implementation (especially given ROS supports multiple languages) and prevent “incomplete features” as much as possible.", "The current serialization code ", " :", "=> we need a solution (design fix) that integrates properly for all supported languages…", "I think fully supporting unicode strings would require a lot of effort, more so on the C++ client libraries.", "\nSadly not a solution, but for now the recommendation of just sticking to ascii strings would prevent the issues mentioned in the the second and third bullets affecting user code.", "Agreed. That means that the advised/documented python3 type should be ", "…", "\nI went ahead and worked on an update on the wiki, to try to remove the confusion when talking about py2/py3.", "Well, you can make both Python 2 & 3 string msg types be bytes with a note that bytes is the same as str in Python2.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Primitive Type: string", "Serialization: ascii string (4)", "C++: std::string", "Python: ", "\n", "Primitive Type: uint8[]", "Serialization: uint32 length prefix", "C++: std::vector", "Python: ", "\n", "Is ", " the same as ", " ? (and Python type should be ", ")", "OR should ROS enforce some unicode encoding for string ? (and Python type can be ", ")", "Primitive Type: string", "Serialization: ", " string (4)", "C++: std::string", "Python3: str", "Python2: ", "\n", "Primitive Type: string", "Serialization: ascii string (4)", "C++: std::string", "Python3: ", "\n", "Python2: str", "when we pass a ", " in python 3 (no ", " method) fix attempt ", "\n", "when we pass a ", " in python2 (receiving end lose the encoding)", "when we pass a ", " in python3 (receiving python2 end lose the encoding)"], "url": "https://discourse.ros.org/t/python3-and-strings/2392"},
{"title": "Where is nodejs messages generated", "thread_contents": ["I’m using catkin_make on Kinetic. I defined a action file and I can see that during catkin_make the javascript files have been generated:", "– Using these message generators: gencpp;geneus;genlisp;gennodejs;genpy", "\n…", "\nScanning dependencies of target comm_agent_generate_messages_nodejs", "\n[ 64%] Generating Javascript code from comm_agent/GotoActionGoal.msg", "\n[ 67%] Generating Javascript code from comm_agent/GotoGoal.msg", "\n[ 70%] Generating Javascript code from comm_agent/GotoAction.msg", "\n[ 72%] Generating Javascript code from comm_agent/GotoActionResult.msg", "\n[ 75%] Generating Javascript code from comm_agent/GotoResult.msg", "\n[ 78%] Generating Javascript code from comm_agent/GotoFeedback.msg", "\n[ 81%] Generating Javascript code from comm_agent/GotoActionFeedback.msg", "\n[ 81%] Built target comm_agent_generate_messages_nodejs", "But I cannot find where are those files after catkin_make.", "For ROS Kinetic system-wide message installs, ", " places the built Javascript message files into:", "\n", "For your local workspace, assuming your workspace is in ~/ros_ws/ folder, gennodejs will place the messages into your devel space:", "\n", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/where-is-nodejs-messages-generated/2388"},
{"title": "Sending a Byte Array Message", "thread_contents": ["Hi", "I’m looking to send a byte multi array message from rosjava.", "I’m using this structure but the apps in Android stop automatically when execute nuevo.setdata(eee).", "std_msgs.ByteMultiArray nuevo = pubremotecontrol.newMessage();", "\nChannelBuffer eee= ChannelBuffers.dynamicBuffer();", "\neee.writeInt(4);", "\neee.writeBytes(new byte[] {0x22,0x32,0x22,0x11});", "Hi Gabriel,", "\nCan you paste the error message from logcat?", "\nAlso you can check ", " to compare.", "08-30 16:28:00.651 16610-16610/? E/Zygote: MountEmulatedStorage()", "\n08-30 16:28:00.651 16610-16610/? E/Zygote: v2", "\n08-30 16:28:00.656 16610-16610/? E/SELinux: [DEBUG] get_category: variable seinfo: default sensitivity: NULL, cateogry: NULL", "\n08-30 16:28:04.626 16610-16697/com.baro.barosystem.barocar E/Resources: RunTimeException", "\nandroid.content.res.Resources$NotFoundException: Resource ID ", "\nat android.content.res.Resources.getValue(Resources.java:2345)", "\nat android.content.res.Resources.startRC(Resources.java:1059)", "\nat android.app.ActivityThread$mRunnable.run(ActivityThread.java:2517)", "\nat java.lang.Thread.run(Thread.java:818)", "\n08-30 16:28:08.256 16610-16819/com.baro.barosystem.barocar E/AndroidRuntime: FATAL EXCEPTION: pool-2-thread-18", "\nProcess: com.baro.barosystem.barocar, PID: 16610", "\njava.lang.IllegalArgumentException", "\nat com.google.common.base.Preconditions.checkArgument(Preconditions.java:76)", "\nat org.ros.internal.message.field.ChannelBufferField.setValue(ChannelBufferField.java:55)", "\nat org.ros.internal.message.MessageProxyInvocationHandler.invoke(MessageProxyInvocationHandler.java:46)", "\nat java.lang.reflect.Proxy.invoke(Proxy.java:397)", "\nat org.ros.internal.message.$Proxy2.setData(Unknown Source)", "\nat com.baro.barosystem.barocar.RosAlive$1.loop(RosAlive.java:109)", "\nat org.ros.concurrent.CancellableLoop.run(CancellableLoop.java:56)", "\nat java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1112)", "\nat java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:587)", "\nat java.lang.Thread.run(Thread.java:818)", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/sending-a-byte-array-message/2534"},
{"title": "Tangobot to be presented in ROSCon 2017", "thread_contents": ["The ", " was announced. It’s an interesting full robot implementation on android using rosjava. Also a nice project to build upon and improve, while learning how to write rosjava applications and link them with native code.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tangobot-to-be-presented-in-roscon-2017/2678"},
{"title": ".NET bindings for ROS2", "thread_contents": ["This is just a place to continue the discussion that started in ", "It’s great to have better place for discussions than the github issue tracker.", "As already said before I would like to join efforts regarding a .Net wrapper. In the mean time I will go on with my own wrapper.", "\nI was able to make progress with my wrapper ( ", ") the last few days and I’m trying to implement services tomorrow. Nevertheless as mentioned ", " I’m currently running into some major issues with arrays.", "But I still believe that a fairly flat wrapper without some glue code should work fine in C# and might might also provide better performance. .Net provides a nice mechanism called pinning which allows for a certain set of data types to  pass a pointer of a managed memory section to unmanaged code without doing the usual copy.", "From a usability point of view I think it would be nice be create an api with the same names and usage like the rclcpp. So users can easily switch from c++ to c# or the other way round.", "As already said before I would like to join efforts regarding a .Net wrapper. In the mean time I will go on with my own wrapper.", "That sounds great, I fully agree that a single wrapper is much better for users, and please continue with your efforts! I don’t know if the way I wrote the wrapper is the most .NET idiomatic way, I’m fairly new to the platform/language. My only advice is that you could reuse empy, the templating engine used in rclpy and rcljava (and pretty much all of ROS2), since that’ll help get you more contributors and to better integrate rclcs with ROS2.", "But I still believe that a fairly flat wrapper without some glue code should work fine in C# and might might also provide better performance. .Net provides a nice mechanism called pinning which allows for a certain set of data types to  pass a pointer of a managed memory section to unmanaged code without doing the usual copy.", "I’m far from being a .NET expert, so given that you’re more knowledgeable about this, I trust your judgement ", "  My wrapper is just a .NETified version of my Java wrapper, so I don’t know of any better way of passing structures around.", "From a usability point of view I think it would be nice be create an api with the same names and usage like the rclcpp. So users can easily switch from c++ to c# or the other way round.", "That’d be great, though the recommended path is DDS implementation <-> RMW <-> RCL <-> Language-specific library. rclcpp is meant to be the C++ client library, not a foundation library upon which other libraries can be built. For example, rcljava is built on top of RCL, despite the bindings being written in C++, because that way there’s a clear separation between the base layers and the client libraries.", "My only advice is that you could reuse empy, the templating engine used in rclpy and rcljava (and pretty much all of ROS2), since that’ll help get you more contributors and to better integrate rclcs with ROS2.", "My intention is to finaly use the templating engine. But when I took a first look at how it is used in the rosidl_generator_c it looked terrible complicated. So I decided to hack my own message generator.", "I’m far from being a .NET expert, so given that you’re more knowledgeable about this, I trust your judgement", "I wouldn’t call myself a .Net expert, I actually spend the most time the last two year coding in C++, but there’s some stuff that much easier to do in C# than in C++.", "That’d be great, though the recommended path is DDS implementation <-> RMW <-> RCL <-> Language-specific library. rclcpp is meant to be the C++ client library, not a foundation library upon which other libraries can be built", "My .Net wrapper codes is built upon the RCL. I just wanted to say that it would be nice to have roughly the same naming/usage pattern like in the rclcpp. Building a wrapper upon C++ code would be very very difficult.", "Hi,", "\nI was able to make some progress with my wrapper. As already said on my post on the mailinglist ( ", ") most of the essential features are working now.", "\nI even wrote some examples: ", "But nevertheless I’m running into some problems with the memory management when using arrays. I wrote a fairly detailed article about that in the documentation of my rclcs ( ", " ). Could you perhaps take a look at it and/or tell me how you solved the problem, when to free manually allocated memory inside the struct that wraps an array?", "My idea was to create something like a Message wrapper around the struct, which prevents the struct from beeing copied. The usage of a message would then be:", "Message<test_msgs.msg.Dummy> msg = new Message<test_msgs.msg.Dummy>();", "\nmsg.Data.field name = …", "But I think this isn’t very elegant. But having to free your memory by hand also isn’t very nice.", "Sorry for the slow response.", "I just had a look at ", " I see you found a way to solve this, that’s great!", "The way I solved it is a byproduct of converting between C and Java structures, since the Java messages are pure Java and are only converted to their C counterparts when they are published/received, I can control how and when to allocate/deallocate.", "Do you still have to explicitly deallocate the wrapped structures in C#? Are structs automatically destroyed in C#?", "Hey,", "\nmy solution was to create a (autogenerated) class wrapper around the message struct. The wrapper contains a single instance of struct. For simple types and arrays the code generator generates getter and setter properties which directly operate on the struct (with some nice enhancements for dealing with strings and arrays). Only nested types were a bit nasty to implement.", "In order to solve the memory allocation/deallocation problem the wrapper implements the IDisposable interface. This means at destruction (and on calling .Dispose() ) the wrapper calls .Free() on the struct. In the Free method the struct steps via reflection through all fields check if they also have Free method and calls it.", "\nSo it’s still necessary to free unmanaged memory, because I need to allocate/deallocate unamanged in order to be able to pass unbounded arrays. The main difference is: the user doesn’t have to call .Free() manually.", "I think it might get a bit clearer by having a look at the generated message:", "\n", "\n", "\n", " could you perhaps put your .Net wrapper code on github? I’m still running into some troubles with my code on windows and wanted to have look at your code. (Even though we are using different approaches it would be nice to see if the problems I’m running in are due to ros2 on windows or are caused by my own code)", " hey, sorry for the slow response, I totally forgot about this. I just made the repo public ( ", " ), it’s not as complete as yours, but hopefully you may find it useful. Things you might want to consider:", "Instead of using ", ", use ", " / ", " (see ", "). The reason is that with ", " you can’t pick which RMW to load at runtime, so right now ", " uses whatever RMW implementation is the default. It works fine if you only have one RMW implementation (such as FastRTPS), but it won’t if you have additional ones.", "The CMake cruft I had to add is rather ugly. .NET Core will again switch to a new build system, so I added support for dotnet’s ", ", but also for the current ", " format on Windows. Eventually everything will consolidate into only one build system ( ", " and ", "), but for the time being I added support for both ", " and ", " projects.", "Works on Windows (tested on Windows 10 and Visual Studio Community). I originally added support for ", ", but I’m afraid that after a few changes for supporting Windows, I broke the support for Linux. It should be fairly straightforward to fix, just a few tweaks to the CMake scripts, I think.", "Let me know if you need anything else, and of course, feel free to take any code you may find useful, it’s all Apache licensed.", "Instead of using DllImport, use LoadLibrary / dlopen", "I don’t really see the advantage of using dlopen directly. The .net way would be to create a class that contains the DllImport statements foreach RMW implementation and that is implemented against an interface or baseclass. Than you have some logic that decides at runtime which concrete class should be used and create your code against the interface.", "\nOtherwise you are likely to mix some code that decides which rmw implementation to use with the code that actual call the native function. I think that would be a rather ugly design.", "Also I couldn’t experience any problems with multiple RMW implementations (I have FastRTPS and OpenSplice installed). I would be suprised if there where any problems because “normal” enduser applications just link to the default rmw too.", "The CMake cruft I had to add is rather ugly", "The implementation into the buildsystem is still something I’m kind of afraid of. I will have a deeper look into your CMake code, but I think that’s a point I could really use some help.", "Works on Windows (tested on Windows 10 and Visual Studio Community).", "I need to do some further debugging with my implementation on windows. I’m running into some troubles with strings on Windows, which aren’t passed correctly into the native code.", "Thanks for publishing your code. I’m sure I will find some useful parts in it.", "I don’t really see the advantage of using dlopen directly. The .net way would be to create a class that contains the DllImport statements foreach RMW implementation and that is implemented against an interface or baseclass. Than you have some logic that decides at runtime which concrete class should be used and create your code against the interface.", "Sure, that’s doable, but the way ", " is currently laid out only works with a single RMW implementation. For example, ", " loads ", " ( ", " ), over which the user doesn’t have any control. If you have both OpenSplice and FastRTPS installed, you can’t pick which one to load.", "Otherwise you are likely to mix some code that decides which rmw implementation to use with the code that actual call the native function. I think that would be a rather ugly design.", "I guess that’s a matter of different tastes, but that’s the design we did for ", " and thusly, the one I followed for ", ". But given that the .NET mechanism for using native libraries is more powerful, it may not make sense to use the same design with .NET, so I don’t really know. The approach you described sounds really clean and should work fine.", "Also I couldn’t experience any problems with multiple RMW implementations (I have FastRTPS and OpenSplice installed). I would be suprised if there where any problems because “normal” enduser applications just link to the default rmw too.", "How do you choose which RMW implementation to use? I might have missed something, but it seems to be me that ", " loads ", " directly and you can’t pick which one to load at runtime.", "From my current understanding also a c++ program written by an end user will usually link only against the default rmw. I’m aware that it is possible to link against a non-default rmw but I’m not sure that this is the intended use for endusers. (There’s an issue tracker on github where we discussed this matter and my understanding was that linking against non-default rmw is usually used for testing purposes)", "\nSo the way I’m switching the rmw implementation at the moment is simply recompiling ros2 with the RMW_IMPLEMENTATION variable defined.", "If desired I will implemented a mechanism that allows choosing the rmw implementation in C# at runtime. Perhaps ", " or ", " could comment on this.", "\nImplementing the pattern I described in the previous post, will also have the advantage that it’s possible to have special code paths for different plattforms. (For example different library names on windows) So I will probably go for that.", "At the moment there is unfortunatly a lot of other stuff to do for the wrapper. For example I’m currently refactoring my message generator to use the C# CodeDom (or in future the Roselyn code synthesize interface), furthermore I need to fix the issue relating to windows. And there are still a lot of unit-tests that needs to be written. So it might be a while before I will implement a mechanism for choosing the rmw in the C# code.", "Update on rclcs!", "\nI finally found some time (university is more time intensive than one might think) to work at the rclcs again.", "The next big thing I’m going to do is provide a simple abstraction layer inside the rclcs to implement different codepaths for linux and windows.", "I’m still looking for helpers who might want to help porting to Windows!", "Next update:", "I implemented multiple codepaths for linux and windows that get chosen at runtime. That should make a working implementation on windows much easier.", "\nFurthermore I fixed some memory cleaning bugs and cleaned up some classes.", "\nThe demonstration workspace now also uses the dotnet_cmake_module.", "Another update:", "I implemented  support for msbuild projects. That means the user has almost the same workflow like developing a standard .net application (Code and debug in visual studio or monodevelop) . It also means that I don’t need that many different code paths in the cmake part of the build system.", "Then I managed to compile ros2 on windows and my testing workspace without any problems. Running some simple testprograms that simply creates a node and spins it seem to work fine now.", "\nIn order to solve that I needed to force 64bit builds. (otherwise windows thinks - ohh let’s run this .net application as 32bit program and crashes when I try to call functions the the rcl)", "Next I’ll try setting up a simple publish and subscribe example on windows.", " you are my hero - thanks for developing a C# sharp library for ROS.  Will this be based on .Net Core?", "I’m new to ROS and trying to pick up Python but for me, C# is the most beautiful language out there and the IDEs for C# are always great.  Having to learn another language has been putting me off ROS for ages.  Can’t wait to test drive your binding.", "I’m happy to see that someone is interessted in the C# wrapper. But first - I didn’t put any work in this for 2 month or so. It probably won’t work out of the box. Also I couldn’t get it to work on windows the last time I tried.", "Regarding .net core. It is based on the normal .net framework but the classes used should also be available in .net core. So it would just be building against .net core instead of normal .net.", "For serious developments I recommend using C++ or Python with ROS2. You will have to put more work into this wrapper before it can be used properly.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", "\n", "\n", "\n", "\n", "\n", "The rclcs finally works again with the current rcl", "I moved to the dotnet_cmake_module esteve provided (Will merge the corresponding branches of the rclcs after ", " merged my PR to the cmake module)", "The did a complete rewrite of the message generator using the C# CodeDom interface", "\n** To be fair: I’m still running into major trouble regarding nested messages. It’s really hard to generate them and provide a memory save wrapping interface without to much overhead. (But I’m working on this)"], "url": "https://discourse.ros.org/t/net-bindings-for-ros2/460"},
{"title": "What is the fashionable approach to monitor robot status over a webpage?", "thread_contents": ["Hello,", "I’m planning on developing a webpage so I can quickly assess the status of my robot without having a terminal.", "I’ve seen the following suite of capabilities:", "\n", "Are these still the most up to date framework?  They have some projects without commits for two years.", "What is the community using nowadays?", "Thank you,", "\nPY", "You might look at ", " which runs on Android.  There is also an ", " for a workstation.", "Possibly overkill.", "Both use ", ".", "Which aspects of your robot do you want to monitor? Are you looking for something like ", " for web or a dashboard approach like ", ", e.g. for plotting values?", "If you are dealing with an industrial robot arm you might have a look at ", " (", ") which is currently in beta. ", " has a JS front-end that includes a 3D WorldView (visualization similar ro rviz) and a heart-beat based system status monitor (see package ", " at github). The system monitor ensures that criticial components are responding (e.g. robot moves are disallowed when a gripper is not ready in order to prevent crashes).", "Rosvita uses a custom ROS to Javascript bridge independent of RobotWebTools. Access to this JS lib will be provided in the near future for custom HMI developments. If you are interested contact me.", "[My opinion is biased since I am a member of the Rosvita dev team.]", "Thank you for this information.", "I’m considering monitoring a robot deployed on a small form factor computer. I feel webinterface will be more scalable - any device can connect. Stop/starting services, looking at critical topics for diagnostics, all nodes up…", "Thank you!", "Rosbridge with a simple JavaScript webpage works for me.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/what-is-the-fashionable-approach-to-monitor-robot-status-over-a-webpage/5609"},
{"title": "ROS Android NDK", "thread_contents": ["Hi all!", "\nI’m happy to announce that the ", " has added ", " support. As well as some smaller general improvements.", "There are some important things you need to know to be able to use Pluginlib on Android, that’s why you would probable want to take a look at the ", ".", "We invite you to try it and give us your feedback.", "Hey im not totally clear on how to use pluginlib. Say i am using move_base and want to include the plugins for costmap_2d as well as the local and global planner.", "\nThen i have to define the lib of costmap2d and the planners in the android.mk file.", "\nlike this:", "\nLOCAL_WHOLE_STATIC_LIBRARIES := libcostmap_2d libbase_local_planner libglobal_planner", "\nusually i would have defined the plugins in my yaml file like this:", "\nplugins:", "\n- {name: static_layer, type: ‘costmap_2d::StaticLayer’}", "\n- {name: obstacle_layer, type: ‘costmap_2d::ObstacleLayer’}", "\n- {name: inflation_layer, type: ‘costmap_2d::InflationLayer’}", "\nBut with rosjava i dont have the option to use yaml so i set the rosparams with the ParameterTree.set(name,value);", "\nDo i have to define the plugins there?", "\nI hope i made my question clear.", "\nkind regards!", "Hi ", "!", "You are in the right track. In rosjava kinetic, a ", " was added to rosjava, which can read from yaml files and upload the contents to the parameter server.", "I suggest you to take a look at ", " repository; it uses the cross compiled navigation stack. You will probably find it useful.", "Some places you should look at:", "Hope it helps!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", " --> usage of ParameterLoaderNode is there.", "\n", " with the yaml files you need to configure the plugins."], "url": "https://discourse.ros.org/t/ros-android-ndk/278"},
{"title": "Rosjava License", "thread_contents": ["Could you please specify under which license the rosjava project is? I could not find any on github (", ") …", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["<?xml version=\"1.0\"?>", "<package>", "<name>rosjava_core</name>", "<version>0.3.6</version>", "<description>", "  An implementation of ROS in pure-Java with Android support.", "</description>", "<url>http://ros.org/wiki/rosjava_core</url>", "<maintainer email=\"damonkohler@google.com\">Damon Kohler</maintainer>", "<license>Apache 2.0</license>", "\n", "<buildtool_depend>catkin</buildtool_depend>", "<build_depend>rosjava_build_tools</build_depend>", "<build_depend>rosjava_bootstrap</build_depend>", "<build_depend>geometry_msgs</build_depend>", "<build_depend>nav_msgs</build_depend>", "<build_depend>rosjava_test_msgs</build_depend>", "<build_depend>rosgraph_msgs</build_depend>", "<build_depend>sensor_msgs</build_depend>", "<build_depend>tf2_msgs</build_depend>"], "url": "https://discourse.ros.org/t/rosjava-license/6811"},
{"title": "Is rosjava worth using when not using android", "thread_contents": ["My team will be starting a large ros project soon. Much of our non-ROS legacy code is written in Java and we are debating how best to integrate ROS. I have some questions which would be helpful in making a decision. What is the usability of rosjava for large projects? It seems to still be in development and has been updated to kinetic, but much of the documentation and discussion around it seems to be a couple of years old. Would anyone recommend it for projects that don’t involve android development? Is there a substantial performance impact from using rosjava vs ros-native? Is communication between a rosjava node and a ros-native node difficult? Also does it support tf2? I realize this is quite a bit to ask in one question, but I hope someone can help.", "Hi ", "!", "\nLet me try to answer your questions the best I can:", "Hope this helps! Don’t hesitate to ask again if you need any clarification about anything.", "Hello ", ",", "\nThank you so much for the detailed response! This has definitely cleared up most of my questions. I imagine performance won’t be an issue since we can wrap native nodes. I’m going to start experimenting with rosjava a bit more, now that I know it is worth looking into. I’ll let you know if I have any more questions. Thanks again for the great answer!", "Awesome, good luck with that!", "\nI will try to help you whenever possible, just let me know!", "Can I use rosjava at my OSX without installing some ros-related installations ?", "\nROS OSX did not install and is no option at OSX Sierra ", "Thanks for some suggestions", "\nCheers", "\nChrimo", "Christian,", "Yes, that would work. Rosjava is a pure Java implementation.", "\nNote that the available functionality is highly reduced compared to the core client libraries, but you would definitely be able to create nodes and connect to other ROS systems", "I have another question. Is there an implementation of any tf2 functions beyond the messages. The Maven artifact you posted works well for creating tf2 messages, but I haven’t been able to find any information on an implementation of the rest of the tf2 libraries. Have tf2 classes such as the transform broadcaster been ported/wrapped?", "I’ve never worked with tf2 in depth, but a transform broadcaster or static broadcaster is not hard to implement: it’s pretty much a node that publishes tf2 messages. There are also some helper classes around to handle geometry transformations and stuff like that.", "\nAnother option would be to use a cross compiled version of the Cpp library, but I’d only do that if the library you need is too complicated to implement in Java (for a simple publisher, I think it’s not the case).", "Perhaps if you open a concrete thread in ROS Answers I can be more helpful. Please point me to the link if you do so!", "Ok. I am looking into implementing the transform broadcaster. It looks like it should be doable. I’ll update after I give it a shot.", "That’s great! Good luck and feel free to PR your contribution to the rosjava repo. We’ll try to review and accept it quickly.", "After digging into the structure of tf2 more I decided there was not much value in recreating the transform broadcaster. In order to fully utilize tf2 much of the library needs to be recompiled with JNI wrappers. This was done for RosTango 3 years ago, but has not since been maintained. I came across the FrameTransformTree in the ros_geometry package. This tree is compatible with tf2 and provides the same basic query functionality. This can be used with a simple subscriber setup to maintain the transforms from the /tf topic while still using tf2 tools for visualization etc.", "Hi ", ",", "\nCould you comment on your experience so far? What major difficulties you faced and what was straightforward?", "I am currently in the same situation than you were a year ago. I also have to start a big project of robotic control and we are discussing the choices. Our context makes java almost the only possibility, but we are afraid to start with rosjava and be left aside from the ros community and the ros future enhancements…", "Hello,", "\nWe have found ROS Java capable of handling our use cases in general. However, if we were to start over I think the team would go with C++. The ability to leverage our legacy Java code saved time but the difficulties in understanding how to integrate with ROS Java offset that benefit. The primary issue was lack of documentation, but there were a couple bugs in the source code which were also identified. While ROS Java is still actively updated, the documentation and support for C++ is far greater by comparison.", "\nClean System Shutdown", "Launching ROS Java Nodes:", "No action lib support (as far as I know)", "Service calls are not blocking and have a multi-threading bug", "Default gradle build requires internet connection for pulling down a build script", "Documentation for installing compiled binaries on external systems wasn’t clear to us", "rosjava does not properly sync with std_msgs set which can limit the rosbag api", "I have acquired quite a bit of knowledge on workarounds for rosjava and would be happy to answer more detailed questions, but can’t promise I’ll be able to respond right away.", "rosjava does not properly sync with std_msgs set which can limit the rosbag api", "A bit of a plug but I wrote a primitive and ugly script that attempts to embed msg definitions in ", "s after they have been recorded. For the limited time I was required to use ", " this allowed me to still use ", ".", "Surely one of many implementations of something similar, but: ", ".", "Edit:", "No action lib support (as far as I know)", "Not sure what the status of it is, but I came across ", " while looking into that.", "Thanks a lot for your detailed answer. This helps a lot on the decision process.", "One more thing:", "No action lib support (as far as I know)", "What do you mean by that?", "The rosjava message generator cannot handle .action files as defined here", "\n", "This library is pretty common among ros packages which is why I mentioned it.", "we use a forked actionlib support library: ", "\nbut it was somewhat clumsy to use (and still is)", ".actions get actually transformed in distinct .msg files so the generator is able to generate the corresponding messages.", "\nexample MoveBaseActions:  ", "\nMaybe it took changes from our rosjava forks.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Rosjava can be used “as is” in a real project. I’m using it myself in a project where roscpp and rospy are not an option, and it does its job. The documentation in the wiki should be good enough to get started, and I offer myself to help to improve it if necessary.", "\nIt has some issues as you can see in its public repository, but its currently under active maintenance: if you find something that is wrong, or want to contribute a new feature, you will get a response within a short time lapse.", "I don’t have an accurate answer about its performance; it will probably depend on what you want to do. What is your application about? My short answer would be that you shouldn’t have problems with it (see next item).", "You can write native nodes and execute them from a java application if you want; Rosjava kinetic has support for that. I’ve tried it and it can be done. You can take a look here: ", ". (The link is under Android, but it can be done for pure java). Then, nodes can communicate through topics as usual in ROS. From the java side of the application, all the nodes have the same interface, so you don’t care if the node’s implementation is in Java or in native code when you execute it (does this answer your question?).", "TF2 messages are included in rosjava messages (here’s the Maven artifact: ", ").", "ROS Java generates two executables which can confuse roslaunch/rosrun. The extra executable can be deleted to get around this issue", "(Problem was similar to this) ", "\n", "rosbags can still be played back just not fully controlled using the client api’s", "Gradle build system is fast and easy to use", "Unit testing and connecting a debugger to unit tests is easy with gradle", "Catkin/CMake integration is straight forward", "API Is pretty straightforward and pub/sub is fully interoperable with C++/Python nodes", "There is support for integration tests written in Java", "(Problem was similar to this) ", "\n"], "url": "https://discourse.ros.org/t/is-rosjava-worth-using-when-not-using-android/1967"},
{"title": "Android support for API >= 26 (8, 8.1 and 9)", "thread_contents": ["Hi everyone!", "The current codebase for ", " does not get along very well with the latest Android APIs. I noticed some users were struggling a bit to get ROS running in Android Oreo as some questions popped up in ROS Answers. Furthermore, since November 2018 the apps released to the app store (or even updates to existing apps) will need to target API >= 26.", "I’ve already sent a draft PR to ", " and ", " with some changes that should make the codebase compatible with API 28.", "There are some downsides:", "If you have any suggestions or ideas regarding this please let me know!", "I would go as far as min API 19 or 21/22, devices with a lower API are basically inexistent.", "I finally managed to merge all the required changes into Kinetic branch, together with PRs to ", " and other related repositories.", "The PR with the Maven artifacts is open but not yet merged ", ". Please feel free to try it out and open new issues if necessary; I’ll try to tackle them as soon as I can. Bloom release is also pending.", "Cheers, and happy new year!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Making the codebase backwards compatible all the way down to API 10 and 15 as it is now is becoming a headache. My suggestion is to rise the minimum API version to 16, and merge ", " and ", " packages in a single package, namely ", ". I really don’t think anyone is running a ROS application in an Android 15 phone by now, considering the ", "; please let me know otherwise.", "Android build tools 26+ doesn’t have the ", " command, which was used by ", " to create Android projects from the command line. The current standard AFAIK is creating an app from Android Studio directly. See ", " for more details. A python script can be created in the future and make use of some templates if necessary."], "url": "https://discourse.ros.org/t/android-support-for-api-26-8-8-1-and-9/6037"},
{"title": "Announcing Java and Android for ROS2", "thread_contents": ["Sorry for crossposting, but I thought you folks might be interested in this.", "Hey,", "I just made public a set of Java and Android bindings for ROS2, I wrote", "\nthem a while ago, but they needed some updates and never had made a", "\nproper release of them before.", "Anyway, I’ve pushed it all to GitHub, they are licensed as Apache 2.0. You can follow the instructions", "\non [1] if you’d like to try out the examples.", "There’s a few caveats (it wouldn’t be a ROS project if the word “caveat” weren’t in the announcement):", "In the following days I’ll polish a few things and also put up a demo, but meanwhile you can use all this to write ROS2 applications that can run on an Android device, on a PC with the JRE and communicate with other applications written in Python or C++.", "All kinds of feedback are more than welcome!", "Enjoy ", "1 - ", "This is awesome ", "! I want to test it as soon as I get a chance.", "Thank again ", "I have lots of questions:", "I propose my help.", "Thank again ", "Thank you for trying it out and for your feedback ", "rcljava applications can use Gradle as a build system, so adding tests is", "\nsimilar to any other Gradle project. However, rcljava would benefit a lot", "\nfrom a specialized Gradle plug-in, so Gradle files for rcljava applications", "\ncould be much more streamlined.", "As for rcljava itself, tests need to be integrated with CMake though,", "\nbecause rcljava itself does not use Gradle.", "Yes! However that requires some thought as to how to integrate services", "\ndirectly with rcl instead of replicating the code from rclcpp.", "Not sure I understand what you mean. That part of the infrastructure", "\nbelongs in ROS2 itself, not in the language-specific bindings. Could you", "\nexpand this a bit?", "Much like services, support for parameters need to exist first in rcl, and", "\nthen implemented in the client libraries. Services are already available in", "\nrcl, but unfortunately parameters aren’t yet.", "Dynamic reconfiguration is not implemented in ROS2 yet.", "I propose my help.", "Great! What would you like to work on? My first thought would be refining", "\nwhat’s already in rcljava (build system, tests, etc.), before implementing", "\nany new features (e.g. services), but if there’s anything else you’d like", "\nto work on, just let me know.", "Thanks!", "I have started in my github to complete your implementation :", "with:", "I propose to you to make a clean Merge Request of JavaDoc and Testing.", "For the launch case :", "\nNothing was define in ROS2 design page, but by experience of ROS1 if i make a xxxxxx.laucnh file and java is special.", "\nIn your implentation you need to :", "\neg. ", "\nI would like to know if is possible to generate a simple script for shortcut the launch.", "\neg. talker_java.sh (or without exention)", "Sorry for the slow response, been travelling lately.", "I have started in my github to complete your implementation :- ", " ", "This is impressive, thank you so much!", "ros2_java is an independent project, as such, the copyright ownership is not under OSRF’s name. This is fairly common with other packages, like rosjava, whose copyright is owned by Google.", "I’ll reply with more detail in the pull requests you have submitted on GitHub.", "For the launch case :Nothing was define in ROS2 design page, but by experience of ROS1 if i make a xxxxxx.laucnh file and java is ", " your implentation you need to :eg. java -cp install_isolated/rosidl_generator_java/share/rosidl_generator_java/java/rosidl_generator_java.jar: … I would like to know if is possible to generate a simple script for shortcut the ", ". talker_java.sh (or without exention)", "I think that’d be a bit complicated, because the JAR files may be installed anywhere and the script couldn’t know that. But if you find a way to generate such script, I’d love to add it to ros2_java", "Thanks!", "(crossposting from the ROS SIG NG)", "A few updates to this. No demo yet, but here’s a few changes since the last time:", "If you use this somehow, let me know if there’s anything that you’d like to see in future releases.", "Enjoy!", "1 - ", "\n2 - ", "\n3 - ", "\n4 - ", "\n5 - ", "\n6 - ", "\n7 - ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Not all of the API is implemented, things like QoS profiles are missing for example.", "Domains are not supported, I stil lhave pending implementing a mechanism for setting the domain id programmatically.", "No support for services or intraprocess communication.", "Lack of documentation and tests", "How to add & run tests (JUnit or with other testing framework) ?", "Do you plan to add service support ?", "Do you plan to add launch support ?", "Do you plan to add parameter/dynamic-reconfiguration support ?", "How to add & run tests (JUnit or with other testing framework) ?", "Do you plan to add service support ?", "Do you plan to add launch support ?", "Do you plan to add parameter/dynamic-reconfiguration support ?", "JavaDoc", "Header file (but i see you push-it in your last commit why not use OSRF ?)", "QoS profile", "Testing (but I need to add on gradle)", "Java Service (need to add on JNI call)", "Java Parameter (need rcl finished by core team)", "Header file (but i see you push-it in your last commit why not use OSRF ?)", "Lots of cleanups (and I mean lots)", "Support for client and services, you can find examples in [1]", "Added a few simple tests. The hardest part was getting the", "\ninfrastructure in place, I expect to add more tests now that it’s much", "\neasier.", "Yet another update to the Android PR to FastRTPS [2]", "A Gradle plugin that works with both Java and Android projects [3].", "\nCompare for example the new build.gradle files [4][5] to the previous", "\nones [6][7]"], "url": "https://discourse.ros.org/t/announcing-java-and-android-for-ros2/445"},
{"title": "Mavros in RosJava", "thread_contents": ["Hi!", "I’m starting learning ROS, because I have bought a drone and I want", "\nto programme it. My purpose is to develop a simple interface with Java,", "\nwhere I can send instructions to the drone (arm, takeoff, change flight", "\nmode,…) and I’ve read that I should use the MAVLink protocol to", "\ncommunicate with it. Reading in the forums, I think that I should", "\nuse mavros. Can someone give me some orientation about how to do it in Java?", "I’ve seen a few tutorials of talker/listeners, but all of them with C++ or Python.", "Thank you so much for everything!", "Hi ", ",", "\nYou have ", " and you could receive the messages there. We approached this problem a while ago and we decided that the best solution was to cross-compile mavros for android using the ", ". We bumped into a few problems, the main one being that the environment doesn’t fully support C++11 so we got stucked there.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/mavros-in-rosjava/662"},
{"title": "New rqt plugin to create, manage and arrange tf frames", "thread_contents": ["Dear ros-users,", "I am happy to announce that our rqt-plugin „frame_editor“ just went public.", "Clone it, test it, fork it and let me know what you think.", "rqt_frame_editor_plugin - An rqt plugin for creating, manipulating and managing tf frames.", "The current version works with “kinetic” and above (due to qt5 dependencies).", "\nIf you want to use “indigo” or below let me know and I will create a tag in the commit history for you.", "Lorenz", "Very nice.", "May I be the first to ask for an Indigo tag?", "You are not the first one by 5min!", "xD", "ok ok ok, I did it. I named the branches to indigo-devel and kinetic-devel", "\nI haven’t expected so many people still on indigo…", "\nBut I am very happy about your interest! Thanks", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Its purpose is to create, manage and arrange tf-frames.", "It is highly bundled with rviz and was just VERY handy for us in the past.", "Using this tool it’s literally just one click e.g. to change the parent-frame", "\nwithout changing the global position or e.g. aligning two frames positions but", "\nkeeping their orientation."], "url": "https://discourse.ros.org/t/new-rqt-plugin-to-create-manage-and-arrange-tf-frames/880"},
{"title": "ROS - Android examples in Kinetic", "thread_contents": ["Hi all", "Anyone know whether any simple android application example code available,", "\nwhich are compatible with  ROS Kinetic and can build using latest Android studio.?", "Regards", "\nLentin Joseph", "Hi Josepth,", "I don’t think there is anything rosjava working for Kinetic at the moment, and building with the current version of Android Studio requires that you be very careful to use an old version of Gradle and the Android Gradle plug-in.", "It so happens though that I am very interested in initiating a push to get rosjava released for Kinetic, as soon as I can get Daniel or anyone else who knows better to give us some hints on what would be the work involved.", "If you or anyone else is interested in contributing to make this happen that would be great, it would allow this to be on everyone’s hands faster.", "Best,", "\nJulian", "Hi Julian", "What I feel is ROS - Android interface is very useful for robots which are running android OS.", "I would like to contribute something on this project to make the project great again.", "Please let me know how i can do any contribution, i am good in ROS but not very good in android programming.", "I also want to know whether, i can develop app in ROS - Indigo and work with ROS Kinetic. I have seen some ", " which is even work in kinetic.", "Also, i would like to say, i have build android core in Kinetic successfully, but i am not able install APK because its showing parser error.", "I will try it on Indigo and i hope it will work fine in Indigo.", "Regards", "\nLentin Joseph", "That is great to hear! I also feel the same way you do: ROS Android is very important and needs to be made better / updated / more accessible.", "I will make it a point to post any migration progress here so that you or anyone else who wants to contribute can take part if you want.", "Also, any information you find with your experiments (what works, what is currently failing and how) will be useful so please feel free to post here. Even questions and requests for help are useful.", "Best,", "\nJulian", "Hi Julian", "I could fix the parse error using", ". The basic issue was, the default android target version was 10 on android_core packages. If we change into 20 or higher, it will work smoothly.", "We can do this using APK editor app.", "We don’t need this app, if we change the target sdk in android_core settting and build.", "Thanks for your comments, Keep in touch", "\nRegards", "\nLentin Joseph", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-android-examples-in-kinetic/954"},
{"title": "Help wanted for rclcs", "thread_contents": ["I’m starting this topic because I could need some help polishing / keeping up to date with the rest of ROS2 my C# wrapper for ROS2. ( ", " )  As you might have noticed I couldn’t put that much time into the rclcs in the last two months.", "\nAlso I think it’s nice to have public place to see what work needs to be done in future.", "Furthermore I would like to know if there is any interest in merging any other language wrappers than the already implemented cpp and python wrappers into the mainline ROS2 development? Is there any list of requirements for client libs ?", "Next I’m listing the main workitems that should be addressed next:", "I had a little chat with ", " where we discussed how to port the rclcs to use his ament extension for msbuild projects ( ", " ). This is one of the next things I trying do implement.", "Next thing I’m working on is the refactoring of the message generator ( ", " ) I decided to create my own generator using C# instead of using the template engine because C# already has a code generation API (codedom or for .net core the roselyn code synthesizer). With the refactoring all types of messages will be supported.", "A point where I’m currently stuck with is the windows support. I’m not sure whether it’s due to my code or a bug in fastRtps. If someone with more experience in development on windows could have look at this I would be really happy.", "\nAlso see the last two post in ( ", " ) where we discussed how to implement different code paths for different operating systems.", "The last big thing that needs a lot of work is implementing / supporting unit tests. I already tried a bit with the NUnit testing framework here ( ", " ) But that’s still really hacky.", "All minor stuff that needs to be done is documented in the readme ( ", " ) which I’m trying to keep up to date.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/help-wanted-for-rclcs/961"},
{"title": "Kinetic release process ongoing", "thread_contents": ["Hi all,", "I just wanted to let you know that Daniel and myself are now actively working on preparing a rosjava Kinetic release.", "If you want to contribute, please let us know, any help would be kindly appreciated.", "Also, if there are any updates that you want to make sure get in or important sticking points to be addressed, this may be a good time to bring it up.", "Thanks!", "\nJulian", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/kinetic-release-process-ongoing/969"},
{"title": "Upcoming change on branching strategy", "thread_contents": ["Hi all,", "TL;DR: From now on, please try to develop only against the ", " (or ", ") branches in the rosjava repositories.", "As part of the update to kinetic, in an attempt to reduce confusion and given the currently low amount of updates going into rosjava, we’re going to change how we handle branches.", "\nFrom now forward, we’re only going to keep the release-named branches (", ", ", ", ", ", etc.). We’re effectively going to stop using ", " and ", ".", "My goal is to incorporate any changes currently sitting on master or indigo-devel into the current kinetic branch. I will be doing that over the next few days (or weeks) (as always, any help is appreciated).", "If you see any issue with this change, please chime in, the earlier the better.", "Thanks,", "\nJulian", "Just to chime in with some extra information - we envisage this is probably the last release of rosjava. If it becomes apparent that we really need a constant ‘master/devel’ to reference or if we need to it will go back in.", "Scenarios for which this might happen.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["we do actually plan for a new distro release of rosjava", "if we need to make available an api breaking branch", "need a constant reference (e.g. url’s) to somewhere in the rosjava repositories"], "url": "https://discourse.ros.org/t/upcoming-change-on-branching-strategy/1009"},
{"title": "Android Things", "thread_contents": ["Has anyone tried running on Android Things?", "We’ve been using rosjava on android mainly on phones and tablets and also integrating native ROS code. It will be interesting to test this new framework and see how the existing ROS ecosystem can be adapted to run on it.", "We have used rosjava based applications on the Inforce 6410 board. This was before this Android Things initiative, but I image there won’t be any major difference.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/android-things/1188"},
{"title": "New rosjava-based application: Tango Streamer", "thread_contents": ["Hi all,", "In case you missed it in the general board, ", " an interesting application using rosjava in Android to publish Google Tango topics through ROS.", "Besides what is noted in the general announcement, this new application uses rosjava to implement a node interface which can be re-used into other rosjava applications. Since the source code for the application is also provided, this can serve as yet another example on how to integrate Java and native ROS code into an Android application.", "I hope people will find it useful. We’re looking forward to comments from the community.", "Julian", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/new-rosjava-based-application-tango-streamer/1224"},
{"title": "Move to the Projects Category", "thread_contents": [", ", "Should we move this to a subcategory of the ROS Projects category? This would be in line with the ROS Project category’s ", " and help minimise the front page.", "If anywhere, I’d suggest moving rosjava as a subcategory of the Client Libraries.", "We talked about it in ", " but never go around to moving it.  Does anyone strongly object to this?", "I’m in favor of the move.", "Client Libraries sounds fine.", "Ok, this is now a subcategory of Client Libraries. I think all followers etc shall work correctly.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/move-to-the-projects-category/1225"},
{"title": "Vector of Publishers of Different Types ROS 2 rclcpp", "thread_contents": ["Is there a way of creating a vector or some other C++ container of template publishers of different types? I would like, if possible, to have a vector of publishers, a vector of subscribers, and a vector of services etc. for each node and then be able to add new ones as needed, even if they use different messages. Is there some sort of template magic or something that would allow me to create such containers to organize my code or do the different types make that impractical?", "I can’t tell you if this is the best way, but ", " way, is to use ", ".", "Another way is to use the message type ", ", see e.g. ", ".", "That appears to be for ROS1, the issue ", " bought up seems unique to ROS2 requiring templated publishers if I’m understanding correctly.", "Is there a way of creating a vector or some other C++ container of template publishers of different types?", "No, unfortunately not. However you can store a vector of their base classes, which is exactly what we do when keeping track of them:", "However, this is only useful if you want to only call functions which exist in the base class’s API later, as you cannot safely recast them to their typed derived class. So it depends on what you want to do with them that decides if this is useful or not. For example, if you just want to store them to keep them in scope, this can be useful, but if you want to do something like call ", " on them later, you would need to use something like a ", " and the ", " functions, which requires C++17.", "Right, I read the title/tag a little too fast…", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["std::vector<rclcpp::SubscriptionBase::WeakPtr> subscription_ptrs_;", "std::vector<rclcpp::TimerBase::WeakPtr> timer_ptrs_;", "std::vector<rclcpp::ServiceBase::WeakPtr> service_ptrs_;", "std::vector<rclcpp::ClientBase::WeakPtr> client_ptrs_;", "std::vector<rclcpp::Waitable::WeakPtr> waitable_ptrs_;"], "url": "https://discourse.ros.org/t/vector-of-publishers-of-different-types-ros-2-rclcpp/11497"},
{"title": "ROS2 client library for Julialang", "thread_contents": ["Hi", "I’m wondering if there are any attempts for a ROS2 client library for ", "? I very much like the concepts of Julia and would like to use it in my robotics applications. With ", " there exist nice package for the robotics community but without ROS2 support I can’t really make use of it as I have to integrate new algorithms in an existing environment.", "I do not have any knowledge about such package, but I would be very interested to contribute.", "I was thinking of implementing one myself, but with my current schedule it’s almost impossible. This does not mean that I won’t do so in the future.", "I will keep you updated, and please keep me updated too.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros2-client-library-for-julialang/11858"},
{"title": "ROS client library for the Go programming language (Golang)", "thread_contents": ["Hello, some weeks ago i published an open source ROS client library for the Go programming language, written in pure Go and without external dependencies:", "ROS client library for the Go programming language - aler9/goroslib", "In my company we use ROS in a lot of fields, from robotics to image processing, but the deployment is sometimes difficult, since:", "Go is one of the languages of choice when writing microservices and containerized applications, and there are already a couple of ROS implementations for Go, but they have some problems:", "Some months ago i decided to rewrite everything by scratch, and this library is the result. It should have all the base features (topics, services, messages) and it is already powering some nodes in production-grade environments.", "ROS2 support is currently missing, but i hope to find time and reasons to start working on it too.", "this is great work!!!", "Go is one of the languages of choice when writing microservices and containerized applications, and there are already a couple of ROS implementations for Go, but they have some problems:", "…", "ROS2 support is currently missing, but i hope to find time and reasons to start working on it too.", "Would be cool to have a ROS2 client lib written in pure Go.", "Nice job! I’ve been using go for 3 years. Go is solid on type, error handling and application deployment. Hope this project goes well and I’m very willing to make contributions!", "Nice work! ROS2 support would be great too. We have been using Go for robotics for several years at my work. We have not used ROS yet, but are now planning to start using ROS2. It would be great to be able to continue to use a lot of our existing Go code when we move to ROS2. We maybe able to contribute to this effort.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["the standard library is very big, and therefore uploads can take much time", "the standard build chain makes very difficult the generation of static executables", "the standard library forces to choose between C++ and Python", "rosgo (", ") is unmaintained", "rclgo (", ") is a wrapper around a C++ library, a non-ideal situation", "rosgo (", ") is unmaintained", "rclgo (", ") is a wrapper around a C++ library, a non-ideal situation"], "url": "https://discourse.ros.org/t/ros-client-library-for-the-go-programming-language-golang/12792"},
{"title": "About the Client Libraries category", "thread_contents": ["This category is for discussing topics on everything related to ROS client libraries.", "Use this category for announcements, discussions, planning, organizing meetings and sharing design ideas and projects related to libraries used for writing ROS applications such as roscpp and rospy.", "Questions on specific usage or problems should go to ROS Answers: ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/about-the-client-libraries-category/455"}
{"title": "Getting the list of published services in rosjava node", "thread_contents": ["Hi,", "I am new to rosjava. I am trying to create a rosjava node, which should periodically get the list of all services published at the roscore. I want something similar to the “rosservice list”, but as an API. The scenario for which this is required is: The roscore will be executing independently, there are some ros-cpp nodes which are up and have published their services, the rosjava node when it gets started, needs to know the list of all services which have been published so far and the publishers of the same.", "Please help.", "I think this might be the kind of thing you’d want to ask on ", " . This discourse site serves the same purpose as the mailing list, a format for linear discussion and announcements like most forums. ", " has the best format for asking and answering questions like a stack exchange site.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/getting-the-list-of-published-services-in-rosjava-node/116"},
{"title": "How to handle node shutdown in java code?", "thread_contents": ["I am trying to work out how to gracefully shutdown my node, without ctrl C. I assume that  “rosnode kill” should close down the node, but it doesn’t. I have the code below in my node but it is never called. Though when I run “rosnode kill” I do see in the log this “Shutdown requested by /rosnode with message “user request””.", "So how should shutdwon be handled in the code?", "public class PCTControl extends AbstractNodeMain {", "\n…", "\n", "\npublic void onShutdown(Node node) {", "\n// TODO Auto-generated method stub", "\nfinal Log log = node.getLog();", "\n", "(“onShutdown called.”);", "\nsuper.onShutdown(node);", "\n}", "\n}", "This forum is new, and somewhat unfamiliar to most of us.", "But, I would suggest that this question can be more effectively resolved using ", ".", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/how-to-handle-node-shutdown-in-java-code/128"},
{"title": "Cannot import custom messages", "thread_contents": ["I started programming an Android App for our robot. Therefore, I wanted to import some custom messages from our other C++ packages.", "I successfully set up the Android Studio with ", ", it even builds and runs on my phone.", "However, I tried to import a custom message package, that I generated beforehand with ", ". For that, I added in the build.gradle dependencies ", " and in the source file ", ", but if I build the project with Android Studio, it cannot find ", ".", "If I remove the ", " statement, it doesn’t complain, so I guess the ", " command works fine, but it cannot import the package for some reasons.", "I also checked the ROS_MAVEN_PATH which is ", " where all the rosjava artifacts actually are.", "Did I miss something? How else can I add custom messages to an ROS Android Studio project?", "Hi Sam,", "\nI am not sure I can fully understand your set-up. What is your catkin workspace layout? Do you have the Android cv_bridge package in the same catkin workspace as the custom message package or in a separate one?", "\nWhen you say you generated the messages beforehand with ", ", how exactly did you do that?", "\nThe artifact resolution from Android Studio si very simple, it will look for the artifact inside the maven repositories, which you can tell easily by the directory and file names. Did you check inside ", " to see if the custom messages are there and with the right name?", "\nI hope this helps bring more clarity.", "\nBest,", "\nJulian", "Hi Julian", "My setup looks like this:", " : with all the C++ and msgs packages", "\nthan I have the ", " package inside the git directory, I don’t think it needs to be in the workspace, because I build with Android Studio, what works without custom messages.", "I generated the rosjava artifacts by running ", " inside ", "The custom message ", " file exists, the path looks like that:", "\n", "\nI just tried to decompile the locomotion_controller_msgs-0.0.1.jar and there seems to be no class inside and the ", " file is only 437 bytes. If I do the same with e.g. std_msgs-0.5.9.jar I get a whole bunch of classes. Perhaps there is something wrong with my rosjava artifacts generation? What other ways than ", " are there for my setup?", "So the reason was, that I build my catkin_ws with ", " rather than ", ", obviously this has a bad effect on ", " for some mysterious reasons. Is this issue known? Is there a solution for that or do I have to live with that?", "All things that work with catkin_make but not in catkin build should be raised at the catkin_tools issue tracker: ", "I opend an issue ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/cannot-import-custom-messages/150"},
{"title": "How to set publisher queue size", "thread_contents": ["In the ", " there is a setQueueLimit method to set the size of the message queue.", "However, in the code this method is not actually available.", "How can this method be made available? Or how can the queue size be set?", "Regards,", "\nRupert", "Hi Rupert,", "Please ask questions about the API on ", " It’s a much better format for finding answers than a discussion forum.", "For clarity you can see the the ", " which tries to explain the differentiation.", "Tully", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/how-to-set-publisher-queue-size/193"},
{"title": "Android SDK Version Compatibility", "thread_contents": ["Dear ROSJava-Users,", "do you have experience with newest Android SDK Versions and rosjava?", "One of our students developed an app for sending ROS Nav Goals to AMCL on a TurtleBot. It was developed for his phone running Android SDK 4.0.3 and it also runs on Android SDK 4.1.2. Unfortunately it has problems on an Nexus 5 with Android SDK 6.0.1.", "Maybe, someone has some tips about things, that changed between these SDK-Versions, that are relevant for rosjava? For example, we recognized a parallelisation problem related to the “lifecycle” of our app and the times when different methods of the app are called. As a result the roscore was not running, when the first subscribers were initialised. I think we fixed that, but still have problems with receiving messages on the phone.", "We are using our own costum multi-master solution, which is simple based on a udp-proxy node. The proxy receives local ROS-Messages and forwards them over a multicast udp socket. All other udp-proxy nodes in the network receive the udp messages and inject them to their local ROS system. Therefore these udp-proxy software exists in Java (on the phone) and C++ (on the turtlebot-laptop), both autogenerated.", "The app is available here: ", "\nThe udp-proxy generator is available here: ", "Kind regards,", "\nStephan", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/android-sdk-version-compatibility/208"},
{"title": "New forum for rosjava", "thread_contents": ["Hi Everyone,", "There have been several threads on ROS-Users looking for ways to improve our communications. There have been requests for topics on the mailing list as well as the archives are not browsable or searchable.", "After reviewing many options and talking to other projects we have found that Discourse seems to be a good mechaism for facilitating dicussions within open source communities.", "We have setup ", " for the ROS community.  However now we have an empty forum with no users and no experience administering it.", "From learning about other projects migration experiences, it is usually a good idea to start with a subgroup of the community and slowly migrate existing services over. It’s easier to coordinate and learn at the small scale and those lessons can then be transferred to new members as more and more topics get converted to the new forum.", "Unfortunately some group has to be the first adopter and I’m asking that you, the ros-sig-java, be the first group. Ernesto has recently become more involved in rosjava and is hoping to build up some momentum and I hope you will be interested enough to join the conversations he’s already started and will be continuing to instigate. And at the same time try out the new forum.", "For a migration path we have already setup fowarding from ", " to ", ", which is likely how you got this message,  and expect to make the mailing list read only soon to “encourage” people to switch to the new forum.", "Please take a few minutes to checkout the discourse server and provide any feedback.", "Tully", "Testing how a reply is handled by the system.", "As I ", " (which got several +1s btw), I love to see this kind of improvements!", "Allow me for a couple of questions (hoping this thread could serve as a meta discussion, irrelevant from rosjava…):", "Is there any discussion log for this change (that could help the conversation in the same MoveIt! thread etc.)?", "Are we going to customize either welcome message or ", " to include the difference between ", ", or navigate to the ROS support guideline wiki page?", "Hi Isaac,", "Thanks for pointing out the guideline/FAQ I’ve updated it to refer to ", " as well ", ".  Which welcome message are you referring to? I’ve updated the top level pinned message. Everything is editable, we just have to find it in the UI. And as people gain reputation they will be able to edit more too.", "We’ve done a bunch of internal experimentation inside OSRF with a test site enough that we are confident in the technology behind the site. And research with other different projects, including some discussions at the GSoC Mentor Summit this fall suggests that it’s the best solution available.", "It’s unfortunately not really possible to test a new site without actual usage so we’re asking that this group be the trial group and from here we can move forward to other SIGs and eventually to ros-release@ and ros-users@.", "We’re following a similar process to the dronecode-tsc ", "Thanks to those of you who have tried out ", " already. I’ve now transitioned the mailing list to disable direct posting. Please use ", " for future threads.", "Tully", "Sorry, I just started documenting the migration process and found out that I’d not setup the filtering settings right in this post: ", " I hope that new messages outside the watched category no longer go through to the mailing list.", "Which welcome message are you referring to?", "The yellow pop-up on the bottom-right hand side. Looks like a link to the community guideline is already included now.", "So the existing ", " won’t be visible at the top page of ", " unless you either select ", " tab, or click on the pulldown menu at the top? Is there any way to list the categories somewhere on the top page (I see blank space on left and right)? Although I instantly liked this discourse system with its usability and flexibility, it took me 10 minutes to get the idea of ", ", in contrast to the traditional mailinglist concept.", "I tend to agree that it would be nice if the categories were more prominently featured on the landing page. Took me a second to find them too.", "I tried creating a new linked topic at ", " for follow ups to this in the Site Feedback Category.", "You can see it linked to the right of ", "Edit: apparently any topic with a link from the content also gets linked at right of a post.", "A post was merged into an existing topic: ", "Sorry, we updated the email return address and it was not getting through the google groups filters. If you get this it should be fixed now for ros-sig-java.", "I guess someone should replace the pointer on Rosjava sig page so that it points here?", "\n", "I’m relatively new to the ROS community, so I don’t want to go vandalizing pages myself it it’s not appropriate.", "Cheers,", "\nJames", "Added. Thanks for the suggestion!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", "\n", "\n", "\n"], "url": "https://discourse.ros.org/t/new-forum-for-rosjava/18"},
{"title": "Rosjava_extras into a metapackage?", "thread_contents": ["Hi all!", "\nI’m trying out the new Discourse site and I would like to ask your opinion on a particular subject.", "I’m working on a pull request to include the version of actionlib for rosjava that I wrote into the ", " repository and I was thinking if it wouldn’t be better to convert that repository into a ", ". Each contributed library will be included as a stand-alone package. This has some advantages:", "Currently there is only a Hokuyo library so I guess this problem wasn’t so evident.", "\nI would like to hear opinions.", "The rosjava repositories are already using gradle to handle projects and subprojects in exactly the same way as catkin does it for c++ and python repositories.", "When catkinising rosjava, my first naive thought was just to do it the catkin way because that is the way I’m used to. That has two problems - it gets complicated because rosjava isn’t using cmake/catkin directly and also…it’s not the java way. For me it might be easy to follow, but for java coders it is something new/extra they have to learn. We reasoned it was better to let java people do things the java way as much as possible.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["It’s easier to include a new package", "The dependencies are separated and more clear to follow", "Each library can have it’s own independent version number"], "url": "https://discourse.ros.org/t/rosjava-extras-into-a-metapackage/22"},
{"title": "Rosjava survey", "thread_contents": ["This is a reminder that the survey is still accepting responses. We are planning on closing it by the end of this week.", "We wish to know the who, what and how of Rosjava users.", "Once we get all the results processed we’ll be sharing them with the community.", "Thanks for your collaboration!", "Many thanks to all the people who took the time to answer this survey! In ", " you can find the final results as well as some conclusions based on the analysis of all the responses. I think we now have a much clearer view of the rosjava community and must work in the pointed direction.", "Regards,", "\nErnesto", "Useful data, thanks for the effort Ernesto.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/rosjava-survey/25"}
]