[
{"title": "Maritime Projects", "thread_contents": ["Thank you to Musa for providing the first post to the interest group.", "Following her lead, I’d encourage anyone to announce projects that might be of interest to this community.", "For example, here are some of the projects we are following:", "If you are working on or using open-source projects that would benefit this group, please let everyone know.", "Brian", "There is also the ", " project that allows combining Gazebo’s physics engine with the rendering of UWSim developed by O. Kermorgant.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", " provides some of their packages via ", ", including auv_msgs and a few maritime specific drivers.", "At NPS we are working towards a ", " simulator to support the RobotX maritime competition.  We recently ran a ", " on using the tools.", "The ", " underwater simulator."], "url": "https://discourse.ros.org/t/maritime-projects/3506"},
{"title": "Hybrid Architectures?", "thread_contents": ["Many manufacturers provide a control interface, such as the RECON interface on the REMUS AUV.  This allows users to add ROS to their AUV. Are any folks here using a hybrid architecture?  Have you developed a ROS node for your COTS AUV?", "Matt,", "\nI’m optimistic that folks have a ROS node for the REMUS and IVER vehicle interfaces.  I’ll send your request to folks that operate these AUVs and see if we can get a single solution.   Seems like a good wheel to avoid reinventing.", "\nBrian", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/hybrid-architectures/3585"},
{"title": "USV Simulator", "thread_contents": ["We are working on an unmanned surface vessel (USV) simulation to support the ", ".  We just did a one-day tutorial on the prototype simulation environment.  If you are interested:", "This is an active project, so we welcome pull requests and collaborators.", "There are a lot of great maritime projects out there.  I’m hopeful people will announce new projects and share them with the community.", "Brian", " Hi, bsb808. I am a member of OUXT polaris, Japanese RobotX team.", "\nWe are developing gazebo based wam-v simulation package in open source.(", ")", "\nPlease tell me your repository url.", "\nThank you!!", "There are a few packages listed in the…", "wiki link above.  For Kinetic, the repositories are at…", "\n", "\n", "\n", "\n", "We are working on getting a WAM-V visual and dynamic model into Gazebo.  That should be coming soon, so if you’d like to contribute to that effort, please let me know.", "Thank you!!", "\nWe have alrdady built a simple wam-v urdf.", "\nIt has no bumpers,springs…", "\nYou are building models with bumpers and springs??", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", "\nBased on the Clearpath Kingfisher model, but we are working on building a model of the MAR WAM-V", "\n", " for ROS beginners that uses the simulated USV as a case study"], "url": "https://discourse.ros.org/t/usv-simulator/3509"},
{"title": "Beta Release of RobotX USV Simulation", "thread_contents": ["All,", "NPS and OSRF are happy to announce that we are doing an early beta release of the Gazebo/ROS RobotX USV simulation environment. We are still working on many parts of this (and welcome any contributions!), but the current simulation includes…", "All of the code is of course open source. The source, along with documentation and tutorials is available at ", "This is an open source project, so we welcome the feedback and contributions from the community - submit a pull request today!", "Brian Bingham and Carlos Aguero", "Wow, this is a very cool project. Simulator like this had been in my wishlist for a long time.", "I have followed RobotX for a while but didn’t get a chance to compete. I finally settled down on an autonomous sailing boat project and had a lot fun with that. Like many other robot project, we test it, break it, and repair it again and again. We found it was really hard to design and implement a physic-based simulator for a sailing boat. Changing wind, wave and tide are difficult to model in gazebo. Now three year past, we had a fortune to earn some titles in the competition and we also learnt a lot. The idea of a simulator comes to my head again especially when I see this nice work.", "I wonder how much effort it might take to implement a sailing boat model in gazebo? Does it make sense to include a sailing platform in your simulator?", "You might get in touch with researchers from PUCRS in Brazil who have been working on a disaster robotics project.  ", "I can’t seem to find the code repository at the moment.", "Brian", "tsaoyu and Brian,", "The repository is ", ".", "\nThe sailboat is functional, although we are still organizing and cleaning up the repo.", "\nIn few months we will ‘launch’ the simulator but you are free to try it.", "Talk with Marcelo Paravisi ", " to help you select the branch with the sailboat. I guess it is not in the master branch yet.", "Alexandre", "Alex and Brain,", "Thanks for pointing out this project! It looks impressive.", "\nI will follow this project and if there is any problem please bear my abrupt email to your colleagues.", "Cheers,", "\nYu", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Visual and collision models of the base WAM-V USV platform", "Gazebo plugins to simulate simple hydrodynamics, waves, wind and propulsion", "A world definition roughly similar to the coastline at Sand Island, HI (the RobotX 2018 venue)."], "url": "https://discourse.ros.org/t/beta-release-of-robotx-usv-simulation/4073"},
{"title": "Plume simulation package", "thread_contents": ["Hi everyone,", "as part of the ", ", a plume simulation ROS package has been developed to allow the generation of particles of a passive turbulent plume in simulation. This package can be used with or without the UUV simulator package in case it is necessary for other purposes (it only necessary to change the source of the current velocity simulation). The package is available on GitHub at", "and a small tutorial on how to start a plume and how to build a particle concentration sensor on a simulated vehicle in Gazebo is available here", "This package is still under development but it has been successfully used in the scope of the project. Suggestions, contributions and bug reports are mostly welcome ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/plume-simulation-package/5272"},
{"title": "Light Autonomous Underwater Vehicle (LAUV) model for Gazebo", "thread_contents": ["Hi everyone,", "a package for simulation of the ", " in Gazebo using the UUV Simulator package has been released in GitHub:", "Sensor modules are being added to the main model, but it can already be downloaded. Tutorials will soon be published on the package’s ", ".", "As always, suggestions, contributions and bug reports are very welcome.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/light-autonomous-underwater-vehicle-lauv-model-for-gazebo/5281"},
{"title": "BTS 2018 workshop: adoption of conventions in the underwater ROS community", "thread_contents": ["As we announced in this ", ", the Computer Vision and Robotics Research Institute of the University of Girona is organizing a meeting inside the “", "” workshop to discuss the adoption of conventions in the underwater ROS community.", "The Robot Operative System (ROS) has become a de facto standard for robot programming. The underwater community is also following this trend and adopting it as its main middleware.", "Till now, each institution/organization has developed its own solutions to deal with the particularities of the underwater domain. This represents a waste of efforts that not only hinders the cooperation among different organizations but ultimately slows down the progress of the underwater community using the ROS ecosystem.", "In view of that, we would like to take profit of the ​ BTS event, which brings together a significant part of the marine community, to organize a workshop and gather ROS users in underwater systems. The main aim of the meeting is to discuss the adoption of conventions that can help the growth of the underwater ROS community.", "On the technical side, we will put the focus on the definition of standard messages for common underwater sensors/actuators and the review of available underwater simulation tools. We would like also to promote the networking aspect of the meeting and try to establish a group to keep up with the ideas that will emerge from the workshop as well as to get to know other initiatives that are around.", "If you are working with ROS in an underwater context, you sure have something to say and we would like to have you on board! You can check out the BTS main program and register as soon as possible, there are many other interesting things going on that week. Registration prices include lodging and meals for all week.", "\nIf you plan to attend the underwater ROS meeting please fill also ", "If you cannot attend but you would still like to send us a comment and/or to be informed about the outcome of the meeting after its conclusion you can fill in your contact data in the same ", ".", "We hope to have a successful event with everybody’s collaboration!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Workshop date: Tuesday 2nd of October (14:30-18:30)", "Place: Biograd na Moru, Croatia.", "BTS Registration: ​ ", " ​ - Contact us if you are interested to get an early bird discount.", "Underwater ROS meeting confirmation: ​ ", "\n"], "url": "https://discourse.ros.org/t/bts-2018-workshop-adoption-of-conventions-in-the-underwater-ros-community/5389"},
{"title": "Announcing Release 0.2.0 of the Virtual Maritime Robotics Challenge Simulation", "thread_contents": ["We are happy to announce the release of version 0.2.0 of the ", ". The release includes a number of new features that will be of general interest to groups working with unmanned surface vessels and of particular interest to teams participating in the 2018 ", " competition.", "Some of the new features include:", "Improved environmental models for wind and wave environmental forcing", "Configuration examples for commonly used sensors (cameras, 3D LiDAR, etc.)", "Configuration examples for commonly used propulsion designs and user customizable propulsion curves", "Reconfigurable models for competition course elements to allow for building custom courses from buoys, totems, light buoy, docks, placards, etc.", "Gazebo plugins to specify dynamic course elements (light buoy and docking placards)", "Docker support tutorials and downloadable Docker Hub images.", "Expanded tutorials", "Watch a short ", " to get an overview of what features are included.", "The project is still in active development, so feedback and contributions are greatly appreciated.", "Amazing work!! We at The Construct love so much that simulation that we have created a ROSject to train the robot with ", ".", "We are going to do a free Live Class on how to train the RObotX next Tuesday the 5th September 2018 at 18:00 CEST, PROVIDING all the code already RUNNING for the attendants. Find the details here: ", "P.S. I’m Ricardo from The Construct. I really love that simulation so much that I couldn’t resist to take a picture with one of its creators Carlos Aguero, while visiting OSRF last July ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n"], "url": "https://discourse.ros.org/t/announcing-release-0-2-0-of-the-virtual-maritime-robotics-challenge-simulation/5897"},
{"title": "Regional Robotics Sailing Winter Academy at Zhejiang University", "thread_contents": ["Sailing robots are autonomous surface vehicles (ASV) that use wind power as the only propulsion source. The robot can sailing on the sea on a much longer duration compared to the battery-powered counterpart and potentially could serve as a platform for the long-term ocean observation. In order to help teams get start with robotics sailing, we are organising a two days winter academy for students and professionals.", "\nThe lecture will be given by Yu Cao (Southampton Sailing Robot Team) and Prof. Chao Xu (Zhejiang University).", "\nDec.15 and 16, 2018 @ Zhejiang University, China // Free of charge", "\nRegistration can be made online via ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Introduction on robotics sailing – history and the challenges", "The physics on sailing craft", "Hardware and software structure of an autonomous sailing robot", "Software tutorials on the basics of ROS, python and git version control", "Sailing robot path planning and lower level control", "Sailing demonstration given by ZMART team (subject to weather condition)"], "url": "https://discourse.ros.org/t/regional-robotics-sailing-winter-academy-at-zhejiang-university/6980"},
{"title": "Underwater ROS Workshop @ Woods Hole Oceanographic Institution", "thread_contents": ["\n", "\n", "\n", "\nRobot Operating System or ROS is rapidly becoming the de-facto standard in robotics middleware in academic circles.  However, ROS is only now making significant in-roads into the Unmanned Underwater Vehicle (UUV) world among the less research oriented and more operational groups.  There appears to be a rapidly growing critical mass that could allow for the formation of an underwater ROS community.  This workshop will explore ways in which that community may be formed and nurtured.  Significant questions include:", "\n•\tWho is using ROS underwater and what are they using it for?", "\n•\tWhere people are evaluating ROS for underwater what is missing that would ease the decision?", "\n•\tHow is the underwater environment unique for ROS and what should we do about it?", "\n•\tWhat are the high priority applications or tools that would ease adoption?", "\n•\tWhat community structures can we set up to drive towards a common interface for UUVs?  Can we drive towards a ROS/UUV working group?", "\n•\tHow can we enable the transfer of code between groups and into industry?", "\n•\tIf you are developing code for ROS, what stops you from releasing it?", "\n•\tWhat will be the future of ROS in the DoD world?  – optional depending on attendees", "\n•\tWhat can we learn from and leverage from the ROS-I effort without going fully down that path?", "\n", "\n•\tSpur growth and adoption of a robust ROS ecosystem for underwater robotics", "\n•\tEncourage engagement between the existing UUV and ROS communities", "\n•\tAddress roadblocks to adopting common interfaces", "\n•\tAddress long term code sharing and hosting possibilities", "\n•\tAddress the need for better underwater simulation environments both real time and fast time", "\n", "\nThis two day workshop will feature Jonathan Bohren as a key note speaker.  He will discuss previous successes and failures in forming ROS communities.  There will be lightning talk sessions for all interested participants, a variety of focused talks, and breakout sessions aimed at answering the questions and achieving the goals.", "\n", "\nFor questions, please e-mail ros-workshop-registration@whoi.edu  To register please visit - ", " Registration is free but space is limited so please make every effort to register by September 1, 2018.  All participants are invited to give a lightning presentation and may submit a request for a longer full talk if interested.", "This sounds awesome - really looking forward to attending.", "Is there a chance or possibility that this will be webcast or at least recorded?", "There isn’t any current plan to do so.  However, if there is a strong desire for that, we can investigate the possibility.", "I would be very much interested in a recording being made available.", "I would argue strongly for it — there is a strong maritime ROS community in Europe that could benefit greatly from getting some materials remotely.", "I’ve registered to attend. Are details available on where/when?", "The slides from all presenters who agreed to share are now live and can be found at: ", "We hope to post a workshop report and some follow up actions soon.", "Thank you to everyone who participated!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/underwater-ros-workshop-woods-hole-oceanographic-institution/5197"},
{"title": "BTS Workshop: Adoption of Conventions in the Underwater ROS Community - A Summary", "thread_contents": ["The 2nd of October we held a workshop inside Breaking The Surface conference on the ", ". Almost thirty attendants from 16 different organizations participated in it. For all those who could not participate, but that are interested in the topics that were discussed, we present here a short summary of what we talked about.", "The workshop had the following structure:", "The discussion focused especially on the standardization of low-level messages that are specific to the marine environment, and also on the need for simulators and various tools.", "Messages", "Simulators:", "Tools:", "Safety:", "We agreed to create a public repository where we can start defining the proposed messages. Once there is agreement on the messages we will decide whether to add them to any existing package (e.g., sensor_msgs, nav_msgs, …) or whether to create one or more new packages.", "This same discussion repository can be used to create some safety guidelines: what a checklist should include, which dangerous situations can be detected automatically and how they can be handled…", "This package has been created at: ", " We encourage everybody to check it and add their comments, issues, pull requests, … We need as much feedback as possible to make it complete, generic and useful for the community.", "Thank you!", "Great work! Are any of the participants planning to attend the upcoming ROS underwater workshop at Woods Hole? With a very similar agenda, I would hope that such efforts are coordinated.", "Thank you!", "\nI will attend the workshop at WHOI and try to present the results in one of the lightning talks.", "Narcis, I know this is a little late, but after seeing the conventions discussion on GitHub, I wanted to comment/ask:", "There are a lot of other conventions for other domains and specific implementations, but there aren’t a lot of definitive works on the overarching data model and specific conceptual data models that represent each ‘message’. See, e.g. [1], which is itself rather lacking in details.", "The point is that by starting at the conceptual data model level, we could say “these are the details required to communicate concept X”, and then have something specific for ROS (or ROS2, if needed) that provides rules on how the conceptual data model is mapped into a specific message-specification format. The payoff is that you can change the way you map the CDM to the LDM, and be kind of ready for a whole new messaging system. You could even write adapters that convert from one to the other (LDM) realtime, auto-generating adapters between middlewares.", "Should we (we == ROS/ROS maritime people) be thinking at this level? Or is there really not any interest from the academic/start-up side? From big corporate entities I think there is interest, especially when it comes to interoperable defense stuff.", "T.", "[1] IEEE 1872-2015 Standard Ontologies for Robotics and Automation", "Interesting reflection Thomas! To be honest, I get a little lost when I talk about ontologies and conceptual data models. I think it’s something we need to keep in mind. However, I think that for our community - which is quite small - it’s probably easier to start with something more specific and then try to generalize a conceptual data model to automatically expand and maintain the specific messages.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Introduction and participants presentation.", "Survey: How do you use ROS underwater and what you miss from it?", "Open discussion (using the survey results as a starting point).", "Conclusions.", "\n", "\n", "Proposal to define new sensor messages for marine related sensors like: DVL, SVS, CTD, modem, USBL, sonars… Consider to put them inside sensor_msgs or in some underwater specific package (e.g. marine_sensor_msgs).", "Proposal to define missing control messages like: Thrust, Waypoint, List of Waypoints, …", "We also talked about other missing messages, that are not only marine related, like: landmark based maps, navigation, vehicle/mission status, etc.", "\n", "\n", "\n", "uuv_simulator looks promising but no participant uses it in their daily routine. Problems defining dynamic parameters and issues between NED (i.e., North East Down standard underwater frame) and ENU (i.e., East North Up, standard Gazebo frame) were commented.", "Problems to simulate perception sensors like sonars, acoustic communications, underwater images were also discussed.", "There is no “generic” solution (i.e., stand alone package) to perform a dynamics simulation with or without Gazebo. Only UUV_Simulator plugin and several custom packages.", "\n", "\n", "\n", "Calibration tools (e.g., TFs, Magnetic Compass, DVL, Controllers …), are missing but will be easier once low level messages are standardized.", "Lots of gateways requested: ROS-MOOS, ROS-DUNE, ROS-MATLAB…", "Mission tools: There are no standard tools to define a mission.", "RViz plugins for marine specific sensors like DVL, Side Scan, Imaging Sonars, … should be done.", "\n", "\n", "\n", "Solutions for checking node status", "Create a list of typical safety errors related to the underwater vehicles to be checked (as a guideline).", "\n"], "url": "https://discourse.ros.org/t/bts-workshop-adoption-of-conventions-in-the-underwater-ros-community-a-summary/6478"},
{"title": "Virtual RobotX Competition", "thread_contents": ["One of the most challenging parts of the RobotX Challenge is that it only rolls around every other year – where you can truly test the limits of your vehicle over the span of only a few days.", "So how do you optimize testing your vehicle throughout the rest of the year? Go VIRTUAL.", "RoboNation has teamed up with the Naval Postgraduate School and Open Robotics to bring you the ", " . Sponsored by the Office of Naval Research (ONR), the VRX competition is an international, university-level effort designed to broaden students’ exposure to autonomy and maritime robotic technologies. We’d like to invite YOU and your team to participate in this competition!", "In the VRX competition, student teams will operate their vehicle in a Gazebo-based simulation environment. Students will be tasked to develop innovative solutions to ensure their virtual Unmanned Surface Vehicle (USV) can perform prescribed tasks in this environment.", "Robotic teams from around the world are encouraged to apply for the VRX competition. As part of the application process, teams will provide information on their past history in robotic competitions and the impact they hope to achieve by competing in VRX. Student teams will be notified of their acceptance on April 15. To compete, accepted teams will be required to submit a registration and a $300 USD registration fee.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/virtual-robotx-competition/8487"},
{"title": "UUV Simulator - Unmanned Underwater Vehicle Simulator", "thread_contents": ["Hi everyone,", "I just would like to create a topic for a project released on GitHub on November 2016 called ", ", mainly aimed to simulate unmanned underwater vehicles such as AUVs and ROVs. It includes Gazebo plugins and several ROS nodes and it is built modularly to help the construction of complex simulation environments for underwater vehicles.", "\nThe project has been going through a lot of updates and changes thanks to several suggestions from the community and it has grown significantly since we managed to publish it on GitHub.", "\nRecently I added an improved ", " (still being updated) and some extra packages for robot models and some useful ROS nodes, such as a plume simulation, that are also available here ", ".", "Any suggestions or criticisms are very welcome. ", "Hi Musa.", "\nIt’s me, Marco.", "\nFrom Salvador. BIR", "\nWhen will go back to Brazil?", "Marco", "Musa - thank you for the links.", "\nWe just created a SIG for ", ".  Hopefully this will be a place we can collect some of these tools.", "Thanks for the great work!", "\nBrian", "Hi Brian, that’s great! I just changed the category of the topic. Thanks for the information! ", "Hi! I’m using your UUV Simulator for my MS Thesis with the subject “Localization of an unmanned underwater vehicle using multiple water surface robots, multilateration, and sensor data fusion”.", "In a first approach i will develop an algorithm verification on UUV Simulator and for that reason i’am developing an “Acoustic Channel Communication” that consists in two sensors: a Beacon and a Hydrophone. I hope to help and contribute to this great project.", "So, i’m grateful for your work! ", "Hi from Houston Mechatronics,", "Would like to throw out there that we’ve been using UUV sim for awhile now and so far have really liked it. Our only issues have been there’s no debian(that’s now been remedied, thanks ", ") and our PR’s seem to get a bit stale when we have a proposed fix, so we are forced to maintain a fork for extended periods of time. Other than that though we have had a good experience using it and really appreciate the work ", " has done to get it where it is today. If there’s anything we can do to help with the package let us know and we will do our best. We rely heavily on uuv_simulator for our simulations and would really like to help it progress.", "Jordan", "  - Glad to hear others are using this great tool.  Based on the discussion at the recent ", " it seems like there is an increasing desire from the community for building more functionality on top of the UUV Sim.  Would Houston Mechatronics be willing to contribute to open-source projects that improve/extend the general capability?", "In general I think yes(though i’m in no position to officially state this, i’m just a peon ", " ), we try as much as possible to never fork and/or build from source if a binary version of a third party dependency is available. Additionally if we have an open source third party dependency we regularly submit pull requests for features/bug fixes we have in order to continue use of the binary and not add a source dependency.", "We have submitted a number of pull requests for features and bug fixes to UUV Simulator and have a number of others in our local fork that we would like to submit back upstream so we could remove our source dependency and start using the new debian. Our only hesitation is that our pull requests don’t get much attention, and this is a deterrent to us spending the time to organize a pull request if it’s going to sit there for extended periods of time.", "Hello,", "I’m wondering if the uuv simulator is good to go with ROS melodic? I did see a commit from December presumably for making it compatible with melodic, but I did not see instructions for it in the documentation and was wondering if anyone else has or is using it with melodic.", "Thanks~", "Hey guys, thank you for the amazing feedback. I am currently working on other projects as well, but I am doing my best to keep the repository running.", "\nHopefully I will get back into schedule soon.", "\n", "Hey I was wondering if you ever released code for your acoustic beacon and hydrophone simulations in gazebo", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/uuv-simulator-unmanned-underwater-vehicle-simulator/3500"},
{"title": "Common message structures for UUVs?", "thread_contents": ["Hi everyone,", "following the discussion started by ", " in this proposal to include DVL messages to the sensor_msgs package (", "), I would like to ask if there are other implementations of ROS  message/service structures out there of typical sensors for maritime robotics.", "\nAt the beginning of the implementation of our simulation environment it was a little difficult finding a standard (or any standard) in that matter, and in the end we ended up setting our own, but that becomes an issue later on regarding compatibility and portability. It could also be the case that I was uninformed about something that already exists, but until now couldn’t find nothing really close to a common ground.", "\nI think starting to converge to a structure that can be used by several projects, as ", " suggested , would help avoid every single new project setting up the messages and services all over again.", "Hi ", ", I think that most of the sensor related messages that the underwater community uses are covered by the ", " package except for very specific ones like the DVL, the Side Scan Sonar or the USBL.", "I don’t know any other standard repository specific for underwater sensors, but I think that if we have to define only few new messages, we can add them directly in the ", " package.", "For me, the most prioritary messages are the DVL and the Side Scan Sonar. For the Multibeam we can always use a LaserScan msg. Which messages you think we should start with?", "Hi ", ", both DVL and side scan sonar messages could be proposed to the common_msgs repository if we find some examples.", "\nYou mentioned for DVL these links below, but it would be good to know what is used to narrow down to one solution.", "The first example (", ") is a very specific DVL message for an RDI DVL while the second (", ") for me is more generic. The only problem that I see with the second is that most of DVL sensors can provide measurements wrt. sea bottom or/and wrt. water. However, changing the   ", " or publishing two topics (one for bottom and another for water measurements) will be enough.", "We could start the discussion using the  (", ")  as a base.  For the Side Scan Sonar, and example can be found at ", ".", "I disagree that common messages have us well-covered.  The UAV community is going through a broader discussion to drive towards a common ROS API.  Perhaps something similar here is appropriate?  Especially given the sudden spike in interest for maritime robotics.  There are enough unique sensors for a UUV-specific sensors package.", "The existing LaserScan message is a start, but it would help to have beam widths.  Most multibeams offer both equiangular and equidistant spacing, and LaserScan (like most laser scanners) only supports equiangular spacing.  Some larger multibeams also do real-time yaw compensation that results in non-coplanar beams.  Sure, we could use a pointcloud, but most existing multibeam post-processing software assumes a constant number of beams with a quality indicator.  Launch angles are helpful if you ever want to re-raytrace your data.", "\nAnd that’s just for bathymetric multibeams.  An R-Theta image would be really handy for imaging multibeams (BlueView P900, Kongsberg M3, etc).", "The vehicle I am currently helping to transition to ROS will require messages for: DVL, depth, subbottom profiler, two different sidescans, multibeam imaging sonar, multibeam swath sonar, inertial navigation system, one- and two-way travel-time measurement, USBL fixes, CTD, sound velocity, and a generic scalar water-column measurement (ph, oxidation reduction potential, fluorescence, dissolved oxygen, optical backscatter, whatever the instrument guys down the hall gin up next month).  Some of those can re-use existing messages, but there’s enough there to propose a UUV-specific sensors package.  That’s just us.  Other teams will need bathymetric side-scan, scanning imaging sonars, and tons more even before adding unique situations like in-situ mass spectrometry, custom sampling gear, etc that should be handled in their own packages.", "Hi ", ", regarding your question, there is already and ros package for underwater robotics: ", " . If you think this maybe be helpful, we are happy to discuss ways to improve the current package to fit everyone’s needs.", "Hi ", ". I agree that there are plenty of messages that can be defined for the underwater robotics community. However, defining messages is the tip of the iceberg! For instance, I agree that a better multibeam message could be defined, however, to see the multibeam data in reat time using a laserscan message is already done but if a new message is defined this functionality must be reimplemented. What I want to say is that maybe, and only maybe, a good solution can be to add the very basic messages in the ", " package as soos as possible, and have a deeper discussion about all the rest. We are also interested in most of the message that you propose. I put a list of them and our current implementacion FYI:", "Hi ", ", I had found the auv_msgs back then, but I understood that they were to be used on a higher level for the vehicles, not on the sensor level, or did I miss something there?", "Hi ", ", do you know how the UAV community is planning to implement their solutions for a common ROS API? It wouldn’t be a bad idea to learn from them in that aspect.", "The discussion seems to be centered around a discussion thread: ", "Many common UAV messages are already available in the std_msgs package, so it looks like effort has focused on developing REPs (105, then 147) to codify best-practices.", "This discussion is showing that ROS is less mature for underwater vehicles-- which makes sense, that thread is older than the marine robotics SIG!  Presumably some combination of REPs and AUV-specific message standardization is required.  Some code development for rviz plugins and/or common drivers would really help drive adoption.", "I’m just concerned that if ROS adopts a few messages without broader community involvement we’ll continue a lot of very isolated development.  We just wrote yet another RDI DVL parser because none of the existing messages-- including the one proposed-- meets our needs.  We’re at least the second group well-suited to being long-term maintainers of such a package to do that in the last 18 months.", "Maybe we should try to identify a venue for an underwater robotics ROS workshop?  A lot of the new stakeholders are new to open-source software, not just ROS.  Many of them don’t even comment on the mailing list.", "I think a workshop is a great idea. Like you said, if just a few people contribute their implementations the problem isn’t going to be solved. Maybe it would be possible to organize a workshop in some of the upcoming robotics conference/events?", "Hi, well the auv_msgs was indeed to be used on a higher level, but we can consider if it is possible to expand the functionality. I don’t know what other people think but it might be a good idea to have everything in one message package? or maybe not, but it might be worth discussing the possibility at least.", "\nIf you want we can open an Issue in the ", " page and take if from there.", "Some upcoming events that come to mind:", "I don’t know how it could work to organize something like a workshop alongside any of these events (I think in Breaking the Surface it can be still proposed to organize a workshop session), if there is an interest from more people an workshop, it could still be done. All these events will happen from October to December of 2018.", "Our team (Universitat de Girona) use to participate/collaborate in Breaking the Surface. I can ask for a workshop session there if you want.", "Sorry for the late reply. I think that would be a great idea. I don’t know anymore if I can attend, but would be worth trying to organize something.", "Today we have send a workshop proposal for the next Breaking The Surface workshop. The idea is to have a  session there in which we can start discussing at least which messages should be included in a underwater or marine sensor_msgs like package. If possible we will create a first draft to be later discussed online.", "Is there any update about this topic?", "\nExpanding the discussion, do you know any ROS standard format for AIS (automatic identification system) msg?", "\nThank you in advance.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["DVL (custom)", "depth (sensor_msgs/FluidPressure)", "Sidescan Sonar (custom)", "Multibeam Sonar (sensor_msgs/laser scan)", "inertial navigation system (sensor_msgs/IMU + nav_msgs/Odometry + …)", "One- and two-way travel-time measurement (custom)", "USBL fixes (geometry_msgs/PoseWithCovarianceStamped)", "CTD (custom)", "sound velocity (custom)", "water-column measurement (custom)", "Battery System (sensor_msgs/BatteryState)", "Cameras (sensor_msgs/CameraInfo)", "GPS (sensor_msgs/NavSatFix)", "…", "IROS 2018 - Madrid", "ROSCon 2018 - Madrid (?) - I think it is not confirmed yet", "Breaking the Surface - Biograd na Moru, Croatia", "Maritime RobotX - Hawaii, US"], "url": "https://discourse.ros.org/t/common-message-structures-for-uuvs/3737"},
{"title": "Common message structure for USV navigation", "thread_contents": ["Hi, I am Masaya Kataoka and I am a software developer of OUXT Polaris.", "\n(", ")", "\nI am developing fully autonomous sufrface/underwater vehicle for maritime and virtual RobotX Challenge.", "\nOur software is fully open-source and anyone can use it.", "\nIn order to make a lot of useful ROS packages for UUV navigation, I want to make common message structure for USV navigation.", "In my opinion, message structure for UUV navigation should be a little different from grounded robots.", "\nI think there is no accurate navigation when the UUV sail on the sea.", "\nBut, when we try docking task autonomously, we have to navigate them very precisely.", "\nIn order to realize  this feature, I want to add pose tolerance field to the waypoint message field.", "From this point of view, I designed uav_navigation_msgs like below.", "uav_navigation_msgs/Waypoint", "uav_navigation_msgs/Waypoint describes single target pose of the USV.", "uav_navigation_msgs/Path", "uav_navigation_msgs/Path is a array of waypoints.", "\nIt describes single series of waypoints.", "I want to build usv navigation system like below.", "\n", "common message structure for USV navigation OUXT Polaris Masaya Kataoka", "\n", "Hi Masaya,", "Are you aware of the auv msgs package?", "Standard messages used with Autonomous Underwater Vehicles - oceansystemslab/auv_msgs", "Maybe it will work for you, or if you have any suggestions you are welcome to discuss different possibilities.", " Great!!", "\nI did not aware of auv_msgs.", "\nHowever, I am now designing unmanned surface vehicle, not underwater vehicle.", "I am also developing unmanned underwater vehicle, so when I design auv navigation system, I will conrtibute auv_msgs.", "I found that the USV cannot control altitude and pitch/roll angle", "\nSo, it is unnecessary to set torelance in Vector3 format.", "So, I designed usv navigation msg like this.", "Contribute to OUXT-Polaris/usv_navigation_msgs development by creating an account on GitHub.", "I found that the USV cannot control altitude and pitch/roll angle", "\nSo, it is unnecessary to set torelance in Vector3 format.", "In general I recommend using the full dimensional generic messages even if your current vehicle does not have the capability to execute it a future evolution of that vehicle might be able to achieve the goals.", "We do the same thing with ground vehicles and send a full 3D pose. Most cannot achieve any vertical change, so they ignore anything out of the plane when controlling and do their best to achieve the goals ignoring the z elements. However, when interacting with other elements that do support 3D motion such as grippers or a robot with a telescoping torso it is useful information. If you define different datatypes for each subcategory of mobility types you will end up with a lot of duplicated code and libraries will be locked into one vehicle type when that’s usually not necessary.", "It may also be worth considering the altitude as being relative to ", ". Depending on draft, this may be critical for obstacle avoidance. Pitch and roll angles may be useful to understand system stability.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/common-message-structure-for-usv-navigation/9547"},
{"title": "UUV Simulator - Call for Maintainers", "thread_contents": ["Hello everyone,", "I put a call for maintainers for the UUV Simulator project on the project’s repository on GitHub. If you have any interest, please check the GitHub issue for more information ", "Hello everyone,\nas you might have noticed, I haven't had time to take care of the this project as before. To give...", "I really appreciate that you are actively looking for maintainers instead of just quietly abandoning a project. I talked to someone working on OpenROV the other day and they mentioned that they are starting to dip their toes into ROS. I can’t promise anything but I will reach out to them and see if maybe they might be interested.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/uuv-simulator-call-for-maintainers/11811"},
{"title": "About the Maritime Robotics category", "thread_contents": ["This category has been setup to provide a forum for groups and individuals using ROS for robotic applications under and at the water surface. Some distinct issues associated with maritime applications include integration of maritime specific sensors (e.g., Doppler velocity logs, multibeam sonar, etc.), intermittent communication and navigation, the influence of buoyancy and hydrodynamics on mobile platforms and the influence of the underwater/near-surface environment on perception.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/about-the-maritime-robotics-category/3492"}
]