[
{"title": "Build Difficulties with ARIAC Simulator Package", "thread_contents": ["Hello! The wiki doesn’t appear to be publicly accessible, so I thought I’d ask if anyone has any tips for building or installing the ARIAC sim on Kinetic + Ubuntu 16.04.", "The installation instructions suggest either installing binaries or building from source, but not seeing any reference to where those binaries are I opted to build from source. I cloned the bitbucket repo into my catkin ws and ran catkin_make. Initially I ran into an issue with a protobuf version mismatch between my protoc and the Gazebo apt package, but I was able to fix that by recompiling the Gazebo protobuf files. Now I’m getting:", "Etc, etc, for several hundred lines. It looks like a missing include, but I can’t divine what it’s looking for or where it should be.", "Any help with either building ARIAC or installing the binaries would be very much appreciated.", "Edit: It occurs to me now that I look at this that my recompiling the protoc files seems a likely culprit. Tensorflow demands a specific protobuf version - so specific it’s a commit on the 3.0 branch and not even a tagged release. I assume I’ll need to build Gazebo from source if I can’t get the binaries.", "Thanks,", "Yes, it was the protobuf mismatch. Installing protobuf 2.6 over 3.0 fixed the compilation issues.", "Happy to hear that you fixed it! Can you post the exact fix (i.e., how you installed protobuf 2.6) for the benefit of others who get into the same situation?", "Absolutely. The apt package on ubuntu for protobuf is 2.6, so it’s very straightforward to install. After that ARIAC built from source with no issues. I just need to keep tensorflow and Gazebo separate from one another.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Ross"], "url": "https://discourse.ros.org/t/build-difficulties-with-ariac-simulator-package/780"},
{"title": "Rosrun can't find osrf_gear on kinetic, Ubuntu 16.04", "thread_contents": ["I get the following error attempting to run per the instructions on the wiki:", "I have build osrf_gear from source. Here is the output of ", " after I source the ", " file in my ariac workspace cloned from bitbucket:", " finds osrf_gear.", "Hints as to why ", " can’t seem to find the osrf_gear package?", "catkin_find --share osrf_gear", "Hi Daniel,", "Can you post the output of ", "?", "How did you build our software? It looks like you’re using a “devel space” (see ", "). You might try installing and using the install space, as that’s what I did most of my testing with. If there is an issue with the devel space we should fix it, but using the install space might be a good workaround in the meantime.", "Yep. I was using the development space. I installed using ", " and its finding ", " now.", "Thanks!", "Cool, I’ll open an issue to track the devel space problem:", "See: https://discourse.ros.org/t/rosrun-cant-find-osrf-gear-on-kinetic-ubuntu-16-04/1026/4\n\nUsing the install space resolved the issue.", "Also, I’d recommend using a local install location, i.e. simply don’t specify ", " and it will default to a folder called ", " next to the ", " and ", " folders.", "I don’t recommend installing to ", ", but you can if you know what you’re doing ", ".", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/rosrun-cant-find-osrf-gear-on-kinetic-ubuntu-16-04/1026"},
{"title": "Break_beam sensor not publishing on named topic", "thread_contents": ["I am running from the ariac binary package on ROS Indigo and getting familiar with the environment.  I added two break_beam sensors to the conveyor belt, however both sensors publish on the /ariac/break_beam topic instead of the documented /ariac/{name} dedicated topic for each sensor.  It is usable that way for a single sensor, but with multiple sensors publishing on the same topic it is not.  The logical_camera sensors work as expected with a named topic for each camera.  It doesn’t look like the bitbucket repository has issue tracking enabled, so I am posting here.  Also, any idea when the first qualifier will be posted?", "That sounds like a bug to me, I’ve created an issue for this:", "See: https://discourse.ros.org/t/break-beam-sensor-not-publishing-on-named-topic/1057\n\nThis effectively prevents you from using more than one break beam sensor at a time since they would all publish to the same topic.\n\nI suppose that may have...", "I’ll see about getting the issue tracker opened up too. I’m not certain about the schedule (so I won’t guess), but someone else may be able to comment about that.", "Thank you for creating the issue in my behalf and getting issues opened up for public access.", "Hi Michael,", "\nThis issue should be fixed now and you should see the unique topic names for break bream sensors once you update your ARIAC software, either with ", " or pulling from master if you are building from source. Thank you for pointing it out.", "Regarding the first qualifier, it will be posted on the 27th Jan 2017: see ", " for registration details.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/break-beam-sensor-not-publishing-on-named-topic/1057"},
{"title": "Error launching gazebo with custom config/comp_config.yaml", "thread_contents": ["Hi,", "I am customizing the .yaml file inside config folder. Here my config file:", "I only want to have one camera or at least 2 and the arm for now but I am having problems launching gazebo.", "This is what I am having:", "However, if I uncomment the laser_profiler sensor lines, gazebo launches correctly.", "Is there a minimum number of sensors in config file or it is necessary to set the laser_profiler?", "Regards", "It would seem Gazebo can’t load ", " successfully, as it can’t resolve a symbol (", ").", "It could be that the library that is used for the ", " sensors provides that symbol, which is why it works in the case where you keep those enabled.", "Sounds like we’re forgetting to link a library into ", " ", ".", "Thank you for pointing this out ", " - there is no minimum number of sensors in the config file, and it is not necessary to use the laser profiler.", " and ", " are right and this was a bug. It has been fixed now: you should see the change once you update your ARIAC software, either with ", " or pulling from master if you are building from source.", "Thank you all works perfect!", "Regards", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/error-launching-gazebo-with-custom-config-comp-config-yaml/1238"},
{"title": "Read arm links pose (ariac competition)", "thread_contents": ["Can I read the topic “/gazebo/link_states” or it is against the rules ?", "\nWhat is this topic msg type ?", "thanks", "Hi ", ",", "It is against the rules to use the ", " topic during the competition (you can use it during development of your package if you find it useful). It is against the rules to use any of the topics or services in the ", " namespace prefix during the competition. You should use the topics listed in the ", " instead.", "\nThank you for your question – I have updated the documentation to clarify that this is not permitted.", "What is this topic msg type ?", "In general, you can find the msg type of a topic by running ", ", for example:", "I hope that this helps.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/read-arm-links-pose-ariac-competition/1347"},
{"title": "Performance.log is overwritten", "thread_contents": ["Just a query, but the performance.log is a link to another text file in gazebo:", "/home/user/.gazebo/server-11345/default.log", "So technically I’m not sure the tutorial documents are correct when you copy over this file. The gazebo logs are fine though", "Hi ", ", the symbolic link from the performance.log file to the target that you mentioned is the expected behaviour. We have clarified in the submission instructions that the ", " / ", " option should be used when copying the logs to ensure that the link is followed – thank you for the question.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/performance-log-is-overwritten/1371"},
{"title": "ARIAC Qual Task 2", "thread_contents": ["Hi,", "Any news on when the next task will be released?", "Regards", "Cdr.", "We’re targeting the Qual 2 release for Monday, March 6th.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ariac-qual-task-2/1412"},
{"title": "Part placement", "thread_contents": ["I’m curious at the correct process on getting the position to place the part on either tray for qual1.", "From my understanding you can use tf to get the current pose from the world frame", "Now I assumed I could simply offset the trans using the supplied values in the order, i.e", "However for the position offset:", "The arm can not find a goal state using moveit, it seems to be out of reach, is this designed that way. I’ve just gone about shortening the position in the end to be within in reach.", "To be honest I had a look at the parts tutorial and the figures seem to point to different placements then where I achieve at the moment anyway.", "Hi ", ",", "The positions specified in the order should be reachable by the arm. The issue might be that you are using the wrong reference frame (the TF frame of the kit tray is not necessarily the same as the ", " - you can use the logical camera to get the kit tray TF frame).", "Alternatively the issue might be with how you are calculating the pose in the world frame. When calculating the goal pose in the world frame you must take the orientation of the tray into account so that you move “in the right direction”. You can use the ", " method of a ", " object to transform a pose from one frame into the world frame.", "Keep in mind that the pose of the parts on the tray is not evaluated for the first qualifier, they just need to be anywhere on the tray.", "By the way, it looks like you are using the python interface to the deprecated ", " library. If this is working for you then that’s fine, but ARIAC does use ", ". If you run into any issues (e.g. ", ") then you may consider switching to ", ". We’ve updated the documentation to clarify this.", "Thanks dhood,", "Yes I was using the agv frame, however this begs the question why do you need a camera to find the kit tray frame in the first place?", "It costs points to use a camera, whats to stop anyone from simply adding a camera, getting the trays offset to the agv frame and hard coding the necessary transform, and then removing the camera later? of course i assume this is possible :).", "The pose was calculated as per last post using lookup transform frame = ‘agv1_load_point_frame’", "I’ll upgrade to TF2, thanks for the tip.", "Yes I was using the agv frame, however this begs the question why do you need a camera to find the kit tray frame in the first place?", "That’s a valid question – the distinction is not very clear in the first qualifier. The AGV frame specifies the point in the workcell where trays will be when the AGV is docked, but AGVs may or may not be there. In qual1 the AGVs don’t move, but in future tasks, the AGVs will move, and so the sensors can be used to detect when the AGV has returned with a new kit tray.", "The pose was calculated as per last post using lookup transform frame = ‘agv1_load_point_frame’", "The pose I was referring to is the one that specifies where to move the arm to, i.e. what you do once you have looked up the pose of the AGV frame. This is where the ", " method can come in handy.", "Hi dhood,", "Thought I would quickly say thanks for putting in the pull request example for the TF2 transformation.", "Onwards to Qual2 now :).", "Cdr", "Hey, no problem! We’re looking to add it as a general TF2 tutorial but I’m glad that you found it in the meantime. Thanks for the message.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/part-placement/1361"},
{"title": "Error occured when I roslaunch ur10 moveit", "thread_contents": ["ERROR: cannot launch node of type [moveit_ros_move_group/move_group]: moveit_ros_move_group", "\nROS path [0]=/opt/ros/indigo/share/ros", "\nROS path [1]=/home/ccsu/ariac_ws/src", "\nROS path [2]=/opt/ros/indigo/share", "\nROS path [3]=/opt/ros/indigo/stacks", "Before I launched file, I always setup.bash", "Hi ", ", it seems like you do not have the right moveit dependencies installed. The moveit dependencies do not get installed by default with ", ". Step 2 of ", " should help you install the necessary dependencies (and build the ur10 moveit packages that are specific to ARIAC, if you haven’t already done so). Please be sure to select the indigo tab at the top of the page.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/error-occured-when-i-roslaunch-ur10-moveit/1569"},
{"title": "Unable to run sample HelloWorld code", "thread_contents": ["Hi,", "\nI just started the ARIAC challenge. I was trying to follow the tutorial. I can successfully run all the tutorial steps except the HelloWorld code. When i run the code, Gazebo starts with black screen only. What am I doing wrong here?", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/unable-to-run-sample-helloworld-code/1806"},
{"title": "Need team member?", "thread_contents": ["Hi,", "\nIf anyone need team member, I can join. I don’t have much idea about ROS. But tried all the documents and tutorials. Looking forward for some partners.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/need-team-member/1818"},
{"title": "Real Time Factor going really low", "thread_contents": ["My simulation is going lagging at some points. If I check the real time factor presented by Gazebo, it goes as low as 0.32.", "Is that expected? I have an i7-6700 CPU, 16GB RAM, and a GTX 1070 but still does not seem to be enough. I understand that the ODE physics engine underneath Gazebo does not make use of a GPU, like bullet3.", "However, why the suddenly drop in performance? Why does it not go back to 0.99 or 1.0 even when the experiment is over?", "[Start of the simulation]", "\nFactor[1.00] SimTime[6.17] RealTime[7.81] Paused[F]", "\nFactor[1.00] SimTime[6.38] RealTime[8.01] Paused[F]", "\nFactor[1.00] SimTime[6.58] RealTime[8.21] Paused[F]", "\nFactor[1.00] SimTime[6.78] RealTime[8.41] Paused[F]", "\nFactor[1.00] SimTime[6.98] RealTime[8.61] Paused[F]", "\nFactor[1.00] SimTime[7.18] RealTime[8.81] Paused[F]", "\n…", "\n[At one of the points where if goes lagging]", "\nFactor[0.46] SimTime[121.83] RealTime[154.42] Paused[F]", "\nFactor[0.48] SimTime[121.93] RealTime[154.62] Paused[F]", "\nFactor[0.48] SimTime[122.02] RealTime[154.82] Paused[F]", "\nFactor[0.48] SimTime[122.07] RealTime[155.03] Paused[F]", "\nFactor[0.48] SimTime[122.16] RealTime[155.23] Paused[F]", "\nFactor[0.47] SimTime[122.25] RealTime[155.43] Paused[F]", "\nFactor[0.47] SimTime[122.35] RealTime[155.63] Paused[F]", "\nFactor[0.47] SimTime[122.45] RealTime[155.83] Paused[F]", "\nFactor[0.47] SimTime[122.55] RealTime[156.03] Paused[F]", "\nFactor[0.47] SimTime[122.65] RealTime[156.23] Paused[F]", "\nFactor[0.47] SimTime[122.75] RealTime[156.43] Paused[F]", "\n…", "\n[Nothing is moving, competition done]", "\nFactor[0.68] SimTime[298.30] RealTime[436.40] Paused[F]", "\nFactor[0.68] SimTime[298.44] RealTime[436.60] Paused[F]", "\nFactor[0.68] SimTime[298.57] RealTime[436.80] Paused[F]", "\nFactor[0.69] SimTime[298.71] RealTime[437.00] Paused[F]", "\nFactor[0.69] SimTime[298.84] RealTime[437.20] Paused[F]", "\nFactor[0.70] SimTime[298.96] RealTime[437.41] Paused[F]", "\nFactor[0.70] SimTime[299.09] RealTime[437.61] Paused[F]", "Hi ", ", the realtime factor is strongly influenced by the number of parts in the ARIAC environment. This is why different scenarios will have different realtime factors. The RTF doesn’t go back to 1.0 after the trial is over because the models are still in the environment (just not in their original position).", "If you manually move/add/delete any models in the environment the RTF will drop temporarily. If you are experiencing a low RTF temporarily, but then it recovers, this may be the cause.", "If you are just experiencing a low RTF in general, removing unnecessary models from the environment during development will help. We have added the “Improving real-time factor during development” section in the ", " which details how to temporarily disable some models.", "Hope this helps.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/real-time-factor-going-really-low/1875"},
{"title": "For ariac; I cant run catkin_make install because could not find a package configuration provided in gazebo_ros with any of the following names gazebo_rosConfig.cmake and gazebo_ros-config.cmake", "thread_contents": [":~/ariac_ws$ catkin_make install", "\nBase path: /home/netza/ariac_ws", "\nSource space: /home/netza/ariac_ws/src", "\nBuild space: /home/netza/ariac_ws/build", "\nDevel space: /home/netza/ariac_ws/devel", "\nInstall space: /home/netza/ariac_ws/install", "– Using CATKIN_DEVEL_PREFIX: /home/netza/ariac_ws/devel", "\n– Using CMAKE_PREFIX_PATH: /opt/ros/lunar", "\n– This workspace overlays: /opt/ros/lunar", "\n– Using PYTHON_EXECUTABLE: /usr/bin/python", "\n– Using Debian Python package layout", "\n– Using empy: /usr/bin/empy", "\n– Using CATKIN_ENABLE_TESTING: ON", "\n– Call enable_testing()", "\n– Using CATKIN_TEST_RESULTS_DIR: /home/netza/ariac_ws/build/test_results", "\n– Found gtest sources under ‘/usr/src/gtest’: gtests will be built", "\n– Using Python nosetests: /usr/bin/nosetests-2.7", "\n– catkin 0.7.8", "\n– BUILD_SHARED_LIBS is on", "\n– ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~", "\n– ~~  traversing 3 packages in topological order:", "\n– ~~  - osrf_gear", "\n– ~~  - ariac_example", "\n– ~~  - test_ariac", "\n– ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~", "\n– +++ processing catkin package: ‘osrf_gear’", "\n– ==> add_subdirectory(ariac/osrf_gear)", "\nCMake Warning at /opt/ros/lunar/share/catkin/cmake/catkinConfig.cmake:76 (find_package):", "\nCould not find a package configuration file provided by “gazebo_ros” with", "\nany of the following names:", "Add the installation prefix of “gazebo_ros” to CMAKE_PREFIX_PATH or set", "\n\"gazebo_ros_DIR\" to a directory containing one of the above files.  If", "\n\"gazebo_ros\" provides a separate development package or SDK, be sure it has", "\nbeen installed.", "\nCall Stack (most recent call first):", "\nariac/osrf_gear/CMakeLists.txt:8 (find_package)", "– Could not find the required component ‘gazebo_ros’. The following CMake error indicates that you either need to install the package with the same name or change your environment so that it can be found.", "\nCMake Error at /opt/ros/lunar/share/catkin/cmake/catkinConfig.cmake:83 (find_package):", "\nCould not find a package configuration file provided by “gazebo_ros” with", "\nany of the following names:", "Add the installation prefix of “gazebo_ros” to CMAKE_PREFIX_PATH or set", "\n\"gazebo_ros_DIR\" to a directory containing one of the above files.  If", "\n\"gazebo_ros\" provides a separate development package or SDK, be sure it has", "\nbeen installed.", "\nCall Stack (most recent call first):", "\nariac/osrf_gear/CMakeLists.txt:8 (find_package)", "– Configuring incomplete, errors occurred!", "\nSee also “/home/netza/ariac_ws/build/CMakeFiles/CMakeOutput.log”.", "\nSee also “/home/netza/ariac_ws/build/CMakeFiles/CMakeError.log”.", "\nInvoking “cmake” failed", "some one have the same problem and how you solve it ?", "It looks like you don’t have ", " installed, perhaps you missed a step of the installation instructions: ", "I see that you’re using ROS lunar; please note that ARIAC currently supports indigo and kinetic, so if you run into other issues I suggest you try using one of those ROS versions (from binaries will be easiest).", "In the future you can ask technical/troubleshooting questions at ", "Thank you, I have installed both, when I select kinetic is running perfect.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/for-ariac-i-cant-run-catkin-make-install-because-could-not-find-a-package-configuration-provided-in-gazebo-ros-with-any-of-the-following-names-gazebo-rosconfig-cmake-and-gazebo-ros-config-cmake/3593"},
{"title": "Versions of ROS and Gazebo for 2018", "thread_contents": ["What versions of ROS and Gazebo are needed for the 2018 competition?", "Ubuntu Xenial + ROS Kinetic and Gazebo 8 in 2018. In 2017 teams could choose xenial+kinetic or trusty+indigo, but with this year being a prize competition we are requiring all teams to use the same base setup.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/versions-of-ros-and-gazebo-for-2018/3977"},
{"title": "Team member for ARIAC 2018", "thread_contents": ["If somebody wants, I can join their team for ARIAC 2018", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/team-member-for-ariac-2018/3983"},
{"title": "Ending time for qualification runs", "thread_contents": ["What is the ending time for submissions on the qualifying runs?", "Submissions must be uploaded by Midnight PST Monday 19 March", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ending-time-for-qualification-runs/4198"},
{"title": "Ubuntu / ROS Version", "thread_contents": ["Will this run of Ariac be on 18.04 and Melodic?", "Yes, the current plan is Gazebo 9, 18.04 and Melodic.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ubuntu-ros-version/7451"},
{"title": "2018 Source Build Fails", "thread_contents": ["I’m trying to get the 2018 software to run using Ubuntu 18.04 and ROS Melodic as a start toward competing this year. I grabbed the source both for ‘master’ and ‘2018’ (whatever the exact name is) but get the same error:", "There are some other errors where ‘get’ methods are not available like:", "\n", "Is it feasible to run 2018 on my newer system?", " branch will run on bionic/melodic after this pull request is merged. ", "Mind checking if that branch works on your machine?", "It built fine and executed ", ".", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/2018-source-build-fails/7560"},
{"title": "Moveit tutorial for Araic 3", "thread_contents": ["Can we expect a Moveit tutorial and support files soon for the UR10 arms? Tried following 2018 UR10 but clearly there are changes in Melodic that cause problems. Not much luck with generic Moveit tutorials, either.", "I can’t speak for ariac organizer, but assuming updating tutorial is either WIP or hasn’t started yet, reporting specific issues might better help them. It also helps the general community e.g. MoveIt! and/or UR10 users/maintainers, who could also give some hands (e.g. tutorial is probably wiki etc. that accepts contribution (is it right?) so that they (or even you) may provide a fix).", "Valid points and suggestion. The package for Ariac3 was just released on Friday. Up until then I’d been working with the source code, reporting a couple issues when I found them.", "A key part is getting a Moveit configuration for the UR10. In 2017 and early 2018 such they were available for the competition. They won’t work with ROS or Moveit Melodic versions. There isn’t a configuration for 2019, as of yet. Attempts to create one from the UR10 definition files result in an error from the Setup Assistant that they are invalid files. I seem to recall that one of the earlier years they hand-edited an existing configuration rather than using the Assistant.", "My conclusion is creating a configuration is non-trivial task that I’d rather not undertake. If I did, it would take time from other aspects of the competition that I need to address. Since arm control is a key component of Ariac and the most complicated aspect it surely should be a high priority for them to provide competitors with the necessary tutorial, or at least files.", "More specifically, depending on the time frame of the tutorial or files I will can better plan my development activities. Bluntly, I didn’t compete last year because I couldn’t get the arm to work properly. I know I need a lot of work on it. If the ability to use Moveit will be awhile I either need to look at alternatives, or possibly not even bother since I won’t have enough to understand the arm control.", "Linking ", "There’s now a MoveIt tutorial for ARIAC 2019 ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/moveit-tutorial-for-araic-3/8092"},
{"title": "ARIAC code release updates", "thread_contents": ["The software for competing in ARIAC 2018 has been released.", "See ", " for competition documentation, installation instructions, and tutorials for working with the software.", "New ARIAC software release (excerpt from ", "):", "First qualifier has been released (excerpt from ", "):", " Submissions for the first qualifier will be uploaded via secure online workspaces. All registered teams must contact ", " to have their workspace prepared in advance of when they intend to submit. If you are planning a submission for the first qualifier and do not yet have a secure workspace, you must contact ", " immediately or you risk missing the submission deadline.", "After the first qualification task closes the ", " topic will become classified as a cheat.", " The IIWA14 will be used in all future trials; the UR10 will no longer be used. The IIWA14 presents the same ROS interface but ", ". This was announced as an upcoming change on 17 February 2018.", " The workcell environment, particularly the shipping container, shelving and the conveyor belt, has been updated to accommodate the working area of the IIWA14. ", " The dimensions of the shipping boxes, storage bins, and products have not been modified.", "The controller has been updated to avoid an issue with joint 7 getting stuck, and to relax tolerances on the trajectory controller (", ").", "To test out the proposed changes, add the ARIAC pre-release repository with:", "and then run ", ". Your ARIAC version will be updated to 2.1.5, which will become the standard version if no regressions are reported. Please report regressions on the issue linked above.", "When you are finished testing we suggest you remove the ", " added in the above command.", "The software for competing in ARIAC 2019 (", ") has been released!", "Please see ", " for instructions as they have changed, especially if you have installed a prerelease. This version is feature complete. Follow this thread to get notified of future bug fix releases.", "Other links", "The software for competing in ARIAC 2019 (", ") has been released!", "\nPlease see the ", " and ", " for more information.", "This release contains the trial config files for the Qualifier.", "\nPlease see the ", " to learn how qualification works and the ", " to learn how to practice on the Part A trial configs.", "\nQualifier submissions will be accepted until ", ".", "Other links", "The end date of the 14th conflicts with those on the ", " site (", "):", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", " See ", " for how to launch the trials. Summary of new trial config files (more details in the files themselves):\n", "\n", ": high priority order interruption at a “convenient” time.", "\n", ": high priority order interruption at an “inconvenient” time.", "\n", ": order requiring products to be flipped (", ").", "\n", ": order requiring more products than available for use.", "\n", "\n", " See ", " for details.", "\n", " The arm can no longer pass through the support frame around the storage bins. This was advised as an upcoming change on 17 February.", "\n", " In response to the additional workcell collisions, the logical camera range has been reduced.", "\n", " This would happen if the ", " service was called before the simulation had finished loading.", "\n", " See ", " for details.", "\n", " See ", " for how to enable/playback simulation state logging for debug purposes.", "\n", " ", " now covers rules/scoring metrics in addition to software changes.", "\n", " Fixes for the simulation state logging (low RTF during recording, no arm inserted during playback) will be resolved in the next Gazebo release.", "\n", " The ", " product’s yaw is not distinguishable with perception sensors, but its yaw is evaluated by the scoring algorithm. This will be corrected for, either by making the yaw perceivable or by having the scoring algorithm ignore the yaw.", "\n", " In particular, info on the storage bins, quality control sensors, potential products, and potential order count. See ", " for the added details.", "\n", " ", "/competition specifications have been updated to clarify that sensors can only be placed in static locations around the environment, they cannot be attached to the arm.", "\n", " Docker images used for the ", " are currently using gazebo7.7 to avoid state log recording issues, but will be swapped to the next gazebo version when it is released (within the next week).", "\n", " A fix for the simulation state log playback freezing with gazebo8.3 will be resolved in the next Gazebo release. This impacts teams looking to playback state logs from the automated evaluation setup. See ", " for how to install gazebo8.2 as a temporary fix.", "\n", " After the first qualification task closes the ", " service will become classified as a cheat. Teams will need to use sensors to infer the products available in storage bins.", "\n", " In ariac2.0.4, models in the environment of a particular type have sequential IDs. The naming system will be modified so that model IDs are randomized. As a result, logical cameras/quality control sensors will not publish TF frames, which include model IDs, correlated to the number of models in the environment.", "\n", " In ariac2.0.4, the conveyor can be controlled before the competition has been started. This functionality will be removed and must not be exploited by teams.", "\n", " For all future trial config files released (including qual1b), products in the storage bins will no longer have sequential IDs.", "\n", " Fixed misalignment of the vertical bars in the support frame around the storage bins.", "\n", " It is now asymmetric on top and bottom. Pulleys (and all other products) will always start un-flipped in the storage bins.", "\n", " By default the UR10 has joint limits of ", "; there is now an option to use joint limits of ", ", which provides better controller performance ", ". It can be enabled by adding ", " to your team’s config file ", ". Participants that do not wish to enable this option do not need to make any changes to their system. The use of this option is permitted in submissions for the first qualifier.", "\n", " The ", " Docker image used in ", " has been updated to use gazebo8.4 now that the logging issues have been resolved.", "\n", " Teams must have had a secure workspace created by competition controllers before they can upload their submissions for ", ".", "\n", " See ", ". Note that these may change between rounds of the competition.", "\n", " Clarified that only automated evaluation metrics will be used for ", " and that any participants found violating submission guidelines (e.g. by starting the conveyor belt before starting the competition) will not be permitted to qualify for the Finals.", "\n", " ", ", ", ", ", ", ", ", ", " topics/services documentation added/updated in ", ".\n", "Clarified that requesting that the drone deliver any unknown shipment type will cause the drone to remove the box without scoring it.", "\n", "\n", "\n", "\n", "\n", " Re-runs for ", " will be permitted only in the event of simulation bugs such as reported issues ", " and ", ", at the discretion of the competition controllers. Any issues caused by competitors’ code does not warrant a re-run.", "\n", " ", " has been updated to clarify that simulation state logging will be enabled in the first qualifier trials via the ", " setting in the the trial config file. If the config file that you are testing with in the automated evaluation setup does not have logging explicitly enabled ", ", please add that line to the config file to enable logging.", "\n", "\n", "\n", "\n", "\n", " Tutorials involving control of the robot arm have been updated for the switch to the IIWA14.", "\n", " Read/use ", " for practice.", "\n", " Read/use ", " for practice.", "\n", " The config file that was used for evaluating Part B of the first qualifier is in ", ". Congratulations to the teams that qualified for the Finals.", "\n", "\n", "The ", " service and the ", " topic have been re-classified as cheats.", "The quality control sensors now publish anonymized model names instead of the types of the faulty products that are detected. As a side effect, the model numbering scheme has been updated; any randomized faulty product IDs in custom-defined trial configs will need to be updated.", "\n", "\n", " Use of the devel space is now supported for users building from source (contributed by ", ").", "\n", " The ", " now highlights that sample config files are available for practicing with.", "\n", " Read/use ", " for practice. Note that re-connecting to some sensors during development will cause them to resume publishing data, but this functionality is blocked in the automated evaluation setup.", "\n", " This is the break beam positioned at the end of the conveyor belt by default.", "\n", " Service calls to set the conveyor belt power before the competition has been started will fail.", "\n", " The ", " now detail that sensors can be placed in any free space in the workcell, they do ", " need to be mounted such that they are touching the conveyor belt/support frame of the storage bin. Sensors must be used in a realistic manner and must not exploit any simulation technicalities such as the logical camera seeing through obstructions.", "\n", " See ", " for details. Teams that did not participate in the first qualification task, and teams that participated but did not qualify, are still eligible to participate in the second qualification round.", "\n", " ", ", which would occur occasionally for some participants, should now be resolved.", "\n", " The external walls of shipping boxes have been widened to make ", ", where boxes would fall into the conveyor belt, less likely to occur. The internal dimensions of the boxes are unchanged.", "\n", " The ", " have been updated to highlight that Gazebo 8.4 is required to avoid issues with state logging recording/playback. ", "\n", "\n", " ", " has been added, which summarizes the released agility challenges, including additional details on the “sensor blackout” challenge.", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", " The arm simulation model/controller has been updated to avoid an issue with joint 7 getting stuck/causing instability, and to relax tolerances on the trajectory controller (", "). ", "\n", "\n", " The ", " page now clarifies that products must be placed onto the base of the shipping box to be counted for scoring, not on top of other products.", "\n", " Two “pre-release” versions of 2.1.5 were released to users for testing prior to yesterday’s ariac2.1.5 release to improve IIWA14 controller performance: 2.1.5~pre1 and 2.1.5~pre2. The version released yesterday was 2.1.5~pre2; ariac2.1.6 rolls back to 2.1.5~pre1 based on feedback from participants that it provides better arm performance.", "\n", " As mentioned in ", ", 500 sim seconds will be used for qual2b. The ", " now clarify that this information is not broadcast by the ARIAC server. For the Finals, as with the Qualifiers, the time limit will be set as a fixed value for all trials, which teams will know in advance. There are no time limits for individual orders.", "\n", " The config file that was used for evaluating Part B of the second qualifier is in ", ".", "\n", " The simulation model of the conveyor belt has been updated to  make ", ", where boxes fall into the conveyor belt, less likely to occur. There should be no other observable impact to users.", "\n", " The ", " has been released, including details on what to expect in the Finals, dry-run testing on the competition machines, and the schedule for the process.", "\n", " Structure of the ", " directory output by the automated evaluation setup is now described ", ".", "\n", " The config files used for the Finals of the competition are in the ", " directory. ", ". ", "\n", "\n", " (This change was included in the version of ARIAC used for evaluating the Finals).", "\n", " Closing/collection of shipping boxes during log playback now works correctly during state log playback.", "Registration: ", "\n", "Main NIST ARIAC Website (General information): ", "\n", "Competition rules: ", "\n", "Software documentation: ", "\n", "Support Email: ", "\n", "Forum for discussion: ", "\n", "Register to compete: ", "\n", "Main NIST ARIAC Website (General information): ", "\n", "Competition rules: ", "\n", "Software documentation: ", "\n", "Support Email: ", "\n", "Forum for discussion: ", "\n"], "url": "https://discourse.ros.org/t/ariac-code-release-updates/4009"},
{"title": "ARIAC 2020 Prize Competition Announcement", "thread_contents": ["Dear Robotics Enthusiasts,", "This letter is to announce the official start of our annual Agile Robotics for Industrial Automation Competition (ARIAC) call for participation!", "Do you have what it takes to be the best of the best to test the agility of industrial robotics systems, with the goal of enabling industrial robots on the shop floor to be more productive and autonomous? Then, prove it by being the top participating team with your innovative solutions to the problems posed by the ARIAC 2020 Competition. Robotics enthusiasts from all over the world are invited to participate in this simulation-based competition.", "Our intention is for ARIAC 2020 to continue to be a prize competition with the same prizes we had in the past years. So, are you up to the challenge? Please follow the steps to register ", ".", "For more details regarding the ARIAC 2020, please visit ", ".", "Best of Luck to everyone!", "Sincerely,", "Murat Aksu", "Electronics Engineer", "Intelligent Systems Division", "National Institute of Standards and Technology", "100 Bureau Drive, Stop 8230", "Gaithersburg, MD 20899-8230", "301-975-3735", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ariac-2020-prize-competition-announcement/11387"},
{"title": "About the ARIAC users category", "thread_contents": ["This category is for participants in the Agile Robotics for Industrial Automation Competition (ARIAC)", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/about-the-ariac-users-category/529"}
]