[
{"title": "MoveIt Maintainer Meeting Nodes - June 27th, 2019", "thread_contents": ["congratulations, ", "!", "we use ", " as it has all the features we currently need and is stable. In retrospect it was released at a very good point in time. Besides some random new python dependencies breaking our ci it seems to work very well. As we have a customn optimization in fcl 0.6 and updated ", " we don’t use the ROS packages however. I would appreciate not backporting too much stuff ", "any update on the actual date for World Moveit Day? I have a blocker in my calendar for sometime between Nov 19 - 21? But that would collide with our ROS-Industrial training at Fraunhofer IPA, so that we could not send one of our trainers to the planned event in Hamburg…", "\n", "World MoveIt Day was announced during our maintainer meeting a while back to be November 20th! We need to more publicly announce this, for sure.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["He has a 2 month old son! Congrats!", "Discussed MoveIt Day Locations:\n", "Tokyo - Felix", "Boulder - PickNik", "Boston - Ian McMahon and Bryce", "San Antonio - Jorge Nicho and SWRI", "Germany - Michael Gorner expressed interest, but would likely just be his lab.", "San Fransico - Dave will work on it (+ Jon Binney)", "\n", "We’ve got a how to do World MoveIt Day (Note: don’t know where this document is, but Logistics under ", " is probably similar)", "Jens:\n", "Things are progressing, continuous collision checking via casting works. A ", " is still in development, but will be open to the public soon (a few weeks)", "\n", "Omid:\n", "Has been working on another project, but will progress with TrajOpt next week.", "\n", "Led by Intel China (Yu Yun in the rep on this call):", "MoveIt Example Apps repo exists (", ")\n", "Handling dependencies for the CI will be difficult, timeouts are common", "Each application can have it’s own docker image with prebuilt dependencies\n", "Also open to other ideas, other contributions as well", "\n", "\n", "Will there be examples with real hardware?\n", "Each application will gurantee working in simulation", "Make some nodes in the application tutorial", "Will make an initial PR soon", "\n", "Lots of commits on master, Robert has back ported some changes back to Melodic", "However, no one is really using Melodic, so we can’t confirm that it’s still operational and stable.", "But we still need to release so we can stop older bugs being brought up on the issue tracker.", "Robert will prepare a release, and has already cherry-picked bug fixes back to Melodic\n", "We’ll also need a list of other commits that could go back", "\n", "PickNik has been considering taking on more often releases from Master, likely a PPA on top of ROS. It wouldn’t need it to include the rest of ROS, and should have a different debian package name.", "Adding planning pipeline support for the benchmark packages, simplified without warehouse, simple similarity measure for traj on the same experiment (how repeatable it is).", "Contains all the different runs, can load different log files.", "Could extend the similarity metric to handle different scenes as well, even though it could completely change the final results", "A current ", " is out now, but reviewable PRs are coming next week.", "Are the state machines in MoveIt in the right place?\n", "We don’t want to write our own state machines", "\n", "Why behavior trees vs state machines?\n", "trees give you a higher level idea of what is happening", "State machines are more event based, although trees can be as well", "Behavior trees don’t allow simultaneous actions", "\n", "What do we get by adding state machines?\n", "allows more complicated visualizers, but also just models logic better than manually include a bunch of if statements.", "\n", "Action hooks that send out events might become an interface, other libraries could hook into those with their own state machines.", "Fully Leverage ROS2\n", "Components nodes = 0 copying messages, etc.", "There are a lot of work and refactoring to be done to switch: is it worth the effort?\n", "the interface still must be ROS msgs, no copying be possible serializing.", "In general, C++ interfaces are easier to use, although ROS IDL might be easier to understand", "\n", "In terms of Grant funding, ROS 2 is desired, so it’s one of the reason’s we’re looking into it", "\n", "Determinism and Improved Interfaces are the more aligned with what most contributors to MoveIt do.", "We should consider what our target users are (a few examples use cases), and what our design philosphy is\n", "Look for a discourse post soon", "\n", "Sean Yen from Microsoft, have been working with ROS for a while now.\n", "They’ve made a Windows version of MoveIt, more coming in July.", "They have a CI set up already, should be as easy as retargeting the repository.", "We have Microsoft’s support for helping resolve Window’s specific issues, there will be conversations soon about if those issues should hold up PRs", "\n", "He has a 2 month old son! Congrats!", "However, no one is really using Melodic, so we can’t confirm that it’s still operational and stable.", "Discussed MoveIt Day Locations:\n", "…", "\n", "We’ve got a how to do World MoveIt Day (Note: don’t know where this document is, but Logistics under ", " is probably similar)"], "url": "https://discourse.ros.org/t/moveit-maintainer-meeting-nodes-june-27th-2019/9698"},
{"title": "Looking for MoveIt developers", "thread_contents": ["ros::init(argc, argv, “Hi MoveIt Community!”);", "ROS_INFO(“We are looking for talented robotic software engineers to usher MoveIt and robot arms to the next level of capabilities. We have openings for both full time or internships, on-site or remote.”);", "ROS_DEBUG(“More info: ", "”);", "ros::shutdown();", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/looking-for-moveit-developers/10009"},
{"title": "MoveIt Maintainer Meeting - All Invited - July 25th", "thread_contents": ["Inspired by the success of the many ROS2 working groups such as ", ", we are pleased to announce that during our ", " we agreed to open up our monthly meetings to all interested parties of the MoveIt project.", "\nIn 2016 we started holding regularly occurring MoveIt Maintainer meetings, where we discussed high level decisions such as roadmapping, releases, contributor policy, style policy, events, and major code changes. These meetings have always been invite-only, to encourage healthy debate and discussion without too many “cooks in the kitchen”. We’ve always had lots of relevant guests join us, but for the most part its been our ", ". Instead, we’ve always posted our meeting minutes online.", "Real-time meetings by Google. Using your browser, share your video, desktop, and presentations with teammates and customers.", "Meeting ID", "\n", "Phone Numbers", "\n(‪US‬) ‪+1 347-486-5750‬", "\nPIN: ‪644 991 049#‬", "Country-specific phone numbers are available.", "This is a great thing!", "Very happy to see this happening. At the same time, it diminishes the relevance of the “Manipulation WG” we kicked off without much success and helps concentrating efforts.", "The Manipulation WG’s focus, as with all ROS2 Steering Committee Working Groups, is on ROS 2. Our MoveIt Maintainer meeting instead mostly focuses MoveIt for ROS 1, though it does sometimes include ROS 2 updates and will eventually be all ROS 2 discussions (I hope!).", "For now it seems they have slightly different scopes.", " & ", " , I’d like to add a brief topic to the agenda for this week’s meeting - Interactive markers in ROS2. MoveIt uses a whole bunch of them, and there’s a few proposed changes for the ROS2 port which we should discuss:", "\n", "\n", "[re-posting ", " comment in the other thread]", "BTW, you can insert date ", " and times ", " inline with posts so they render wrt. reader time zones:", "\n", " ", "Discourse Update - New Fancy Feature With great honor, I would like to introduce you to a pretty big feature that has been introduced into this community! Meet my new girl “Date.” This new feature is going to be huge as it can be used for…", " would be correct I guess ", "Great tip ", ". Re: ", " I’ve edited Thilo’s post to have the correct timezone.", " good topic idea!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["No beginner “help me” questions ", "\n", "Please help us stay on our agenda topics, which are emailed to me ahead of time", "Have a good microphone setup if you choose to speak ", "\n", "\n", " and MoveIt", "GSoC and Internship Progress\n", "\n", "MoveItCon @ ROSCon", "\n", " progress", "MoveIt Pull Request Review Guidelines"], "url": "https://discourse.ros.org/t/moveit-maintainer-meeting-all-invited-july-25th/9899"},
{"title": "Plan multiple waypoints trajectory with contraints between poses N and N+1 only", "thread_contents": ["Hi there,", "\nI am trying to get a robot arm (Panda from the moveit tutorials) to grasp a cup in Gazebo, using ROS melodic on Ubuntu bionic.", "\nFor the grasping part I just get the pose of the cup from Gazebo, and send the endeffector in front of that cup. I finally generate a dynamic fixed link between both objects.", "\nMy problem is that I want to move the cup from position A to position B without spilling its content in the trajectory followed. Whenever I set constraints as follows:", "My planner fails to come up with a plan. I tried extending the planning time to 5 minutes, with no success.", "\nI am now thinking that the problem is that when the planner plans for a trajectory leading to the cup it does not know about what needs to be done next. So the arm might arrive in a joint configuration that makes it impossible to move the cup to point B without having to flip it over at least once.", "\nI know that it is possible to send multiple Cartesian pose goals to the planner so it can preprocess all of them and find the optimal trajectory, but how to tell it that starting from the pose in front of the cup, it should include the contraints? If that is not implemented yet, where could it be integrated in the code?", "Sounds like a cool problem!", "Which planner are you using exactly?", "MoveIt has several great options. I have use TRAC Lab’s IK solver to some pretty great success in the past (not doing ", " what you’re doing, but worth a shot):", "More information about what you are using would be great!", "This type of troubleshooting question is best asked on ", "We’ve had trouble with constrained motion plans, too. I would recommend making a Cartesian plan, instead. That will also keep the cup upright since it’s a linear interpolation (and it works, the last time I checked).", "I recommend using TRAC_IK or bio_ik for better results too.", "On bio_ik you can get iks with further constraints and they work (or at least they did on my use-case).", "I tried out TRAC_IK, but got similar results. I think OMPL with RTTConnect is the problem but couldn’t figure out how to change it in the parameters. Whatever I do RTTConnect is the one doing the planning.", "\nI basically want to move a cube from front to rear (modeled as a cube in moveit but it is a cup). I think the most confusing thing here are these lines:", "There is zero documentation on how those values should be set. What do they represent? How can one translate them into “You can turn the endeffector around world’s z axis as much as you want but around the two other axis it should be limited to few degrees to not spill the cup”. I tried all combinations of values, nothing seems to work well. Most of the times it doesn’t find a trajectory but in few cases it does and here is what it looks like:", "\n", "Here are my constraints:", "i don’t know why for those value (x 3.14, y 0.1, z 0.1 it managed to find a path, totally unintuitive)", "\nHere is the log from RTT", "[/move_group  INFO 1563826183.386238577, 352.138000000]: panda_arm: Allocating specialized state sampler for state space", "\n[/move_group  INFO 1563826183.386365074, 352.138000000]: RRTConnect: Starting planning with 1 states already in datastructure", "\n[/move_group  INFO 1563826191.847614911, 360.447000000]: RRTConnect: Created 8 states (2 start + 6 goal)", "\n[/move_group  INFO 1563826191.847754873, 360.447000000]: Solution found in 8.462048 seconds", "\n[/move_group  INFO 1563826192.703497689, 361.262000000]: panda_arm: Allocating specialized state sampler for state space", "\n[/move_group  INFO 1563826193.788332731, 362.328000000]: panda_arm: Allocating specialized state sampler for state space", "\n[/move_group  INFO 1563826198.994204393, 367.406000000]: SimpleSetup: Path simplification took 7.146335 seconds and changed from 4 to 4 states", "And my ros params for the move group:", "Finally, the resulting planned trajectory that you see in the GIF:", "Am I doing something wrong? I will give bio_ik a try too but as I said it seems to be caused by RTTConnect.", " Please move this to a question on ", " as ", " suggested. When you do please edit your post to link to the new location so someone who finds this thread will find the followups.", "Done, ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/plan-multiple-waypoints-trajectory-with-contraints-between-poses-n-and-n-1-only/9983"},
{"title": "Request for Feedback: New High Level API", "thread_contents": ["A number of us have been debating and prototyping what a new high level API for MoveIt would look like. Our primary motivation is improved performance and fewer layers of abstraction.", "This new high level interface, which we are code naming ", ", would be a unified C++ API that does not require the use of ROS Actions, Services, and Messages to access the core MoveIt functionality.", "This new API would be an alternative (not a full replacement) for the existing ", ".", "Have any feedback, suggestions, or concerns? Please share!", "Our primary motivation is improved performance and fewer layers of abstraction.", "I like the idea of fewer layers.  I personally found it confusing to have multiple ways of interfacing with the MoveGroup object and understand which approach to use when I was first starting to use MoveIt.", "This new high level interface, which we are code naming ", " , would be a unified C++ API that does not require the use of ROS Actions, Services, and Messages to access the core MoveIt functionality.", "Would this effectively be the same as removing the Actions and Services available in the current MoveGroup implementation? Do these Action/Service servers take a large amount of overhead on the host? Are there other downsides to having these ROS interfaces available?", "I assume the new API will still rely on plugins to support customization? Will this new interface have ROS completely removed? What would you replace the ROS message objects with? What is the downside of using ROS message objects here?", "Do you have any use case examples? What portion of the lower levels can we not access via MoveGroup?", "How would removing the ROS interface make the development faster?", "Thanks for the many questions, ", "Would this effectively be the same as removing the Actions and Services available in the current MoveGroup implementation?", "Yes, but we want to keep the current implementation as an option, also.", "Do these Action/Service servers take a large amount of overhead on the host?", "They add latency that is very problematic for any level of realtime control. Of course, this issue may go away on its own with ROS 2’s realtime support, but that is still questionable.", "Are there other downsides to having these ROS interfaces available?", "Again, we want to maintain those interfaces also, for those who desire it.", "I assume the new API will still rely on plugins to support customization?", "No, we’re moving away from the capabilities / plugins approach. MoveIt already has tons of lower level plugins for each component, I don’t see a need to wrap plugins with more plugins.", "Will this new interface have ROS completely removed?", "No, it will still have dependencies on ROS", "What would you replace the ROS message objects with?", "This is undecided and under debate. For now we’re thinking keeping a very similar API that heavily relies on moveit_msgs / etc. But those message types won’t ever be published.", "Long term, we might just want to use lower level types like Eigen::Isometry3d and moveit_core::RobotState.", "What is the downside of using ROS message objects here?", "I’m not 100% sure what their overhead is… I don’t think serialization is happening until they are published.", "Do you have any use case examples?", "Anything involving closed loop control", "What portion of the lower levels can we not access via MoveGroup?", "Basically all of it. You are currently constrained to the data flow through moveit_msgs", "How would removing the ROS interface make the development faster?", "Less layers to poke through whenever you want to work on new features or improvements.", "Whew, that was a lot.", "Whew, that was a lot.", "Thanks for entertaining all of my questions ", "!! I know I don’t have a complete understanding of how MoveIt is connected together and I appreciate you engaging the community and letting us have a say in the direction it is going.", "I guess the only other question I have is how much work do you think this new interface would take? Would it delay the timeline of getting a fully functioning MoveIt2 interface?", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["No ROS abstraction (messages, services, actions) from the actual planners and IK solvers", "Support for advanced tasks via access to lower levels of pipeline", "Faster software development time for industrial, non-academic projects", "Possibility to support high performance planning", "Maintain multi-arm / multi-group support, do not over-optimize for single arm case", "No ROS abstraction (messages, services, actions) from the actual planners and IK solvers", "Support for advanced tasks via access to lower levels of pipeline", "Faster software development time for industrial, non-academic projects"], "url": "https://discourse.ros.org/t/request-for-feedback-new-high-level-api/10151"},
{"title": "Unified collision environment", "thread_contents": ["MoveIt contained a split collision environment of the robot itself and the world into ", " and ", ". ", " is used for self-collision checks whereas ", " for robot-world collision detection.", "After discussions within the community, we decided that a single unified collision environment is the better solution. It reduces complexity and improves maintainability. Adding other collision detectors like Bullet and leveraging their full performance potential becomes easier. For more details, please see the ", ".", "The changes are only merged in the master branch and will not be cherry-picked to any stable release.", "The changes break the existing API in two places: Code which directly interacts with the collision detection through the ", " or ", " environment. These functions do not exist anymore and are superseded by ", " which returns the new unified collision environment. The new ", " provides the union of all functions in ", " and ", ".", "Please report any bugs and issues you encounter during the transition on ", ".", "Thanks ", "! Could you better emphasize the collision checking speedups this unification gets us?", "The unification itself does not bring speed improvements but is a big step in the direction of more performant collision checking. I did some benchmarks using Bullet in a unified collision setup and it is able to outperform FCL in many different scenarios (all values in checks per second):", "When the closest distance is needed, Bullet is also considerably (factor 10) faster. See ", " for more details. Bullet will hopefully be available within this month.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/unified-collision-environment/10373"},
{"title": "MoveIt Maintainer Meeting - August 22nd", "thread_contents": ["The next Maintainer Meeting will be ", "Your time zone: ", "Please request here any agenda topics you would like included. From my list:", "Real-time meetings by Google. Using your browser, share your video, desktop, and presentations with teammates and customers.", "Meeting ID", "\n", "Phone Numbers", "\n(‪US‬) ‪+1 347-486-5750‬", "\nPIN: ‪644 991 049#‬", "Country-specific phone numbers are available.", "I forgot to ask someone to take meeting notes… so we don’t have any, my apologies. Here is the agenda we covered:", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["TrajOpt dependency issues", "Refactored collision environment & Bullet", "Task Constructor progress", "World MoveIt Day", "MoveItCon @ ROSCon", "MoveIt Pull Request Review Guidelines", "World MoveIt Day", "MoveItCon @ ROSCon", "MoveIt Pull Request Review Guidelines", "TrajOpt dependency issues", "Refactored collision environment & Bullet", "Pushing to branches", "master vs. melodic branch commits", "moveit_cpp", "Missing URDF tags we need to add"], "url": "https://discourse.ros.org/t/moveit-maintainer-meeting-august-22nd/10299"},
{"title": "MoveIt! Gazebo Integration", "thread_contents": ["Hey fellas,", "I am surprised that there isn’t a Gazebo integration topic in this channel. Although MoveIt! has streamlined Gazebo integration, the auto-generated files didn’t work directly in my 3DOF robotics arm’s case. Therefore I needed to solve the problems manually. After I’ve successfully integrated Gazebo and MoveIt!, I have written ", ". The post contains steps to follow after setup_assistant finishes its job. It also contains solutions to various subsidiary problems. At the end there are pointers to external links with similar context, which I didn’t notice at the beginning of the article. I hope it would be useful for beginners and newcomers.", "This is absolutely great! I went and posted on the ", ".", "Hi ", ",", "Thanks for further documenting how to use Gazebo with MoveIt, its an important part of the ROS ecosystem!", "The Gazebo / MoveIt Setup Assistant integration was a Google Summer of Code ", " last year by Mohamad Ayman, and we’re really happy the progress. I was his primary mentor on the effort. Of course, there’s always more work to be done!", "One thought - maybe you could create a tutorial in the centralized ", " website that includes this documentation?", "Hi there,", "I can definitely adapt the post to the centralized tutorials if it is convenient.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/moveit-gazebo-integration/10553"},
{"title": "MoveIt Maintainer Meeting - Sept 26th", "thread_contents": ["The next Maintainer Meeting will be ", "Your time zone: ", "Please request here any agenda topics you would like included. From my list:", "Real-time meetings by Google. Using your browser, share your video, desktop, and presentations with teammates and customers.", "Meeting ID", "\n", "Phone Numbers", "\n(‪US‬) ‪+1 347-486-5750‬", "\nPIN: ‪644 991 049#‬", "Country-specific phone numbers are available.", "Hi Dave,", "I won’t be able to make it to this meeting - just in case you planned with me because I saw Bullet on the agenda.", "Jens", "The minutes of the meeting:", " Ayush Garg, Dave Coleman, Mark Moll, Gijs van der Hoorn, Yu Yan (probably), Jafar Abdi, Henning Kayser, Robert Haschke, Rob Coleman, Jorge Nicho, Mike Lautman and Felix von Drigalski (writing the minutes)", "\nJoined later: Marq Rasmussen, Simon Schmeisser, Yatharta Tuladhar (left early)", "Mark Moll is reviewing the additions from Jens Petit GSoC project and Omid Heidari’s Picknik internship. Comments:", "\nHenning has been working on it, but we still need a demo. Dave asks if Robert could finish it on the weekend maybe, since it’s a company quarterly goal.", "\nRobert: The demo is not specific to the MTC, and making it might be a bit more involved, which is why I’ve been putting it off, so.", "Mark brought up the code of conduct. There’s an open PR, which is not about enforcing new rules or correcting anything going wrong in the community, but about signalling to the outside that we care. This is also in response to the events around Linus Torvalds etc. It is hard to imagine this happening in the MoveIt community, but it is prudent.", "\nDave, Felix are in agreement.", "\nGijs bring up concerns about people having left open-source communities over this, and because it sounds like it requires maintainers to police and enforce the code of conduct.", "\nRobert understands your concerns and agrees that we don’t really need a code of conduct, since we never had issues, but doesn’t care if we have it.", "\nMike: Good to define standards, can’t imagine anyone being in danger of being kicked out.", "\nDave: It might welcome minorities.", "The discussion is left to sync up in the Github PR.", "We will have a workshop on the day after ROSCon, a mini conference aimed at developers. We will discuss the roadmap and direction for MoveIt, grasping efforts, new features. Participants will be expected to be familiar with MoveIt if they want to get the most out of it.", "Mark Moll is accepted as a maintainer. Some discussions about the level of commitment, experience and maturity expected of maintainers.", "Mike suggests that we should move the MoveIt tutorials to ", " to look more professional. Robert questions if open-source code should be hosted on a private company server like that, and claiming them as part of Picknik might seem a bit like cheating. Dave adds that it’s not uncommon and Picknik supported the creation of the tutorials (including the push with Franka Emika).", "Gijs brings up that the license of the text is an issue, as BSD might not apply to text. We agree that this situation needs to be investigated.", "Addendum from Levi on the mailing list, re. the TrajOpt solver license:", "In reference to the TrajOpt license issues. The source code can be found using the link below, It states that it can only be used for non-commercial use. We have been using OSQP in-place of BPMPD because of this issue. We did a complete performance evaluation of the currently supported solvers (BPMPD, OSQP, QPOASIS and GUROBI). They all had their pros and cons, but OSQP was the next best with a desirable license. We plan to make this the default solver for TrajOpt. Hope this is helpful.", "When is the next meeting?", "We’re cancelling the October MoveIt Maintainer meeting because of ROSCon and the MoveIt Workshop the following week. I’ll post on Discourse details for the November meeting closer to time!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Quick updates on TrajOpt, Bullet, Task Constructor", "MoveIt Workshop 2019 Macau - Final Agenda", "Adding new MoveIt maintainers / core contributors\n", "Promoting/demoting maintainers based on how active they’ve been", "\n", "Code of Conduct", "Admin permissions for Github repos\n", "2-factor authentication?", "Branch safety settings?", "\n", "Tutorials URL", "Bullet PR is hard to review, because there are a lot of changes. Should be good to merge though, considering the amount of review and mentoring that went into it.", "Trajopt is tricky because of licensing. The default solver library from the 90s does not have a license and the author has disappeared. The question is if we a) merge it now and deal with the license issues later or b) keep it as an external repository, for example. IPOPT is an alternative has an Eclipse license and should be good. GUROBI (?) is free for academic use and widely used.", "\nDave notes that it would be bad to include unlicensed code in the repository.", "\n(Also see addendum about this below)"], "url": "https://discourse.ros.org/t/moveit-maintainer-meeting-sept-26th/10780"},
{"title": "Roadmapping and Future Direction", "thread_contents": ["Recently at the first annual MoveIt Workshop (more details will be posted soon), we had many discussions about the future roadmap for MoveIt, both for ROS 2 support as well as other features to be added. We had a group brainstorming session with sticky notes that I hope Mark Moll can share in this thread.", "I’d like to continue that discussion here for the greater community to get involved with, even if you couldn’t make the event in China.", "We’ve just created a ", " on the MoveIt website with our immedate ROS 2 plans, as well as some farther reaching ideas. However, these ideas are just that - hypotheticals that require resources to further develop and pursue.", "Please provide your feedback and thoughts below, with the knowledge that an open source project depends on community volunteers, as well as possibly donors, to actually make these new features happen.", "I’ll copy the current roadmap table here, also, for ease of reference:", "\n", "p.s. next week is World MoveIt Day (Nov 20th 2019)", "Here are some notes from discussions at the roadmapping session of the MoveIt workshop (thanks in part to ", " and ", "):", "This is a follow-up to the rather misplaced initial listing in ", "Thank you so much ", ", ", ", ", " for the additional notes!", "As I sadly did not attend the workshop, here is some feedback from my side, too.", "MoveIt already preempts motions if a new collision is detected.", "\n", " does exactly that and is implicitly used for every single trajectory", "\nwe execute and for every change in the planning scene the system observes.", "\nUsually industry argues in favor of ", " using standalone nodes for MoveIt because this intrudes on their internal design concepts.", "\nIf people are supposed to use classes/libraries in their own node, I don’t see what we can/should do to support lifecycle management of their nodes.", "In the last maintainer meeting where we discussed this point, it was very fuzzy what this could look like.", "\nAlso, there was no agreement at all among the maintainers whether this would be a good idea, because it would make tracing bugs much harder if no backtraces in clear call-hierarchies are possible anymore.", "\n", "Support for dynamically updated robot model (for instances, supporting tool changers, especially when the end effectors are actuated)", "This is not just a matter of MoveIt, but the general question on how this is should be implemented across ROS2. Still, MoveIt could pioneer a new “standard” approach for this (and extend other packages to support it).", "Support for multiple robots in a scene (and actually being able to plan with multiple robots at the same time)", "This is already possible right now by having a big urdf with all robots and many people did it in the past. What exactly is new/requested here?", "\nIf multiple separate URDF models in one scene are targeted, I would second this request, but this also leads to problems such as", "Great! I would appreciate more detailed feedback and further explanations to actually improve things in person.", "What does this mean? Sensors are not at all supported in the PlanningScene, geometric measurements are. What alternative measurements are relevant to people?", "Add scene graph support to represent the relationship between objects", "Add support for Convex Collision checking, to support things like TrajOpt", "We noticed that this might mean two entirely different things and I would still like to know what was meant in the workshop discussions:", "Convex mesh support would make a wonderful MoveIt2 milestone entry.", "The second interpretation could improve continuous collision checking, but might be more involved.", "Visual Impact 1 - Add support for mobile manipulation", "As I’m probably one of the very few people who used this in recent years, here’s my experience with the current state:", "Add planning support for diff drive robots", "This boils down to implementing a new joint type ", " and support it throughout the pipeline.", "\nI would expect this to be quite challenging when working on the details.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["The main concerns related to integration between planning and control:\n", "Planning with dynamics limits, torque limits, or end-effector payload", "Real-time collision checking/avoidance & dealing with moving objects while respecting joint limits", "Closed-loop plan execution (maybe synthesize a controller along with a path/trajectory?)", "\n", "Better support for Cartesian planning and constrained planning more generally.", "Determinism and predictable behavior are also high on the wish list.\n", "Personally, I think multiple parallel planning pipelines (as described in the previous comment) is the way to go.", "\n", "Planning as a service to allow planners to be written in any language (this probably belongs in the next group).", "More flexibility is needed in how planning is performed:\n", "Per-planner planner request adapters", "Allow multiple planner plugins in the same group", "Multi-robot cooperative planning. This can mean many different things:\n", "Centralized planning for multiple robots", "Decentralized planning and using scheduling to interleave motions as much as possible", "Reactive planning", "Etc.", "\n", "\n", "It would be nice to get search-based planning working again", "Concerns\n", "How to provide appropriate Python support", "Improve modularity with more plugin interfaces to core components/functionality", "Improve the layering of abstraction from core components to higher level interfaces", "\n", "Action items", "\n​ - Look into PyBind 11 for Python bindings", "\n​ - Look into replacing plugins with ROS2 component nodes\n", "Generate high-level architecture diagram illustrating how the components of MoveIt are structured and interact with each other", "Deprecate the moveit_commander and use a more “stand-alone” Python package with a high-level API to call move_group services", "Provide Python function for directly planning/moving to a Cartesian position (possibly already exists?)", "\n​", "\n", "Industry Priority 1 - Broadly described as better environment modeling/integration\n", "Support for dynamically updated robot model (for instances, supporting tool changers, especially when the end effectors are actuated)", "Support for multiple robots in a scene (and actually being able to plan with multiple robots at the same time)", "Support for external IO integration (ties back to the tool changer aspect, first class support for integration with typical industrial IO)", "\n", "Industry Priority 2 - Broadly described as “more moveit task constructor features”\n", "Support for synthesizing a sequence of tasks (large portions of this probably already exist in MTC - but aren’t widely understood yet)", "Exposing motion primitives through action interfaces (for instance, action interface to have MTC execute a particular task. At the far end of this, having MTC basically replace move_group so that we have truly dynamic/programmable/extensible ROS interface to MoveIt)", "Process planning and simulation (Gijs can certainly expand on what this means – I didn’t capture all of that)", "\n", "ROS2 Priority 1 - Environment Representation / API\n", "Look into unifying environment representations between MoveIt, ROS2 Navigation and Autoware (e.g. we have Octomap+links, Navigation has cost maps, etc - they all do similar things, lots of code being duplicated)", "More sensors supported in planning scene, instead of just pointclouds", "Add scene graph support to represent the relationship between objects", "\n", "Community Priority 1 - Add support for Convex Collision checking, to support things like TrajOpt", "Visual Impact 1 - Add support for mobile manipulation\n", "Add planning support for diff drive robots", "Probably need to fix bugs related to assumptions of fixed frame", "Consider other/expanded environment representations (e.g. base_link-centered 3d-costmap instead of world-frame-centered Octomap)", "\n", "how/where do you define the geometric relation between the models?", "how/where are joint states for all models reported and merged?", "Should MoveIt support any number of ", " ? Should we generalize all interfaces to support any number of robots?", "Support for declaring/handling meshes as convex, so as to exploit faster collision checking algorithms in this case", "Support for heuristically checking for collisions of trajectories by creating the convex hull of start and end state.", "The virtual joint can be used to define a single holonomic joint for driving or flying.", "The whole concept of “workspace” in MoveIt currently limits the positional range of these (otherwise unlimited) joints.", "With a holonomic robot base, e.g., the PR2, planning arm&base motions together works. The results are trajectories that, for example, move the robot around while grasping something.", "The trajectories can, however, not easily be executed as there are usually no base controllers that can receive a MultiDOF trajectory and actuate it. ", " does not support any ROS interface to forward such a trajectory either and needs to be extended/replaced.", "especially with such base motions, motion planning should typically be biased to prefer moving arms over the entire base. This is not trivially available in the pipeline at the moment, although OMPL probably has some support for it (e.g., optimizing for minimum effort)"], "url": "https://discourse.ros.org/t/roadmapping-and-future-direction/11472"},
{"title": "World MoveIt Day November 20th - Save the Date", "thread_contents": ["Quick announcement that our ", " open source hackathon event will be on Wednesday ", ". Further details are available ", ".", "Last years event was a record-breaking success with 13 official locations around the world and over 200 participants. See the full details ", " and ", ".", "Please contact me if you’re interested in hosting an event at your organization, we have a comprehensive ", " to help you along.", "Please let us know your intention to host an event or join as a participant by signing up ", ".", "Thank you!", "Hi everyone,", "here’s a last-minute reminder for World MoveIt Day, this Wednesday!", "If you are flexible, you can still sign up for any of the local events in the USA, Singapore, India, Japan, and Germany for meeting interesting people and discussing current affairs with the framework", "If you will spend the day in your lab/office, you can take part in the event and contribute your expertise and curiousity, nonetheless!", "Either way, now is the time to look through ", " or MoveIt’s tutorials collection, and decide on something you want to work on for the event!", "\nIf you have your own ideas for what you want to work on, consider creating a new issue in the respective source repository.", "\nThat way, maintainers might be able to provide guidance ahead of time to enable you to get further during the event!", "In case you want to join the conference channel, you can find it here: ", "New Room: ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/world-moveit-day-november-20th-save-the-date/9913"},
{"title": "[Newbie] Cheapest way to get robot arm hardware for hobby", "thread_contents": ["Hi there, I’m thinking of getting a hobby to make robot arms. I’m okay with the scope being small. And I prefer to concentrate on tinkering with the software than the hardware.", "How can I get my hands on low costs hardware parts for a robot arm?", "Have you checked out the open manipulator?", "\n", "\nIt’s not the cheapest option but would have you up and running quickly with a user base to help if you run into issues.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/newbie-cheapest-way-to-get-robot-arm-hardware-for-hobby/11778"},
{"title": "MoveIt Maintainer Meeting - Dec 5th", "thread_contents": ["The next Maintainer Meeting will be ", "Your time zone: ", "Please request here any agenda topics you would like included. From my list:", "Real-time meetings by Google. Using your browser, share your video, desktop, and presentations with teammates and customers.", "Meeting ID", "\n", "Phone Numbers", "\n(‪US‬) ‪+1 347-486-5750‬", "\nPIN: ‪644 991 049#‬", "Country-specific phone numbers are available.", "I’d like to discuss dropping support for Xenial in order to support an up-to-date Bullet version for merging the ", " branch into master. Or any alternative solutions.", "See ", ".", "Thank you for these neat notes Henning!", "Python3 support (updates from v4hn)", "I did not manage to attend this meeting due to family obligations. What’s the meaning of the parenthesis?", "Handing over release process to Jafar", "Did you discuss a release schedule in this context?", "\nI believe up for discussion was a monthly release to ", "WMD 2019", "The most important bullet point is missing: As in previous years, it was very successful, with lots of community contributions!", "2 reviewers should only be required for larger changes, smaller or trivial fixes can be merged after 1 review", "This decision took me by surprise…", "I believe this does ", " imply that maintainers can file pull-requests and merge them without anyone else looking at them, right?", "\nI would very much appreciate a change of the github permissions to ", " allow this again, e.g., for cherry-picking merged pull-requests.", "\nBut I don’t think it’s a good idea to allow this on a general basis!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Updates on MoveIt 2 and release date", "Noetic release date and preparation / testing", "2 review policy", "Update on new moveit_cpp API interface", "STOMP project affiliation with MoveIt", "Admin permissions for Github repos\n", "2-factor authentication?", "Branch safety settings?", "\n", "Tutorials URL", "Your topics!", "Full release vs intermediate melodic release", "Use master as release branch", "API freeze in April?", "Python3 support (updates from v4hn)", "New Melodic release ASAP", "Robert will guide handover", "Jafar should become maintainer", "Discussion: Block PRs with negative coverage?", "Reviewers should decide on how to proceed", "Add note to review guidelines", "Date conflicts with other events/responsibilities", "Possibly move WMD to spring or earlier in the year", "Discussion will follow in ", " and PR", "Possibly provide separate time profile generator", "GPL-v3 license issues", "Maintenance obligations (ROSin)", "Adding 1 maintainer + 1 core contributor from PILZ", "Currently performing MoveIt 1 master sync + moveit_msgs", "Beta release planned by February", "Compile with cmake with kinetic support", "Ubuntu 16.04 will not be supported", "2 reviewers should only be required for for larger changes, smaller or trivial fixes can be merged after 1 review", "Mark will update reviewer policy on website", "\n", "\n(only supports master branch)", "Backport API change to support melodic+master", "Released including ", "\n", "\n", " for PRM-based planners", "Custom ", "\n", "cost convergence, iteration count, first solution", "\n", "Waiting for panda_moveit_config release"], "url": "https://discourse.ros.org/t/moveit-maintainer-meeting-dec-5th/11501"},
{"title": "Python module for control Robotiq 2F-85 from external ubuntu pc", "thread_contents": ["Although it is easy to control the axis with MoveIt for ur3e, it was difficult to control Gripper from an external PC.", "\nTherefore, we released the Python2.7 module for controlling Robotiq 2F-85 from an external PC.", "\n", "RobotiqHand python module for control Robotiq 2F-85 from external ubuntu pc. - TechMagicKK/RobotiqHand", "\n", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/python-module-for-control-robotiq-2f-85-from-external-ubuntu-pc/12032"},
{"title": "World MoveIt Day 2019 Recap", "thread_contents": ["We are thrilled to report that World MoveIt Day was a great success this year, setting new records - again - for the annual event. We would like to thank everyone who participated, sponsored, and supported.", "We’re excited to see new locations and interest in MoveIt", "MoveIt continues to grow and improve and we appreciate everyone’s contributions.", "Now for the numbers:", "Official locations and participants:", "A few other stats from the event and 30 days after, in the consolidated moveit repo. There are many other MoveIt related repos that we did not measure for this report:", "PickNik ", "Fetch ", "OMRON SINIC X ", "See also ", "Looked like fun! Great work guys! ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Number of locations: 10", "Number of participants: 141 (18% larger than 2018)", "11 @ Universität Hamburg / Group TAMS, Hamburg, Germany", "33 @ Panjab University, Chandigarh, India", "10 @ Panjab University, Haryana, India", "2 @ Cluster Innovation Centre, New Dehli, India", "25 @ OMRON SINIC X, Tokyo, Japan", "9 @ PickNik Robotics, Boulder, CO", "22 @ Southwest Research Institute, San Antonio, TX", "15 @ Fetch Robotics, San Jose, California", "4 @ Idaho State University, Pocatello, ID", "10 @ Advanced Remanufacturing and Technology Centre (ARTC), Singapore", "94 pull requests merged", "117 pull requests opened", "32 issues closed", "37 issues opened"], "url": "https://discourse.ros.org/t/world-moveit-day-2019-recap/12463"},
{"title": "MoveIt Maintainer Meeting - Jan 23rd", "thread_contents": ["The next Maintainer Meeting will be ", "Your time zone: ", "Please request here any agenda topics you would like included. From my list:", "Real-time meetings by Google. Using your browser, share your video, desktop, and presentations with teammates and customers.", "Meeting ID", "\n", "Phone Numbers", "\n(‪US‬) ‪+1 347-486-5750‬", "\nPIN: ‪644 991 049#‬", "Country-specific phone numbers are available.", "Another topic for discussion: ", ". Applications from mentoring organizations are due by Feb. 5.", "The minutes of the meeting:", " Audrow Nash, Colaed11, Dave Coleman, Felix von Drigalski, Henning Kayser, Jafar Abdi, Jens Petit, Joe Speed, Jon Binney, Mark Moll, Marq Rasmussen, Mike Lautman, Robert Haschke, Simon Schmeisser", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["MoveIt 2 code freeze and release date", "Admin permissions for Github repos\n", "2-factor authentication?", "Branch safety settings?", "\n", "Your topics!", "Who is interested in being a (co-)mentor?", "Project ideas?", "\n", " (Henning Kayser)\n", "The scope of the beta release\n", "moveit_core", "moveit_ros_planning", "planning_scene_monitor", "moveit_cpp", "ompl_plugins", "moveit_kinematics", "See GSheet for the porting progress ", "\n", "\n", "Will not include all the features that MoveIt provide, they still future work", "There will be a blog post", "API freeze will be February 1st", "The official release will be February 14th", "\n", "\n", " (Mark Moll)\n", "For projects ideas ", "\n", "\n", "\n", " (Joe Speed)\n", "A framework that could be used in MoveIt project ", "\n", "If there’s someone wants to volunteer to add the support to MoveIt", "\n", "\n", " (Jens Petit)\n", "The Bullet feature branch got merged into the master branch", "\n"], "url": "https://discourse.ros.org/t/moveit-maintainer-meeting-jan-23rd/12185"},
{"title": "The MoveIt 2 journey (part 0): why MoveIt 2?", "thread_contents": ["This is the first of a series of articles that we will produce to describe our learning experience and contributions with the MoveIt 2 and ROS 2 communities. The MoveIt! motion planning framework is an open source software for motion planning, manipulation, 3D perception, kinematics, control and navigation. It’s built on top of the Robot Operating System (ROS) and altogether, according to its maintainers, remains the third most popular package in the ROS world. MoveIt! provides an easy-to-use platform for developing advanced robotics applications, evaluating new robot designs, and building integrated robotics products for industrial, commercial, R&D and other domains.", "As MoveIt! evolves beyond R&D environments and starts getting integrated into more and more commercial and industrial products, it’s only natural to look for improvements and seek alignment with groups attempting to use ROS on industrial and commercial environments.", "Over the last years some groups have extended ROS to obtain different degrees of determinism (e.g. [1]), however these attempts ended up with complex and use-case specific architectures that were never fully adopted by industry. As described at [2], ROS started in November 2007 as the development environment for the research-oriented Willow Garage PR2 robot. Due to its research nature, ROS did not considered many aspects relevant for industry. One of such was real-time compliance. ROS was never meant to guarantee deterministic responses, critical for an improved motion planning experience.", "With complete understanding of these limitations, around 2014, Open Robotics started designing a new version of ROS called ROS 2. Such version aimed to deliver upgraded features when compared to ROS 1 and was officially released the 8th of December, 2017. ROS 2 has been extended enabling support for teams of multiple robots (or robot modules), small embedded platforms or primitives to enable real-time robotic systems.", "As one of the companies leading the transition to ROS 2 and as the company behind ", ", the first modular robotic arm that runs ROS 2 natively, the use of MoveIt! seemed natural to us. While MARA can be operated ", " with MoveIt! (see ", ") through the ", " ROS package, it was always our desire to provide the best experience. And this brought us to ask ourselves: Why MoveIt 2?", "Our motivation:", ". While this can be fine tuned, doing so is technically complex. Moreover, it generally requires to have a powerful-enough computer and, even in the best case, unnecessary latencies (due to the layers of abstraction) appear in the overall control chain.", ". ROS 2 delivers upgraded features when compared to ROS 1. It has been extended including support for teams of multiple robots (or robot modules), small embedded platforms or primitives to enable real-time robotic systems. We can particularly highlight the following characteristics:", ". Our ", " technology allows to build robots whose components are all ROS 2-native. It’s only natural that we aim for a motion planning framework that can similarly also operate in a ROS 2-native manner.", ": Open Robotics performed an initial analysis [3,4] of the capabilities one could achieve with ROS 2 in terms of determinism. These articles already highlight the importance of the computer architecture, the underlying operating system or the communication middleware used. All these aspects need to be taken into account when designing a real-time distributed system. This matter was further investigated by our group at [6,7,8,9] where we evaluated and characterized the ROS 2 responses on a (an embedded) system while researching and optimizing the underlying communications middleware (DDS), the Linux Networking Stack, the Linux operating system or the base link layer towards the creation of a firm-real-time capable distributed system based in ROS 2. Focused purely on ROS 2 layers (ROS Client Library (rcl), ROS middleware layer (rmw), etc.), Maruyama et al. [5] conducted an experimental study aimed at comparing the performance of ROS and a preliminary version of ROS 2, under different types of Data Distribution Services (DDSs). More recently, member of Apex.AI wrote a short introduction[10] summarizing optimizations required in the ROS 2 layers such as the use of safe data types, split memory allocation in init and runtime phases, remove all blocking calls or implement real-time safe log output handler among others.", "\nAll these optimizations are but pre-requirements to obtain real-time distributed motion planning over ROS 2. It’s also required to optimize the motion planning framework itself. This will and end-to-end real-time motion planning experience.", "\nMoveIt 2 is the place where to do so. The adoption of ROS 2 facilitates the real-time optimization of the underlying layers and paves the path towards real-time motion planners. Preliminary work (though not connected to ROS 2 just yet) is available at ", " (", ").", ". According to some of its core maintainers, “many companies and R&D teams report they will not migrate to ROS 2 until the MoveIt 2 port is complete”. Looking at past releases of ROS, this was similarly true when Kinetic was released; months later, when MoveIt! was ready for Kinetic, adoption picked up dramatically.", "Motivated by the technical and strategical benefits, our team announced a few weeks ago ", ". We plan to deliver to the community a first working prototype of MoveIt 2 with MARA, as ", ", and have partnered with ", " to benefit from their expertise in motion planning.", "Our work is happening at ", " and we’re contributing directly to the official MoveIt 2 repository (", ") through Pull Requests. In barely a few weeks, the repository has about 60 starts and active involvement from members of the MoveIt maintainers group. We encourage everyone to jump in and contribute to MoveIt 2.", "We’d like to credit our partners at PickNik for their support in the process. Similarly, we’d like to thank William Woodall, Dirk Thomas, Tully Foote or Robert Haschke for their insights and contributions in this first phase of the project.", "The unofficial MoveIt 2 logos are the result of ", ". We’ve made them available for everyone.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", "\n", "\n", "\n", "\n", ": Supported by companies from all around the world that collaborate with open source contributions to make ROS 2 the de facto standard for robot application development.", "\n", ": ROS 2 was built from the ground up to be industry-grade and used in production environments, including high reliability and safety critical systems.", "\n", ": first class support for Linux, Windows, and macOS plus a tiered support model that allows for seamless ports to new platforms, such as real-time and embedded OSs.", "\n", ": Layered architecture which allows for the co-existence of both open source and proprietary solutions while facilitating the comparison of different technologies for each layer.", "\n", ": ROS 2 is ready for use across a wide array of robotics applications, across several domains. From indoor to outdoor, home to automotive, underwater to space, and consumer to industrial.", "\n", ": The default communications method in ROS 2 uses the industry standards DDS and RTPS, which are already widely deployed in a variety of industrial applications, from factories to aerospace.", "\n", ": ROS 2 provides the robotics tools, libraries, and capabilities needed to develop applications, allowing developers to focus on the work that is important for business.", "\n", ": ROS 2 code is licensed under Apache 2.0 License, with ported ROS 1 code under the 3-clause (or “new”) BSD License. Both licenses allow permissive use of the software, without implications on the user’s intellectual property.", "\n", ": Over 10+ years the ROS project has produced a vast ecosystem of software for robotics by nurturing a global community of hundreds of thousands of developers and users who contribute to and improve that software. ROS 2 is developed by and for that community, who will be its stewards into the future.", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "[1] Wei, H., Shao, Z., Huang, Z., Chen, R., Guan, Y., Tan, J., & Shao, Z. (2016). RT-ROS: A real-time ROS architecture on multi-core processors. Future generation computer systems, 56, 171-178.", "[2] Gerkey, B., Why ROS 2.0? Retrieved from ", "\n", "[3] Kay, J., Introduction to Real-time Systems. Retrieved from ", "\n", "[4] Kay, J., Proposal for Implementation of Real-time Systems in ROS 2. Retrieved from ", "\n", "[5] Maruyama, Y., Kato, S., & Azumi, T. (2016, October). Exploring the performance of ROS2. In Proceedings of the 13th International Conference on Embedded Software (p. 5). ACM.", "[6] Gutiérrez, C. S. V., Juan, L. U. S., Ugarte, I. Z., Goenaga, I. M., Kirschgens, L. A., & Vilches, V. M. (2018). Time Synchronization in modular collaborative robots. arXiv preprint arXiv:1809.07295.", "[7] Gutiérrez, C. S. V., Juan, L. U. S., Ugarte, I. Z., & Vilches, V. M. (2018). Real-time Linux communications: an evaluation of the Linux communication stack for real-time robotic applications. arXiv preprint arXiv:1808.10821.", "[8] Gutiérrez, C. S. V., Juan, L. U. S., Ugarte, I. Z., & Vilches, V. M. (2018). Towards a distributed and real-time framework for robots: Evaluation of ROS 2.0 communications for real-time robotic applications. arXiv preprint arXiv:1809.02595.", "[9] Gutiérrez, C. S. V., Juan, L. U. S., Ugarte, I. Z., Goenaga, I. M., Kirschgens, L. A., & Vilches, V. M. (2018). Time Synchronization in modular collaborative robots. arXiv preprint arXiv:1809.07295.", "[10] Pangercic, D., ROS 2 and Real-Time, Retrieved from ", ".", "[12] ", "\n", "[13] ", "\n"], "url": "https://discourse.ros.org/t/the-moveit-2-journey-part-0-why-moveit-2/8461"},
{"title": "MoveIt Workshop at ROSCon 2019", "thread_contents": ["The ROSCon organizing committee ", " they will be adding  ", " this year to the program. A hands-on workshop on MoveIt 2 has specifically been requested by Geoffrey Biggs and Victor is pushing for this also.", "I think the most interesting topic to everyone will be a hands-on tutorial using some amount of MoveIt 2.0. This could be a 30 minute introduction talk (while people install missing code/binaries) followed by 2.5 hours of step-by-step walk through of using MoveIt to control a simulated MARA robot (the first ROS 2.0 robot arm).", "Topics we can ideally teach hands on:", "Thoughts / suggestions??", "Thanks,", "\nDave", "YES! All 3 of those topics sound perfect. Although depending on the experience level of the attendees, getting through more than one of those might be hard.", "I would definitely appreciate a tutorial on Task Constructor.", "Perhaps we could even use this time to give a how-to on contributing to MoveIt: identifying an issue / missing documentation, modifying code in a fork’s branch, submitting a pull request with detailed descriptions, etc. ?", "No new ideas, but I second Ian’s idea about contributing to MoveIt, and Jon’s about the difficulty of getting to all of these topics. Perhaps focusing on 2 max would be good.", "Since all these topics could be beneficial to different users, but as pointed out it may be difficult through them all, we could potentially divide the attendees into two groups during the workshop, depending on their experience and priorities. These groups could run in parallel on different topics, rather than consecutively, to make sure everyone gets the most value out of the workshops. We could also record the sessions and make them available after ROSCon for those that can’t attend.", "Thanks ", " for taking the lead and organizing this. Acutronic Robotics will be happy to contribute.", "I think the most interesting topic to everyone will be a hands-on tutorial using some amount of MoveIt 2.0. This could be a 30 minute introduction talk (while people install missing code/binaries) followed by 2.5 hours of step-by-step walk through of using MoveIt to control a simulated MARA robot (the first ROS 2.0 robot arm).", "We’d be happy to participate on this or lead it directly. There’s a high chance that the tutorials could run on a real robot live as well, which will make the overall experience better for the audience IMHO.", "How to use MoveIt “directly” via C++ rather than the MoveGroup abstraction, depending on how far along MoveIt 2.0 development is and ROS 2.0’s new actionlib interface.", "I think this is very feasible by ROSCon.", "Thanks everyone for your feedback, I’ve submitted the workshop proposal together with ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["How to use MoveIt “directly” via C++ rather than the MoveGroup abstraction, depending on how far along MoveIt 2.0 development is and ROS 2.0’s new actionlib interface.", "Demonstrate TrajOpt in MoveIt, assuming our GSoC student and intern this summer are successful in the port.", "Hands-on usage of the Task Constructor, a follow up from Robert and Michael’s talk last year at ROSCon"], "url": "https://discourse.ros.org/t/moveit-workshop-at-roscon-2019/9203"},
{"title": "MoveIt Maintainer Meeting Notes - May 23rd, 2019", "thread_contents": ["Acutronic provided 2 engineers originally, 2 more joined", "Can successfully plan! Can reproduce the first example from the MoveIt tutorials!", "a demo on how to estimate collisions without sensors?", "Launching an alpha release for ROS2 for Dashing makes sense.", "Acutronic is internally considering to contribute further (than just the initial ROS2 port), another announcement in 2-3 weeks", "Qs:", "MoveIt grasps has had a lot of improvements recently, from Reputa (?) Robotics", "Grasp planning (approach, retreat, lift planning)", "Now being actively maintained", "Differences between this an Intel?", "Assumes that everything is cuboid, supports finger and suction graspers", "Used the Schmalz multi-suction gripper, the Robotiq 2-finger gripper", "Tutorial to enable for a new end effector?", "Dave has some ideas, wants feedback", "Having a strong roadmap can get us Funding/Engineering time, add new contributors", "Different Phases:", "Victor: everything realtime gets very complete", "Jon: we should consider making plans that nicely run on realtime controllers", "Could focus ideas by succinctly describing 3-6 well described use cases:", "By realtime, we mean having certain planning components run faster.", "Taking advantage of ROS 2 features", "Biggest weakness of the project: OMPl is a little dissatisfying", "A lot of the concepts in MoveIt are too complex for most industrial arm cases:", "Victor: we need to improve/unify the software architecture diagrams to better understand how MoveIt works between all of the nodes/connections, etc.", "Apologies, for some reason, others couldn’t hear me online at yesterday’s meeting. I would like to update some progress on moveit_example_app.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Jens Petit - GSoC student, studying in Munich, integrating Bullet as a collision checker", "Omid Heidari - PhD student from Idaho State U, intern at Picknik, working with TrajOpt", "Jorge Nicho - SWRI in San Antonio, most internal projects at the moment", "Jon Binney - CTO at Iron Ox, has arms using MoveIt", "Bryce Willey - Realtime Robotics, Mentor for Jens, and OMPL refactoring", "Victor Vilches - port of MoveIt to ROS 2", "Simon Schmeisser", "Henning Kayser - Picknik", "Mike Lautman - Picknik, working on Cartesian interpolation planners, MoveIt Grasps", "Nathan Brooks - Picknik, Codeowners effort", "Gijs", "Andy McEvoy - PickNik", "Dave Coleman - PickNik", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "aiming to get some traction towards Dashing pre-release", "\n", "\n", "\n", "Release it from the fork at Acturonics", "not enough time to get everything into the ros-planning main repo", "don’t want to impose on MoveIt maintainers before the complete port is finished.", "releasing a docker with everything", "support for 18.04 and OSX (definitely by the next 31st)", "still a lot of work to do", "Try it out ", ": any criticism is welcome", "\n", "\n", "\n", "\n", "\n", "What does Window’s support look like:\n", "Not sure, no one present had extensive Windows experience", "OSX support involved a lot of CMakeLists.txt changes (linking and compilation)\n", "minor changes elsewhere", "\n", "\n", "Did ROS2 have everything there that we needed?\n", "Short answer: No.", "Acutronic is compiling a list of known issues", "Parameters weren’t working at the beginning, actions have a lot of issues", "FastRTS is okay with parameters, but memory leak in in ros_wmd makes some parameter fetching makes things buggy", "MoveIt is definitely a good battleground for testing ROS2", "Acutronic still had to port several external dependencies outside of MoveIt as well", "\n", "No debian files for release, just the docker hub image", "\n", "Dave submitted an application for MoveIt workshops on the MoveIt Task Constructor and MoveIt 2.0", "Victor with be organizing the 2.0 workshop", "Volunteers will be needed to help run the workshop", "Jens Petit is integrating Bullet as a collision checker in MoveIt, for continuous collision detection in MoveIt.\n", "Current status, just beginning, but progressing", "\n", "Omid Heidari: doing TrajOpt as a new motion planner. Moving from TrajOpt_ros (tesseract planning effort)\n", "To use Jens’s work for collision detection and integrate into TrajOpt", "Has added an empty template planner, now starting to move TrajOpt in", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "No machine learning, a simpler, more lightweight approach", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "After MoveIt 2 in Beta, a refactor to look more like navigation 2", "Then a new focus on determinism\n", "TrajOpt, stopping OMPL from giving you random looking plans", "\n", "Making MoveIt realtime control ready", "What are the big needs of MoveIt?", "\n", "\n", "\n", "We should consider if we want to do things fast, that gets in the way of determinism sometimes", "making layer 2 up to layer 7 of the OSI stack deterministic would be the first part of this", "\n", "\n", "\n", "\n", "\n", "Pick and place", "Research on a mobile robot", "planning to have a meeting outside of this one to brainstorm use cases for motivating the future roadmap", "\n", "\n", "\n", "1Khz controllers", "replanning 100Hz closed loop", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "MoveIt simple by Shaun Edwards", "In the MoveIt survey, a lot of people use Industrial arms", "\n", "\n", "\n", "should work on moving some of these graphs over, they’re pretty great", "\n", "Should we open the meeting to everyone who wants to be in it?\n", "originally, the purpose of this meeting was to keep everything alive, a small, once a quarter, intimate discussion on what to do", "Now has expanded to once monthly, more maintainers have been added recently", "Google Hangouts has a limit of 10, that we hit recently, but we’re now doing Google Meets, which could support up to 50 people", "we don’t want beginner users asking questions during this meeting, stick to the agenda", "usually about 1/2 agenda items are larger PRs under debates", "None opposed, will start announcing and linking the meeting to the public at large.", "How do we relate to the recently created ", "?\n", "group all projects not necessarily in Moveit but are still relevant to manipulation.", "manipulation is focused soley on ROS2 however, so both meeting should be around.", "having an overall joined discussion would be nice, so consider stopping by the manipulation group", "\n", "\n", "Clang-tidy slow down (Andy Z and Robert H): neither were present", "Applications webpage update (Yu Yan): Yu was on call, but wasn’t responding, not much progress recently", "Drafted a new page on ", ", the ", " is ready.", "Prepared a repo with an application and its tutorial added. A app tutorial template is also included so that a new app tutorial can follow the similar structure. Currently, the repo is still internal. The first app demonstrates how to use ", " with MoveIt pick and place pipeline. The app can run in simulation with recorded point cloud and environment setup. If the user has the same robot arm and gripper, it can also run on a real robot.", "Still preparing the docker images and CI test for the project. The plan is to make a mechanism that new app can be added in a similar way."], "url": "https://discourse.ros.org/t/moveit-maintainer-meeting-notes-may-23rd-2019/9281"},
{"title": "MoveIt 2 journey: first demonstrator in ROS 2, planning to a joint-space goal", "thread_contents": ["The MoveIt motion planning framework is an open source software for motion planning, manipulation, 3D perception, kinematics, control and navigation. It is built on top of the Robot Operating System (ROS 2) and altogether, remains the third most popular package in the ROS world.", "MoveIt provides an easy-to-use platform for developing advanced robotics applications, evaluating new robot designs, and building integrated robotics products for industrial, commercial, R&D, and other domains. MoveIt 2 is the ROS 2 version of MoveIt.", "MoveIt 2 simplified architecture diagram. Inspired by ", " and ", "This is the third of a series of articles that describe our learning experience and contributions with the MoveIt 2 and ROS 2 communities. The complete series is listed below:", "In this third part we present the a first demonstrator of the capabilities of MoveIt 2 by showing how to plan to a joint-space goal and how to reproduce it.", "Our team has prepared a first demonstrator that  allows to  ", " . In a nutshell, we make use of the  ", "  ported package which allows to make an easy trajectory from point A to point B with a simulated instance of ", ".", "In the sections below we describe the different steps of the demonstration.", "The first thing we do is launch the simulation of MARA (refer to the ", ") which we ", " a few months ago resulting in something like:", "The ", " were created for ROS 2.0 Crystal but our team has confirmed that they should be valid also for the upcoming Dashing release. Text and instructions in the MARA repository is expected to be updated in the coming weeks.", "MARA modular robot simulation with Gazebo. Refer to ", " for more.", "The  ", "  package (or  ", " ) is the primary node provided by MoveIt 2 and according to the ", ":", "serves as an integrator: pulling all the individual components together to provide a set of ROS 2 actions and services for users to use.", "  is the  ", "  that allows connecting together the  ", "  and the  ", "  in a manipulator using ROS 2. It can be pictures as follows:", "  node needs to be  launched independently (though often automated as part of a launch file or script we just do it manually for this first tutorial) and offers different ", ":", "MoveIt 2 capabilities (also referred as plugins in the MoveIt! official documentation) are defined ", ". In this first demonstrator we will be using ", ". This ", " allows to compute motion plans via a ROS action.", "  requires certain parameters so we go ahead and launch a ROS2 node that exposes those parameters while using the MARA modeling files as arguments (available at ", " at the time of writing).", "At this point, we have  ", "  node launched and configured with the right parameters to operate with the MARA robot. Next is to launch the appropriate controller for MARA which we open sourced and made available at ", ". Pretty simple for now, right? We’ll be building on top as we keep up porting more parts of MoveIt 2 :).", "If you’d like understand how simple is to control MARA in ROS 2, have a look athttps://github.com/AcutronicRobotics/mara_ros2_control/blob/master/src/FollowJointTrajectoryAction.cpp", "We launch the  ", "  to enable the controller for MARA simulation. With this, we have most parts of the MoveIt 2 framework launched and ready for a simple plan to execute. Let’s do that in the next step.", "This is where we indicate MARA what to do using the ", "  (C++ API) and particularly, the ", " capability. Let’s analyze the code that does so:", "complete source code is available athttps://github.com/AcutronicRobotics/mara_moveit_tutorials/blob/dashing/src/move_group_interface_tutorial.cpp", "We first include all the corresponding headers required to make use of MoveIt 2 capabilities:", "MoveIt 2 operates on sets of joints called  ", "  and stores them in an object called the  ", " . Throughout MoveIt 2 the terms  ", " and  ", "  are used interchangably.", "The :move_group_interface: ", "  class can be easily setup using just the name of the planning group you would like to control and plan for.", "We will use the :planning_scene_interface: ", "  class to add and remove collision objects in our “virtual world” scene", "Raw pointers are frequently used to refer to the planning group for improved performance.", "Let’s now get some basic information. We can print the name of the reference frame for this robot.", "and also print the name of the end-effector link for this group.", "From this point on, we kick off the demonstrator and plan to a Pose goal.", "\nWe plan a motion for this group to a desired pose of the end-effector.", "Now, we call the planner to compute the plan and visualize it. Note that we are just planning, not asking move_group to actually move the robot.", "We skip the visualization of the planning here since it’s simply not ready just yet. Instead, we jump ahead into the execution of the plan. We will set a joint space goal and move towards it. This will replace the pose target we set above.", "To start, we’ll create a pointer that references the current robot’s state.  ", "  is the object that contains all the current position/velocity/acceleration data.", "Next get the current set of joint values for the group.", "Finally, let’s modify one of the joints, plan to the new joint space goal and visualize the plan.", "We’ve prepared an environment that lets you reproduce it. See the next section if you’re interested.", "Below, we provide instructions on how to reproduce the first demonstrator. The instructions assume you’re working in  ", "  and already have a  ", "  installation (", ") as well as  ", " :", "Full instructions on how install MARA simulation are available ", ". You can quickly get up to speed with:", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["first demonstrator in ROS 2, planning to a joint-space goal ( ", " )", "[1] ", "\n"], "url": "https://discourse.ros.org/t/moveit-2-journey-first-demonstrator-in-ros-2-planning-to-a-joint-space-goal/9301"},
{"title": "MoveIt 2 journey: sensorless collision detection with ROS 2", "thread_contents": ["The MoveIt motion planning framework is an open source software for motion planning, manipulation, 3D perception, kinematics, control and navigation. It is built on top of the Robot Operating System (ROS 2) and altogether, remains the third most popular package in the ROS world.", "MoveIt provides an easy-to-use platform for developing advanced robotics applications, evaluating new robot designs, and building integrated robotics products for industrial, commercial, R&D, and other domains. MoveIt 2 is is the ROS 2 version of MoveIt.", "MoveIt 2 simplified architecture diagram.", "This is the fourth of a series of articles that describe our learning experience and contributions with the MoveIt 2 and ROS 2 communities. The complete series is listed below:", "In this fourth part we present the demonstration of a sensorless collision detection system for the MARA modular robot using some of the  ", "  submodules of MoveIt 2. The whole system is based in ROS 2 and has been tested using the Dashing Diademata pre-release while leveraging the real-time capabilities that our team is developing as part of the ", " communication bus for robots.", "In this demo we show a simple MoveIt 2 program that moves the second joint of MARA between ±90º and stops-and-changes the direction when a collision is detected.", "Collision detection is a pre-requisite for safety certification. This is specially relevant for collaborative robots as detailed in ISO 10218-1. Literature describes different ", " for safely operating robots. The selected method for collision detection often depends on different factors such as available sensors, data, costs (expenses), complexity and required sensitivity.", "For this demonstration, we will use the ", " from Han’s Robot, one of our partners. These hardware modules, each, has its own position, velocity and torque sensor. All these values are available directly in ROS 2 thanks to the ", " which is attached to each Modular Joint and ensures deterministic, secure and safe robot communications. Moreover, the SoM allows to detect collisions on each individual joint which further enhances the capabilities of the overall system and reduces the reponse time.", "For the software implementation, we will be reusing existing submodules of MoveIt 2. In particular, MoveIt 2 includes a ", " which provides a way to calculate the torque values of each joint based on the kinematic parameters and the model of the robot.", "With all these tools and hardware available, we implement a method for collision. In the sections below we explain general concepts about sensorless collision detection (including the importance of friction models) and then, describe the selected method: detection by estimating the external torque at every moment in time (comparing real torque with the estimated one).", "Sensorless collision detection methods consist on estimating external torques applied to the robot. By monitoring the external torque it possible to detect if the estimated torque corresponds to an undesired collision.", "Sensorless methods are typically based on measuring the current of each motor and inferring from it the torque of each joint. Depending on the transmission mechanism used by the motor, friction should be taken into account. The simplest methods use the measured torque of the motors and more complex methods take into account the robot dynamic to achieve more accurate detections.", "In this case, a method based on directly estimating the external torque in each joint has been selected. To implement this method it is necessary to have the following points: current measurements of each motor, a friction model of the Harmonic drives, kinematic parameters and a dynamic model of the robot.", "MoveIt 2 architecture diagram highlighting  ", " , wherein the  ", "  module used in this demonstrator lives.", "To estimate the torque due to the internal status of the robot we make use of the  ", "  module inside  ", " . The dynamic solver calculates the required torques given a joint configuration, velocities, accelerations and external wrenches acting on the links of a robot.", "Torques calculated by MoveIt 2 are compared with the joint torques (τjτj). The difference between these torque values can be used to estimate the external torques applied in each joint. Resulting difference signal is used as a collision detection signal. Then, different criteria could be used for collision detection. For example using some filter or based on the change rate. In this example we use a simple threshold criteria; if the signal exceeds a certain value we interpret this as a collision.", "Notice that, as there is noise in the signal due to the velocity and acceleration, and calculations errors, there is a compromise between having false positives and achieving high sensitivity when setting the threshold. In this case we set a threshold in 15 Nm. If the threshold is exceeded, we call the stop command on the MoveIt 2  ", " .", "In the plots below we observe a comparison between the joint torque ( τjτj ) and the torque estimated by the MoveIt 2 dynamic model. On the left side we observe the recorded data for a no collision case when moving the joint 2 of the manipulator from -90 to 90º. On the right side we observe the same case but with a collision. When the External Torque (τeτe) exceeds the configured threshold (15Nm) we detect the collision and the robot is stopped.", "Comparison between real and estimated torques with and without collision.", "In conclusion, thanks to the fact that each module provides data such as torque, position, velocity and acceleration, it is pretty straightforward to compute the external torques by using the MoveIt 2 dynamic solver. Also, the  ", "  play an important role here because the  ", "  and stop command must be performed under  ", " . This approach would simplify greatly the deployment of collaborative robots under ROS 2 ecosystem.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["sensorless collision detection with ROS 2 ( ", " )", "[1] ", "\n"], "url": "https://discourse.ros.org/t/moveit-2-journey-sensorless-collision-detection-with-ros-2/9329"},
{"title": "MoveIt Survey 2019 Results", "thread_contents": ["In celebration of the MoveIt 1.0 release, we requested feedback from the community via a new MoveIt survey. The complete results of the 2019 survey can be viewed ", ".", "We were excited to see and would like to thank the 39% of respondents who have submitted PRs to help MoveIt grow and improve. An additional 57% reported they have not contributed yet but would like to.", "We also asked what contributor’s overall experience has been in creating pull requests - 83% have had a moderate to extremely positive experience. We’d like to get that number up to 100% in the future, a challenge I present to myself, all the MoveIt maintainers, and the greater community.", "Checkout the full results in the PDF. Thanks for your participation in this survey and for helping make MoveIt great again.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/moveit-survey-2019-results/9345"},
{"title": "Announcing MoveIt 2 Alpha Release", "thread_contents": ["We’re happy to see there has been a lot progress made in creating MoveIt 2 since the project began in February. Acutronic Robotics dedicated a large engineering effort in collaboration with PickNik Consulting and the MoveIt maintainers to make this possible.", "The goal of this effort was to move fast in creating a minimum viable product port. This MVP is not to be mistaken for a complete port and much of the work has yet to get merged upstream to the ros-planning organization. At the time of writing, the MoveIt 2 Alpha release is capable of planning simple joint-space problems.", "Motivated by this progress and to align with the release of ROS 2 Dashing Diademata, Acutronic Robotics is proud to announce the alpha release of MoveIt 2.", "This release delivers the following:", "Acutronic Robotics has put significant resources into porting the following packages into their fork. These changes will be making their way through code review to be merged upstream as part of this release:", "At the time of writing, the following known issues have been identified and apply to the ROS 2 target distro (Dashing Diademata) creating conflicts with this release:", "Congrats! This is great news!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["ROS 2 distro: Dashing Diademata", "OS support: Ubuntu 18.04 and Mac OS X 10.14 (", " remain)", "\n", " on how to install and test Acutronic’s work by source", "\n", " for MoveIt 2 and ROS 2", "Capability to plan to joint-space goals", "moveit_core", "moveit_fake_controller_manager", "moveit_planners_ompl", "moveit_resources", "moveit_ros_perception", "moveit_ros_planning", "moveit_msgs", "moveit_resources", "ROS 2 actions not compiling in OpenSplice [", "] [", "]", "\n", " affects the launch of the demonstrator from the Docker image.", "Issues with Qt5 in OS X"], "url": "https://discourse.ros.org/t/announcing-moveit-2-alpha-release/9359"},
{"title": "MoveIt 2 journey: announcing MoveIt 2 alpha release for ROS 2 Dashing Diademata", "thread_contents": ["The MoveIt motion planning framework is an open source software for motion planning, manipulation, 3D perception, kinematics, control and navigation. It is built on top of the Robot Operating System (ROS 2) and altogether, remains the third most popular package in the ROS world. MoveIt provides an easy-to-use platform for developing advanced robotics applications, evaluating new robot designs, and building integrated robotics products for industrial, commercial, R&D, and other domains. MoveIt 2 is is the ROS 2 version of MoveIt.", "This is the fifth of a series of articles that describe our learning experience and contributions with the MoveIt 2 and ROS 2 communities. The complete series is listed below:", "In this fifth part we announce the alpha release of MoveIt 2 and discuss the status of the port including the packages ported so far.", "It’s been more than a month since our ", ". Over this period our team has been very busy with much ", " on the port of MoveIt 2. Additional engineers jumped into the fray summing a total of 4 from Acutronic Robotics. Together with ", " and myself (", "), ", " and ", " (our CTO) have been supporting to get everything in place while pushing community contributions upstream[2]. This resulted in a much faster progress and an overall engineering hour count of more than 1300 from Acutronic Robotics!", "At the time of writing, our ", "[1] allows to run some simple examples fulfilling the initial promise we made. Particularly, we now can plan to a joint-space goal!", "Motivated by this and the upcoming release of ROS 2 Dashing Diademata, we are proud to announce the alpha release of MoveIt 2.", "This release delivers the following:", "MoveIt 2 architecture diagram. Note that there’re packages that aren’t represented in this diagram. Inspired by ", " and ", ".", "The following  ", "  as part of this release:", "At the time of writing, the following known issues have been identified and apply to the ROS 2 target distro (Dashing Diademata) creating conflicts with this release:", "This release came out of our fork for several reasons. First, we didn’t have enough time to get all contributions upstream in time but still, thought that an “unofficial” release would give the MoveIt community something to start playing with. With that in mind, by no means, we aim to impose the existing MoveIt! maintainers the weight of supporting you all with MoveIt 2. Instead, we’d be happy to offer limited support to reproduce what’s being announced in this alpha release.", "Second, this release is tightly connected to the first demonstrator we announced in a previous article which fulfills our ", ": \" ", " \". We believed that getting a first demonstrator was a must and thereby, accelerated the speed of the port by relaxing our internal software development practices (as nicely highlighted by Dave ", ").", "Over the following weeks we will have internal discussions on whether we will be able to continue contributing at the same level or differently. We hope to get back to the MoveIt and ROS 2 communities with the same level of commitment but meanwhile, we invite all other parties interested in MoveIt to jump in and contribute.", "We’d like to credit and thank our partners at PickNik for their support aligning our work with the community. Similarly, we’d like to thank Robert Haschke, William Woodall, Dirk Thomas, Tully Foote, Chris Lalancette or Brian Gerkey among others at Open Robotics for their help and input throughout the development and release process.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["announcing MoveIt 2 alpha release ( ", " )", "\n", " : Dashing Diademata", "\n", " : Ubuntu 18.04 and Mac OS X 10.14 (some minor issues detected with OS X and are being fixed)", "\n", "  for  ", "  and ROS 2 (", ")", "\n", "  available for most packages ported", "\n", " on how to install and test our work via a) a Docker container, b) the CI infrastructure and c) directly through the source code (both in OS X and Ubuntu)", "Capability to make  ", "\n", "Co-release of a  ", "  for MARA modular robot (", ")", "\n", "  (", ")", "\n", " (as reported in a previous ", ")", "\n", " ( ", " )", "ROS 2 actions not compiling in OpenSplice ", "\n", "\n", " affects the launch of the demonstrator from the Docker image.", "Issues with rviz2 in OS X ", " ( ", " : fixed)", "Issues with Qt5 in OS X ( ", " :  ", " )", "[1] ", "\n", "[2] ", "\n"], "url": "https://discourse.ros.org/t/moveit-2-journey-announcing-moveit-2-alpha-release-for-ros-2-dashing-diademata/9366"},
{"title": "MoveIt Workshop 2019 Macau", "thread_contents": ["The first annual MoveIt Workshop 2019 Macau will be on Saturday, November 2, 2019, the day after ROSCon. Sponsored by PickNik Consulting, it is an informal day of presentations, panel discussions, and hands-on training of latest MoveIt features from some of the top thinkers in the ROS community. Some topics to be covered include:", "People attending ROSCon and/or IROS Macau will want to attend this one-day event which is being held at the Sheraton Grand Macao Hotel on Saturday, November 2, 2019, from 8:30am - 5:00pm. The MoveIt Workshop 2019 is geared towards experienced and advanced users of MoveIt, but novices are welcome to attend as well.", "Hi, thanks for organizing this Moveit workshop!! I have signed for this workshop a week ago but as till now, i havnt received any confirmation email. I would like to check with the organizer if the workshop is 100% confirmed? Will there be more details on this? It will be helpful to us as attendants which will need to accomodate our travel plan to this. Thanks!!", "i do not think that i can make it to attend, but interested.", "after the workshop, the recorded video is gonna be available?", "thanks", "Thank you for signing up. The workshop is confirmed and you should receive an email from me within the next day to two outlining all the details so that you can make your travel plans.", "Last chance for registration!", "\nSign up for MoveIt Workshop 2019 Macau colocated with ROSCON2019", "For details and signup, see:", "\n", "Were you able to record the event? I would like to review the workshop and see what I missed!!", "We are still working on getting the videos uploaded, thanks for asking ", "Hi all,", "I’m happy to announce we have posted the videos/slides from the MoveIt Macau Workshop. See ", " and ", ".", "I do have some coinciding unfortunate news. Our local vendor of videography/audio at the event notified us that “one of our memory cards was corrupted during the shooting” and that some of the morning sessions was unrecoverable.", "Here are the sessions affected:", "Again we apologize for this and hope that the slides will be shed some light on the topics discussed.", "Rob // PickNik", "Hi Rob,", "\nthanks for sharing. It is bad to hear what happened to our 3 videos.", "\nFor anyone who is interested in my talk, my colleague Joachim gave a similar talk in Stuttgart which you can find here: ", ". And my slides are also available here: ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["MoveIt 2 Progress and Direction", "Intel’s Work on MoveIt and ROS2 Grasping", "Discussing a new Inverse Kinematics plugin API to support constraint-based solvers and velocity IK", "Latest features and research in OMPL and how it relates to MoveIt", "Discussions on what is hard for newcomers?", "MoveIt 2 Capabilities Roadmapping", "Panel Discussion About MoveIt Ideal User", "Hands on with the Task Constructor", "Lightning Round Discussions", "Industrial trajectory generation with pilz_industrial_motion", "ROS-Industrial Manipulation Efforts", "Build Advance Industrial Robot Usages with Intel Open Vino and Movelt", "\nYu Yan- Intel", "The Industrial Trajectory Generation and Python API of pilz_industrial_motion  ​", "\nChristian Henkel - Pilz", "ROS-Industrial Manipulation Efforts, Thilo Zimmermann (Fraunhofer IPA), Levi Armstrong (SWRI), Michael Ripperger (SWRI)"], "url": "https://discourse.ros.org/t/moveit-workshop-2019-macau/10739"},
{"title": "MoveIt Maintainer Meeting - Feb 27th", "thread_contents": ["The next Maintainer Meeting will be ", "Your time zone: ", "Please request here any agenda topics you would like included.", "Real-time meetings by Google. Using your browser, share your video, desktop, and presentations with teammates and customers.", "Meeting ID", "\n", "Phone Numbers", "\n(‪US‬) ‪+1 347-486-5750‬", "\nPIN: ‪644 991 049#‬", "Country-specific phone numbers are available.", "Thanks for the invitation. I think we will be done with the technical parts of merging our pilz planner into moveit (", ") and can then discuss further action points.", "Decide on reasonable default scaling factors for the new feature: ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Execution speed should be low enough to give beginners time to hit the emergency stop if, e.g., IK yielded an inadequate joint solution", "The feature will affect all currently running robot demos that do not explicitly set the scaling factors to ", " beforehand. This is likely quite a lot.", "\nAre we ok with setting the default to very low values and require people to explicitly specify ", " in their joint_limits.yaml if they want acceptable behavior again?", "0.1, 0.2, and 0.5 have been proposed in the thread"], "url": "https://discourse.ros.org/t/moveit-maintainer-meeting-feb-27th/12812"},
{"title": "MoveIt GSoC Project 2019", "thread_contents": ["Originally posted on the ", ".", "We are pleased to announce that MoveIt was reselected for a Google Summer of Code (GSoC) grant through OSRF. GSoC is an international program in which Google awards stipends to students who complete a free and open-source software coding project during a three month period.", "Jens Petit (", ") will be working on a collision checking project this summer in conjunction with another project by Omid Heidari (", ") to add the TrajOpt motion planning library.  Felix von Drigalski (", ", ", ") and Bryce Willey (", ", ", ") will be the primary co-mentors along with guidance from Dave Coleman (", ", ", ") and the MoveIt Maintainers community.", "Collision detection is a core necessity in path planning for any type of robot. Currently, MoveIt utilizes the Flexible Collision Library (FCL) for this", "\ntask. Inspired by the motion planning framework “", "” of ROS-Industrial, the aim of the project is to integrate Bullet as an additional collision checking library into MoveIt. This includes additional new features like continuous collision detection (CCD). CCD is useful as many state-of-the-art path planning frameworks like ", " (TrajOpt) rely on it.", "To see the progress of this effort this summer, follow along ", ".", "We would all like to thank GSoC and Open Source Robotics Foundation (", "), as the sponsoring recipient organization, for making this grant possible and to the mentors volunteering their time.", "We are excited to see the progress made this summer!", "Since Jens got introduced to ROS through a lab course of his robotics master degree at TU Munich in Germany, he has been hooked. Building robots with ROS is at the same time powerful and fun. Jens is excited to contribute to such a popular package as MoveIt and happy to be part of a vibrant community of robotics experts. Besides coding this summer, he can be found  practicing Aikido or hiking in the beautiful Alps.", "Hi, I am Nishant Sachdeva. I am looking to work with you people for Gsoc 2020. I have worked with C++ quite a bit and have recently begun working with ROS. I am a student at IIIT Hyderabad and am currently working with the Robotics Research Lab . I would love to be of any help possible and am willing to learn and work on any and all ends possible.", "My github id is nishant-sachdeva", "Hello Everyone, My name is Vedant Mundheda. I want to work with MoveIt for Gsoc 2020. I have some experience with working on ROS and have done a few projects regarding the same. I also work with C++/C in my college projects. I am a keen learner and am willing to put the hard work for any work assigned.", "Vedant Mundheda", "\nIIIT Hyderabad", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Integrate Bullet as a collision detection library", "Implement continuous collision detection using Bullet", "Tutorial on how to implement additional collision checking libraries into MoveIt"], "url": "https://discourse.ros.org/t/moveit-gsoc-project-2019/9579"},
{"title": "GSoC: Creating a default grasping library", "thread_contents": ["Hi all,", "\nI am a Robotics Master student at TUM in Germany and currently in the process of applying to the GSoC 2019. My project of choice is \"Creating a default grasping library\" for MoveIt! which was proposed by the OSRF.", "While exploring possibilities for the project, a few questions came up:", "\nWhat is the future of the existing ", "? From the contribution, it still seems more or less actively maintained and developed. However, for example a melodic branch does not exist yet. Is there some kind of future roadmap for the package?", "I did some further research on alternative grasping libraries and compiled a list below and ", ". Some of them are not available as ROS packages. Therefore it would need collaboration with the respective authors to integrate them. Do you think this is possible to achieve in the timeframe of the GSoC? Are you aware of any other promising candidates?", "I am open to any other feedback / input to the project!", "Best,", "\nJens", " and ", ", I believe you guys are the right ones to advice.", " I wrote my thesis on a ", " as well .  I can provide the full document if there’s enough interest.", "I am interested in what you did for your thesis if your going to share it", " sure, I’ve placed the full doc and code in this ", "We are about to officially release moveit_grasps, a package we’ve been developing on internally at PickNik for many years. The code is already available in ros-planning org.", "Regarding GSoC, MoveIt experts ", " and ", " are interesting in being mentors for MoveIt this summer. Though I do not believe for this project.", ", thanks for the info. In the ", " entry about GSoC 2019, you (and ", ") are mentioned as a potential mentors for the project idea “create a default grasping library”. But from your answer I am not so sure if you are available as a mentor? Can you clarify that?", "From what I understand, PickNik won’t be mentoring GSoC students this year because they have their own interns coming in. Personally, I would applaud this effort, but I’m not sure I would be a helpful mentor on this topic, since I am not too deep in grasping.", "If you are interested in manipulation however, there is a project I would be happy to mentor involving the planning scene and collision checking. There are a few directions the project can be extended in, so you could leave your mark on something that suits you. You can find the details below. The text will go on the OSRF wiki shortly, too.", "Feel free to ping Bryce or me if it’s up your alley.", "The following two GSoC projects focus on porting changes from ", " (", "), which has implemented some features that would be valuable additions to MoveIt. The projects are excellent opportunities for students to dive into and extend MoveIt, and making an important contribution without needing to do all the work from scratch.", "I would also be available as a secondary mentor for those two proposals (Improved collision checking and TrajOpt)", "I would be very interested in working on one of the proposed topics ", ", preferably the first one. A few questions came up:", "Short answer: We will wrestle the dragon and change the API too ", "Long answer: The necessary API changes are not so big that they will break MoveIt. If I remember ", "’s explanation correctly, it was a combination of time constraints and external factors that made Tesseract end up as a separate fork. He can correct me if I’m wrong, but you can read that phrase as “too big to maintain reasonably sized PRs while developing the new functionality at full speed”. There was agreement in the maintainer meetings that the features will be welcome and possible to merge.", "Yes, the idea is to adapt the feature from Tesseract to MoveIt. I believe there are some abstractions to be done rather than using Bullet directly though.", "If you want to discuss the details, maybe we should take this to a Github issue? Anyone else who is interested can join us there. We imagined this as a 2-person project, if we can find enough hands.", "Thanks for all the feedback so far, I started a follow up discussion as an ", ".", "It looks like ", " was convinced to look into one of Felix’s proposal, and I agree this is probably a better topic for GSOC than the one this thread is about. A request for convex shape representations and maybe a better abstraction for Collision checking plugins, that allows for using Bullet or FCL can be better defined beforehand. Though, I would advise to make continuous collision checking and Bullet-support fully independent items for now.", "\nThe whole proposal also requires a lot of insight into how things work behind the scene. ", "I wanted to add a quick follow-up to the original question, in case anyone reads this later on.", "\nThere is basically two sides to “a grasping library”. Applicable research (agile grasps, gpd, pointcnn, gqcnn, …) usually focuses on ", " of grasp points. Some of the usual problems in making them “default” are", "On MoveIt’s end the next questions though is how ", " through this grasp point that actually grasps the object - and how to make errors in this process transparent.", "\nIn the recent past there has been quite some work (including a GSOC project last year) on ", ", and also on ", " to get robust tools for the latter part.", "Hi ", ", adding to ", "’s answer about grasping:", "\nThe melodic branch of MoveIt Grasps has been added and the release version should be finalized the next days. Currently, the package supports sampling of top and side grasps for cuboid objects using finger or suction grippers. The grasp planner computes approach, grasp, retreat and lift motions that can be executed sequentially. I think this approach could be used as the default grasp planner, at least if we add support for other primitive shapes or even meshes.", "However, I would vote for implementing some high level pick and place pipeline/capability.", "\nSince grasping and placing often go hand in hand it would really make sense to setup a multi-stage-planner with MTC. This way we could use a default grasp generator (i.e. moveit_grasps) but still allow integration of other more sophisticated or experimental grasp libraries.", "Thanks for the info ", ", good to see new features for grasping in Moveit - for GSoC however, I decided to apply for the topic proposed by ", ".", "Hi everyone,", "My name is Ayush Garg. I am a graduate student at Northeastern University with a major in Robotics. I am really excited to see MoveIt participating in GSoC this year again. I would like to contribute in the MoveIt Grasps project. Is it being considered this year?", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["haf_grasping ", "\n", "agile_grasps ", "\n", "Simple grasping ", "\n", "Grasp Pose Detection ", "\n", "Amazon Robotics Challgene - MIT / Princeton Team ", "\n", "Grasp Quality CNN ", "\n", "Generative Grasping CNN ", "\n", "List of prerequisities: ROS", "Description of programming skills: C++", "Difficulty level: Medium-high", "List of potential mentors: Felix von Drigalski, Bryce Willey", "Detailed Description: This project should add many useful and necessary features to MoveIt’s collision detection, including:\n", "Continuous collision checking, to avoid collisions between discrete states", "Optimizations to the collision checking process itself to improve performance (cache/scene reconstruction improvements, convex-convex collisions)", "The ability to dynamically change large parts of the kinematics of the world (i.e. picking up a tray with many items should attach all of those items to the robot, not just the tray).", "Integration with different collision checking libraries, such as Bullet", "\nNext to API changes, this includes writing tests and tutorials.", "\n", "List of prerequisites: ROS, some motion planning background", "Description of programming skills: C++", "Difficulty level: Medium", "List of potential mentors: Bryce Willey", "Detailed Description: MoveIt was designed to be highly plugin-based and is able to support many different planing libraries, as seen with last year’s GSOC addition of ", ". A next good candidate to be added to MoveIt is the TrajOpt planner. The changes made in the collision checking project (see above) will allow the TrajOpt planner to be added to MoveIt.\n", "Assist with implementing features critical for TrajOpt, such as collision checking, including convex-convex collisions and continuous collision detection (see above)", "Add TrajOpt as a library to be used in MoveIt", "Add adapters that allow TrajOpt to post-process paths produced by other planners", "Write Moveit tutorials and tests for TrajOpt motion planning", "\n", "In general, the project is about taking features from Tesseract and porting them to MoveIt. Therefore, should the new features like continuous collision checking and convex-convex collisions be adapted from Tesseract and use Bullet?", "In the Tesseract website it is stated that implementing TrajOpt ultimately resulted in not using MoveIt but instead developing the new lightweight motion planning framework Tesseract because the API changes to MoveIt would have been too big. How do we deal with this issue in the project?", "they usually work best (or at all) with a specific sensor", "they depend on unpackaged or hard-to-package machine learning libraries"], "url": "https://discourse.ros.org/t/gsoc-creating-a-default-grasping-library/8521"},
{"title": "About the MoveIt category", "thread_contents": ["Welcome to ", "'s new home for project announcements, future roadmaps, releases, and high level questions. ", " For user questions, please post on ", " and tag with ‘moveit’ - all off topic questions will be deleted from this Discourse category.", "Join the discussion here if:", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["You use or are interested in using MoveIt! and want to hear the latest updates and changes in the community", "You are interested in creating a major new feature and want to get feedback", "You want to learn more about becoming a tester, developer, or maintainer of MoveIt!"], "url": "https://discourse.ros.org/t/about-the-moveit-category/263"},
{"title": "MoveIt! migrating from Google Groups to Discourse", "thread_contents": ["Welcome to ", "'s new home for project announcements, future development roadmaps, releases, and high level community discussion. ", " For user questions, please post on ", " and tag with ‘moveit’ - all off topic questions will be deleted from this Discourse category.", "This forum replaces the now deprecated ", " but you are welcome to search its archives for past discussions and answers.", "Join the discussion here if:", "The MoveIt! conversion from Google Groups to Discourse should now be complete (this is the test). The old moveit users Google Group should now be read only.", "Existing topics are not auto watched. I’ve manually watched this one and testing again. New topics should be auto watched.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["You use or are interested in using MoveIt! and want to hear the latest updates and changes", "You want to make community announcements about MoveIt!", "You are interested in creating a major new feature and want to get feedback", "You want to learn more about becoming a tester, developer, or maintainer of MoveIt!"], "url": "https://discourse.ros.org/t/moveit-migrating-from-google-groups-to-discourse/4334"}
{"title": "MoveIt! future release plan for ROS Lunar", "thread_contents": ["MoveIt! maintenance team is planning to “freeze” future releases for Lunar. If you have any opinion, please let us hear your opinion at ", ".", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/moveit-future-release-plan-for-ros-lunar/4807"},
{"title": "No root/virtual joint specified in SRDF. Assuming fixed joint (Moveit Indigo)", "thread_contents": ["Hi,", "\nI have worked with moveit without problem, but recently I have to changed my computer and I install ROS Indigo and Moveit for Indigo distro. The problem is that now moveit setup assistant it’s not read correctly the urdf of others packages that are correct.", "First problem, I used ", ".", "For make the package again I used ", "  and I select the urdf in the folder urdf on package motoman_sda20d_support.", "setting /run_id to f517e7f0-59ea-11e8-9c9a-a0a8cd822c0b", "\nprocess[rosout-1]: started with pid [31326]", "\nstarted core service [/rosout]", "\nprocess[moveit_setup_assistant-2]: started with pid [31329]", "\n[rospack] Error: no package given", "\n[librospack]: error while executing command", "\n[ INFO] [1526572649.947455641]: Loaded motoman_sda20d robot model.", "\n[ INFO] [1526572649.947600517]: Setting Param Server with Robot Description", "\n[ INFO] [1526572649.961034554]: Robot semantic model successfully loaded.", "\n[ INFO] [1526572649.961110429]: Setting Param Server with Robot Semantic Description", "\n[ INFO] [1526572649.981877619]: Loading robot model ‘motoman_sda20d’…", "\n[ INFO] [1526572649.982247870]: No root/virtual joint specified in SRDF. Assuming fixed joint", "\n[ INFO] [1526572651.022997593]: Stereo is NOT SUPPORTED", "\n[ INFO] [1526572651.023095545]: OpenGl version: 3 (GLSL 1.3).", "\n[ INFO] [1526572651.128190716]: Loading Setup Assistant Complete", "\n[ INFO] [1526572651.152648860]: Loading robot model ‘motoman_sda20d’…", "\n[ INFO] [1526572651.152718358]: No root/virtual joint specified in SRDF. Assuming fixed joint", "This a print of my previous computer, I used ", " with the same package.", "I have searched in different forums and groups but nothing has helped me solve this. If someone can support me, I would really appreciate it. Thanks.", "First of all, this type of question should be asked in ROS answers.", "\nSecond, have you tried removing the build and devel folder, and building it again. And you can also check with any kind of link in your generated files.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/no-root-virtual-joint-specified-in-srdf-assuming-fixed-joint-moveit-indigo/4812"},
{"title": "MoveIt! Maintainer Meeting Recap - May 29th, 2018", "thread_contents": ["Progress releasing ROS Melodic", "Extending MoveIt! messages", "GSoC - we have three students!", "Cartesian path planning in MoveIt!", "Python interfaces", "Adding/updating maintainer list", "Google C++ style", "Backporting TF2 Changes (Ian)", "World MoveIt! Day", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Progress releasing ROS Melodic", "GSoC - we got three students!", "Cartesian path planning in MoveIt!", "Python interfaces", "Adding/updating maintainer list", "Google C++ style", "World MoveIt! Day", "Michael ‘v4hn’ Görner", "Robert Haschke", "Isaac IY Saito", "Jorge Nicho", "Dave Coleman", "Ian McMahon", "Bence Magyar", "Gijs van der Hoorn", "Mike Lautman", "Levi H. Armstrong", "Akiyoshi Ochiai", "May 23rd first official release (v0.10.1), but its still in beta", "Two warnings remain", "Melodic is not stable", "OMPL has changed its version number and we need to adapt to it", "Still need to release Kinetic again, as well as Indigo and Lunar", "Need to announce in blog posts", "Update MotionPlanRequest with new constraints", "Joint trajectories", "Cartesian trajectories", "Will debate this further in a PR proposal", "Quick updates on their status", "Overall going well", "Move Cartesian capabilities out of RobotState", "Perhaps convert to its own planning plugin", "Descartes integration - a MoveGroup capability - coming online", "Another new Cartesian plugin is being developed by an undisclosed team", "Use boost:python to cleanup code", "Move python wrappers to each coresponding folder", "Change folder structure to follow best pratices of python", "Add Mike Lautman (PickNik), he has been very active on the Cartesian planning", "\ncapability and the new tutorials", "Continue using clang-tidy to modernize codebase", "When ROS style guideline does not address it, default to Google style", "ROS 2.0 is much truer to GSG", "Depending on Melodic changes in RVIZ.", "Offical date is October 25th!", "Need to create blog post", "Newcomers should work on tutorials and create issues on things that are", "\nconfusing/difficult.", "Prepare more materials for how to organize a World MoveIt! Day to help", "\norganizers."], "url": "https://discourse.ros.org/t/moveit-maintainer-meeting-recap-may-29th-2018/4934"},
{"title": "Hackathon Call-up", "thread_contents": ["Design Workshop Based on Autodesk Generative Design", "\nHi All. There is a design workshop/hackathon in mid-August in Guiyang China. It gathers designers and design engineers to collaboratively design next-generation self-driving car through generative design approach and then manufacture the design out in digital fabrication way. Free meals and accommodation, also flights reimbursement. It’s a great event for creative designers skilled in digital design and fabrication stuff. Anyone interested to join?", "\nDetails as below:", "PIX Generative Hackathon", "\n-Design for Additive Manufacturing", "\nEnvisioning a future where car designs are created by innovative designers in a way that hasn’t been thought before.", "WHAT: Design self-driving cars which can meet the additive manufacturing capacities by using generative design approach.", "\nWHO: Designers and design engineers. Industrial designer, parametric designer, mechanical design engineer, architect, interdisciplinary designer (Free accommodation and meals will be provided, also reimbursement for flights)", "\nWHY: PIX Generative Hackathon aims to reimagine how cars are made and explore new automobile manufacturing paradigm with creative digital design approaches and new digital manufacturing processes, further driving innovation in the automobile industry and lighting a beacon for next-generation manufacturing.", "\nHOW: Design collaboration, fabrication workshop, social parties, keynote speech, mentor communication and local exploration", "\nWHEN: August 18-22, 2018", "\nWHERE: PIX Factory, Guiyang, Guizhou, China", "More info on the website: ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/hackathon-call-up/5550"},
{"title": "New MoveIt! Inverse Kinematics Plugin", "thread_contents": ["I started creating a kinematics plugin for a new analytical inverse kinematic library [1] implemented by ", ". At the moment it seems to be working, but way to slow [2]. It only does forward/inverse kinematics and you have to specify the geometric parameters in the ", " config file.", "Overall, I had no idea what I was doing. I copied the template from the existing srv_kinematics_plugin [3] and added functions from another package [4] to interface with the inverse kinematics solver.", "\nYou can follow the progress by going through the issues on Github [5].", "If anyone is interested in using this plugin, feel free to create issues or pull requests.", "Thanks, ", " for suggesting this plugin [6].", ", ", ", ", ", ", ", ", ", ", "(I think it could be interesting to add some MoveIt! tutorials focussed on writing plugins like this an others. But that’s a discussion for another topic maybe…)", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/new-moveit-inverse-kinematics-plugin/5576"},
{"title": "How to add a new planner in OMPL and use it in MoveIt!", "thread_contents": ["Hi", "Does anyone know how to create a new planner in OMPL and use it in MoveIt!. There was a ", " before telling it but it become inaccessible recently.", "Any information related to my topic would be appreciated!", "P.S: My current ROS distribution is Kinetic.", "that may help you", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/how-to-add-a-new-planner-in-ompl-and-use-it-in-moveit/5372"},
{"title": "How to edit PlanningScene collision checking method to add objects to the environment?", "thread_contents": ["Hello all,", "I’ve been using MoveIt! to add an extra constraint during the collision checking process. To do this, I add a rectangular prism to the environment based on the position of the End Effector of my manipulator. I planned on adding the geometry by the method:", "\nprocessCollisionObjectMsg()", "I would call this method from:", "\nvoid PlanningScene::checkCollision(const collision_detection::CollisionRequest& req,", "\ncollision_detection::CollisionResult& res,", "\nconst robot_state::RobotState& kstate) const", "However, checkCollision is const and processCollisionObjectMsg() is not, and thus is uncallable. I am using OMPL (and the default fcl collision detection) to plan my paths. What is a good way for me add a simple rectangular prism into the collision environment ? Note, each rectangular prism should only apply to its respective sample; one sample’s rectangular prism should not affect another sample’s collision checking.", "I’ve found the answer!", "There’s a similar method", "void PlanningScene::checkCollision(const collision_detection::CollisionRequest& req,", "\ncollision_detection::CollisionResult& res,", "\n", ") const", "without a constant robotstate that calls the checkCollision method I mentioned above in planning_scene. RobotState can be altered to include an attached Body, which will be used for collision checking (make sure to call update() on the robot state afterwards).", "I imagine you could create an imaginary link frame if you wanted to add the object to the robot for full robot collision-detection against the primitive.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/how-to-edit-planningscene-collision-checking-method-to-add-objects-to-the-environment/6083"},
{"title": "MoveIt! at ROSCon 2018", "thread_contents": ["Join us at ROSCon Madrid this year to meet your fellow developers, bring your ideas, and ask pressing questions about MoveIt!. There will be several chances to learn more about MoveIt!:", "Talks will be livestreamed and be available later online as videos. ", " will be representing the MoveIt! project this year with a booth at ROSCon running a live MoveIt! demo with Franka Emika’s Panda robot. Stop by and say hi!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["MoveIt! Task Planning\n", "Michael ‘v4hn’ Görner and Robert Haschke", "\n", "MoveIt! Setup Assistant 2.0\n", "Dave Coleman", "\n", "When: Day 1, Saturday Sept 29th during the 10:30-11:00 coffee break", "Where: PickNik’s ", "\n", "How to find us: Use the booth map, look for robot arms, or find ", "\n"], "url": "https://discourse.ros.org/t/moveit-at-roscon-2018/6170"},
{"title": "MoveIt! Maintainer Meeting Recap - Aug 23rd, 2018", "thread_contents": ["Melodic in Kinetic:", "industrial_moveit", "Tesseract", "ROSCon", "GSOC", "World MoveIt! Day", "Website revamp", "ROSCon", "I’ll be around and interested, are there any plans yet? Where and when do we meet? An Email would also be cool if this is going to be not so public", "See you on Friday hopefully", "\nSimon", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Melodic in Kinetic", "Industrial_moveit", "Tesseract", "ROSCon", "GSOC recap", "World MoveIt! Day", "Website revamped", "MG recommends having a separate TF publisher", "Robert is using Melodic in Kenetic", "Stomp is useful", "The collision detection has been integrated", "Constrained IK is not building", "Dave proposes adding STOMP to MoveIt!", "This makes sense as all", "The plan is to separate out the STOMP code into a separate repository", "There is a question as to whether ROS-I or ROS-planning will keep the new repository", "Action item: ROS-I folk will discuss internally and get back to us", "Made changes to the planning scene for convex and non-convex hulls", "Managed to use Bullet for collision checking. This is useful for getting accurate signed distances", "Meeting up for dinner friday night", "Lots of work came out of this", "Bryce is interested in picking up where Raghavander left out", "Dave made a how to guide", "2 months away", "Feedback: Tutorials link in top bar", "Feedback: It looks like the robot is falling off the Ubuntu box", "Feedback: Install from Deb vs install from Debian", "Meeting up for dinner friday night"], "url": "https://discourse.ros.org/t/moveit-maintainer-meeting-recap-aug-23rd-2018/5969"},
{"title": "Moveit Jointspace Constraints and Python", "thread_contents": ["we’ve been doing a bunch of path planning with a ur10 using the standard ompl solver in moveit.", "\nwe can successfully add blocks and planes to the environment to shape the path but really we’d like to be able to add joint space constraints.", "i’ve found this c++ doc. is there such a feature in the python tools? if so, anybody have some example code or reference materials?", "\n", "Or possibly another method for achieving something like the “water glass stays vertical” within a given point to movement???", "setup:", "\ngazebo moveit rviz ur10 ubuntu 16.04 python", "thanks!", "\ndanjo", "This kind of question should be on ", " I think.", "Does ", " solve your problem? The correspondig ", " function exists in the Python MoveGroupCommander.", "This is a cross-post of ", " on ROS Answers.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", "\n", "\n", "\n"], "url": "https://discourse.ros.org/t/moveit-jointspace-constraints-and-python/6311"},
{"title": "World MoveIt! Day 2018", "thread_contents": ["We’re excited to announce that this year’s World MoveIt! Day will be Thursday, October 25, 2018! The event is a day long international hackathon to improve the MoveIt! code base, documentation, and community. We hope to close as many pull requests and issues as possible and explore new areas of features and improvements building off of six years of dedicated work. We will be having several international event locations including:", "Beyond these event locations, you are encouraged to have your own event in your lab/organization/company and video conference into all the other events.", "For more details and to sign up, see the ", ".", "The address on the TORK website is not in Kashiwa. Which location will it be? We could host up to 20 people in our office next to Tokyo University Hongo Campus if this year’s location is not in central Tokyo otherwise.", "Hi, I haven’t noticed this post for a while, sorry.", "We plan to host WMD at Todai Future Center, just in front of the Kashiwa-no-ha Campus station which is 30 min from Akihabara Station, where we already have Baxter, Sawer, Nextage, (Universal Robot) and few other unveiled MoveIt supported industrial robots. We want to make this year’s event for developers. We expect several MoveIt! users who can share their work in this event.", "And I believe WMD is not monopolistic event. It would be nice if you host another event at Hongo. Or you can just participate in ours. Either could be fun ", "It’s more fun to be in a group and connect. If you say access is easy I might join you in Kashiwa.", " will be hosting World MoveIt Day 2018 in our London office as well. More details could be found ", ".", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", ", San Francisco, USA", "\n", ", Boulder, USA", "\n", " / ", ", Stuttgart, Germany", "\n", ", Singapore", "\n", " and ", ", Kashiwa, Japan (held on Friday, October 26!)", "\n", ", San Antonio, USA", "\n", ", New Delhi, India"], "url": "https://discourse.ros.org/t/world-moveit-day-2018/5653"},
{"title": "Google Summer of Code Improvements to Setup Assistant", "thread_contents": ["Submitted by: Mohamad Ayman, Cairo University", "For this year’s Google Summer of Code Project (GSoC) 2018, in collaboration with PickNik Consulting, Open Source Robotics Foundation (OSRF), Dave Coleman, and Andy McEvoy, the Setup Assistant 2.0 has been developed.", "The focus of this research was to improve the Setup Assistant.  The idea was to add more features to the Moveit! Setup Assistant as well as to simplify setting up robots for simulations and other tasks. This blog post will further explain how to simulate your Moveit! Controlled robot in Gazebo using the upgraded setup assistant and act as a tutorial", "A sneak peak at the end result:", "\n", "Say you are using the Panda robot with MoveIt! and you want to see your plan being executed in Gazebo. First open the ", " and load the ", "  package. Then navigate to the ROS Control screen and add the Follow Joint Controllers for each planning group using the “Auto Add FollowJointsTrajectory Controllers …” ", ". Next navigate to the Simulation screen to generate a Gazebo compatible URDF; the Simulation screen adds the missing inertia and transmission elements required by Gazebo. The Simulation screen also adds the ", " plugin to the end of the URDF.", "The outcomes, successes, and key metrics of improvement:", "Instead of writing many configuration files manually, you can now simulate your motion planning in Rviz along side Gazebo by using a few clicks in the MoveIt! Setup Assistant!", "For further reading look at the ", " and ", ".", "\nThe GitHub issue for the project is ", " and an overview of the relationship between simulation, hardware, controllers, and transmissions is ", ".", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/google-summer-of-code-improvements-to-setup-assistant/6659"},
{"title": "Updates for Motion Planners in MoveIt!", "thread_contents": ["Submitted by: Raghavender Sahdev, York University", "One of this year’s Google Summer of Code Projects (GSoC) was the project, “Adding motion planning support for motion planners in MoveIt!”. This project, with coordination with PickNik Consulting, Open Source Robotics Foundation (OSRF), Dave Coleman, and Mark Moll, has been developed for the purpose of improving and extending the currently existing planners in MoveIt!. An existing concept of planning adapters in MoveIt! was used to have a pipeline of two planners running sequentially to provide robust solutions.", "Prior to summer 2018, MoveIt! only had a single stable motion planning library as its core motion planner, i.e. OMPL. As a part of this GSoC project, motion planning support was extended by making other motion planners (CHOMP) more stable and porting STOMP also to be a part of the MoveIt! motion planners family. The MoveIt! part of STOMP was ported from the ", " repository into the ", ". Furthermore, the benchmarking package was made to work with other motion planners in addition to OMPL and its ", " were added. This package provides user the option to visualize quantitatively different parameters (time taken, trajectory length, solved status, etc.) for different motion planners (OMPL, CHOMP, STOMP) in a common environment (with/without obstacles) and make a decision on which planner the user might want to use.", "The concept of Planning Request Adapters was used to implement the usage of multiple planning algorithms to be used together in MoveIt. This enables the user to use motion planning algorithms in a pipeline to produce better trajectories in different situations. For instance the user could specify a start  and a goal location in RViz and then 2 motion planners could be run in a sequence like OMPL followed by CHOMP implying the usage of a CHOMP Optimization planning adapter. So OMPL would produce an initial motion plan which is then used as an initial trajectory guess for CHOMP to further optimize. Likewise, other motion planning pipelines that are possible by using the Planning Request Adapters concept in MoveIt include: (i) CHOMP + STOMP, (ii) OMPL + STOMP; (iii) STOMP + CHOMP; (iv) OMPL +  CHOMP. The first 2 of these involve using the STOMP Smoothing Planning Request Adapter and the later two use the CHOMP Optimization Adapter. The way these planning request adapters can be used is straightforward and is documented in the ", " in ", " repository.", "A video description of different Motion Planners, planning adapters and benchmarking motion planners can be viewed ", ".", "See the full ", " for more details.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/updates-for-motion-planners-in-moveit/6765"},
{"title": "Open Letter to MoveIt! Community", "thread_contents": ["Dave Coleman", "\n8 Nov 2018", "Dear MoveIt Community,", "I’m writing to make some changes to the direction of MoveIt! - let’s shake things up, try new things, and be less conservative in making improvements. I’m doing this because I really care about the role of open source robotics in the years to come. I envision a future where everyone has access to the economic prosperity of robotic manipulators.", "A few weeks ago I attended an open source conference where I led a discussion session I titled “Stability vs Growth: Breaking API”. I presented to the audience of diverse projects a problem I believe we’ve been struggling with in our ROS and MoveIt! community: stagnation and irrelevance. After speaking with many attendees, I came away with the belief that our now 7 year old project is stuck, making only minor incremental progress since Willow Garage shuttered its doors in 2013. Meanwhile, the robotics world has raced forward.", "There are many reasons I believe MoveIt! is facing this innovator’s dilemma, and I want to outline some of them here with the public declaration that we at PickNik intend to change this, with your help. We see an exciting future for MoveIt!, and we believe we can transform it from a stagnant open source project, to a globally recognized platform that enables organizations of all sizes to leverage robotics for their applications. Before I outline the solution, I want to clearly state some major parts of the problem:", "MoveIt! has not yet officially been declared 1.0, yet we maintainers typically take the stance that API should never be broken, even in new distro releases. API must be broken for us to make the progress necessary for major new features like constraint-based planning, underconstrained Cartesian planning, and tighter integration with low level controllers. A recent SwRI effort came to the same conclusion, stating that \"Early on in the process several limitations were found in both MoveIt!’s Kinematics and Collision environment… requiring significant API changes across multiple repositories\" [1]. By not incrementing major release versions, I believe we are severely limiting our ability to innovate.", "The MoveIt! policy has always been to run development out of the latest ROS distro *-devel branch, which I usually create right after OSRF announces the ROS distro as \"released\". This creates the conflict that any user desiring to use the most recent release of ROS will be getting a non-stable version of MoveIt!, or conversely, that the developers are always handcuffed from making meaningful changes to MoveIt!. I believe we need to instead develop out of a proper \"master\" branch, which is occasionally forked for each official ROS distro.", "In the past, I have maintained the assumption, based on general community consent, that requiring any migration effort by users of MoveIt! due to breaking changes between versions should be avoided at all costs. I’ve now come to the conclusion that reasons such as “our company doesn’t have time to deal with the hassles of upgrading” should not be used to discourage open source contributors from improving MoveIt!. Companies building a product have more resources (or promise of them) than volunteer contributors. In order to innovate, I ask we shift our priorities away from stability and more towards growth.", "I believe we can take MoveIt! to the next level of motion planning capabilities by creating a more frictionless experience for contributors to make necessary and important changes to MoveIt!. This can be accomplished through following well-established software development practices such as incrementing major versions of software and working from an actual master branch. The various pain points that will arise in this process can be mitigated via clear communication (i.e. announcements on Discourse) and clear documentation (i.e. keeping the migration guide up to date).", "PickNik is committed to growing MoveIt!: for example we’ve put effort into new tutorials, a new website, and hosting 3 GSoC students this past summer [2]. We’ve set quarterly goals that everyone on our team review MoveIt! pull requests on a weekly basis, and that we find avenues of funding MoveIt! 2.0 (MoveIt! running on ROS 2). We will be working with the other MoveIt! maintainers and the community in addressing the other issues outlined above.", "I ask the community to join us in reviewing pull requests, adding new capabilities, and in being understanding when APIs change in future major versions of MoveIt!. If you disagree with my conclusions in this letter please voice them here, and let’s see if we can have a healthy discussion to find the best outcome for everyone.", "Let’s continue to grow this awesome open source robotic planning framework!", "Sincerely,", "Dave Coleman", "\nPickNik Consulting", "[1] ", "[2] ", "Overall, I think this is a smart move. A stable API is excellent, but more important than anything is the communication of breakage to your users (e.g. semantic versioning).", "“our company doesn’t have time to deal with the hassles of upgrading”", "I assume you won’t upgrade major versions in the same ROS distro, right? So they won’t have to deal with the hassles of upgrading until they also need to upgrade ROS distros. Do you anticipate maintaining release branches so you can potentially backport bugfixes?", "Your questions are topics of ongoing discussions for the whole MoveIt! maintainer team, but I’ll provide my personal thoughts here.", "I assume you won’t upgrade major versions in the same ROS distro, right?", "This is getting trickier now that ROS1 releases are every 2 years. Software likes to develop faster than 2 year cycles, so I think we will need to come up with new release approaches outside of the ROS distro system. ROS originally was released every 6 months, which is fast enough to allow the packages to sync to the distros. I’m not sure what a good alternative is, here’s some ideas:", "I agree that we shouldn’t be breaking a ROS distro except perhaps the latest one.", "So they won’t have to deal with the hassles of upgrading until they also need to upgrade ROS distros.", "The unfortunate consequence of this philosophy is that it requires you to do a major upgrade of your OS to simply get a newer version of a motion planning software. This is a major hurdle to do all at once, but perhaps not worth fighting.", "Do you anticipate maintaining release branches so you can potentially backport bugfixes?", "We already have release branches for every version of ROS that we backport crtical fixes to, including indigo, jade, kinetic, and of course melodic.", "I agree so intensely with your letter and proposal! Coming from other OSS communities I always found disconcerting the way this one in particular deals with backwards compatibility.", "+1", "This is getting trickier now that ROS1 releases are every 2 years. Software likes to develop faster than 2 year cycles, so I think we will need to come up with new release approaches outside of the ROS distro system. ROS originally was released every 6 months, which is fast enough to allow the packages to sync to the distros. I’m not sure what a good alternative is, here’s some ideas:", "I agree that we shouldn’t be breaking a ROS distro except perhaps the latest one.", "I don’t think there is anything stopping you having multiple versions of moveit in a single ROS release. You just need to name the packages appropriately and ensure you prevent two versions being installed at once (or allow it but document how to choose which is compiled against).", "You just need to name the packages appropriately and ensure you prevent two versions being installed at once", "This is another disadvantage of ", " of tiny packages… MoveIt! has at least 32 packages (based on the ", ") so renaming and re-releasing them all to e.g. moveit2_core would be cumbersome but certainly not impossible.", "How independent are all those packages? If they are always used together, then maybe you could make the binary release a single deb. I’m not sure if the build farm or bloom support combining multiple packages into a single deb, though.", "+1", "I found ", " is relevant. I particularly agree with ", " there ", ".", "Utilizing major version helps toward that goal. As noted at the bottom of ", ", MoveIt! uses minor version to differentiate platforms/distros, which limits the version number’s semantics (while the context of each release needs to be clearly communicated as Dave suggests, the clearer semantics of the version number by itself helps a lot IMO). Applying major version (and updating aforementioned version number policy) definitely helps toward better presentation of the software maturity of MoveIt!, which can bring about less confusion about API consistency.", "(And personally as a release maintainer of MoveIt!, better semantics allows better handling of release cycles, which can result in quicker release cycles. Patch/bugfix release may require less caution than feature release does. I apologize for often holding releases unintentionally that may have contributed to stagnancy of MoveIt! (I hope that’s not the case…), but I can see this version policy change will positively affect release handling.)", "(…) Companies building a product have more resources (or promise of them)", "As a (startup) company employee, I’m not sure if I can agree with that particular statement ", "Anyways, lack of guaranteed API stability definitely concerns corporate usage IMO. But there are ways to deal with it, and I’m sure people (not just in companies) have been handling it somehow,", "My last point below is probably for maintainers only.", "The MoveIt! policy has always been to run development out of the latest ROS distro *-devel branch, which I usually create right after OSRF announces the ROS distro as “released”. This creates the conflict that any user desiring to use the most recent release of ROS will be getting a non-stable version of MoveIt!, or conversely, that the developers are always handcuffed from making meaningful changes to MoveIt!. I believe we need to instead develop out of a proper “master” branch, which is occasionally forked for each official ROS distro.", "I assume the proposed plan is to consolidate all (active) ", " branches into a single development branch and remove distro-specific devel branches. +1", "Release maintenance still requires extra branching or any way to differentiate discrepancy per platform (I’m just not sure what the last sentence of cited paragraph points to), as some dependency new features require might not be available on older platform. We can continue in a recently started discussion among maintainers ", ".", "I assume the proposed plan is to consolidate all (active)  ", "  branches into a single development branch and remove distro-specific devel branches. +1", "What we have been discussing in the maintainer meetings is to create ", " master branch where most all new features go. The *-devel branches would remain but only be used for bug fixes after the initial release is made. This will give us the flexibility to improve the code dramatically in the master branch while keeping stability during a ROS release. The open question is how to make releases more often than the ROS distro schedule, which has slowed down to every 2 years.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Everyone builds newer releases from source, using perhaps git tags", "We setup our own debian repositories url like Gazebo does (", ")", "We offer debians for direct download", "Everyone builds newer releases from source, using perhaps git tags", "We setup our own debian repositories url like Gazebo does (", ")", "We offer debians for direct download"], "url": "https://discourse.ros.org/t/open-letter-to-moveit-community/6779"},
{"title": "Online Replanning Through MoveIt! withouth stopping motion", "thread_contents": ["Hello all,", "I am currently working with an lbr-iiwa arm and I am trying to integrate the replanning abilities to our robot.", "Digging into the MoveIt! code I understood how MoveIt! works with the replanning. I am moving my robot with the move() function and getting my obstacle map with octotree", "There is a function plan_execution::PlanExecution::isRemainingPathValid that is constantly checking if the trajectory of my robot is in collision with any obstacle. In case it is, isRemainingPathValid will provide a true, the variable path_became_invalid will be set to true, the trajectory_execution_manager will stop the motion and a moveit error_code MOTION_PLAN_INVALID_BY_ENVIROMENT_CHANGE will be set making the robot to plan a new trajectory.", "What I would like to do is avoiding the robot to stop and replanning considering that the robot is not stopped, but moving forward in the incorrect trajectory.", "I would like to know if somebody knows about any work in this non-stop replanning approach", "I was thinking on something similar to this (1:56): ", "But for a 7 DoF robotic manipulator", "Well, I am working on this topic either.", "\nAnd I notice there is a method(allowReplanning) in class (moveit::planning_interface::MoveGroupInterface).", "\nI overlook into it and realize it’s nothing but a setting on boolean value(Dont’ understand why they apply this though).", "\nMaybe you can try this whether useful…", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/online-replanning-through-moveit-withouth-stopping-motion/5024"},
{"title": "MoveIt! Maintainer Meeting Recap - Nov 20th 2018", "thread_contents": ["Thanks everyone for attending!", "One thing that came to my mind wrt 100+ mails, maybe you could add a filter (in your mail program) that modifies the priority of mails containing your github nick? This way direct pings would still be noticed …", "On a more drastic side I think even following Dave’s (discard all other mails) idea is not that bad as you can still see them in your github inbox, subscribe to PRs you are interested in etc. You will not read those old mails anyway. Better visit the site from time to time and discover something new instead of being constantly overwhelmed.", "I just discovered that if you are mentioned on github (using the @), the mail you get will contain ", " as CC so you can filter for this as well. Or use it to increase mail priority", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["World MoveIt! Day takeaways", "Switching to a master branch", "Making bigger changes to the codebase", "Our next release target - ROS Noetic?", "General release notes - Isaac", "C++14", "Adding new maintainers", "MoveIt! Task Constructor", "Michael ‘v4hn’ Görner", "Robert Haschke", "Jorge Nicho", "Zack Kingston", "Will Baker", "Simon Schmeißer", "Jon Binnery", "Michael Ferguson", "Dave Coleman", "Mike Lautman", "Andy McEvoy", "Nathan Brooks", "Henning Kayser", "World MoveIt! Day takeaways\n", "See ", "\n", "\n", "Our next release target - ROS Noetic?\n", "Release our own debians: setup Buildbot?\n", "Would require to add another ubuntu repo to users’ system", "Must always keep version number newer than ROS buildfarm", "Overlay OSRF packages", "Michael could spin up an image", "Downstream users can’t build on top of that version", "\n", "Option: Build them on the OSRF farm\n", "Modify bloom to put out \"unstable/dev\" packages", "\n", "master branch is extra work load in some regards", "master branch: compile against what?", "has to compile on the last 2 ROS systems", "\n", "Drop Lunar from Docker / CI\n", "Decision: turn off Docker for lunar (", ")", "\n", "Switching to a master branch\n", "Overall consensus is yes", "Undiscussed: when to branch from melodic-devel to master", "\n", "Making bigger changes to the codebase\n", "C++14", "Seems everyone is in favor", "\n", "Adding new maintainers & Reviewing PRs\n", "Make stats more public", "Tool to watch activity", "Most people just slightly touch moveit", "Most of the PRs people don’t know how to address it", "Auto-assign based on modified files?", "Use labels: filter on subject?", "Git hook: add hash tag?", "Outcome: do further research and report back next month", "\n", "MoveIt! Task Constructor\n", "Replacing current pick-place pipeline: will happen in future but not yet", "Structure different type of queries", "Can’t load all the Planners all at once", "Need to add tutorials, screenshot on website", "\n"], "url": "https://discourse.ros.org/t/moveit-maintainer-meeting-recap-nov-20th-2018/6908"},
{"title": "Maintainer Meeting Recap - July 26th", "thread_contents": ["Recap of the meeting from my memory (not actual meeting notes, we forgot to take those)", "Thank you Ioan, Shaun, Jose, and Maarten for joining the call.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Robert Haschke", "Michael ‘v4hn’ Görner", "Ioan Alexandru Sucan", "Michael Ferguson", "Isaac IY Saito", "Jorge Nicho", "Maarten de Vries", "Shaun Edwards", "Dave Coleman", "Next Jade release will fix moveit_ros regression", "Next Indigo release will be ABI breaking so we will have to notify users (safety fixes)", "No exact schedule needed for releasing MoveIt!, but every month email maintainers to discuss whether one is needed/ready", "Fergs will create a ticket about the warehouse_ros plugin that needs help", "Isaac: For every release we’ll send out a brief note to moveit-users that includes API breakage, links to changelog", "Jose: will release FCL 0.5 into Kinetic as ROS package very soon", "Maarten: is heading up making Kinetic branches compatible with Octomap 1.8", "Has experimental repo, and Discourse discussion", "moveit_experimental: add .catkin_ignore and omit from deb release. document this", "moveit_planners: will we be adding in too many dependencies?", "Dave: will try to support merging indigo and jade branches too", "Discussion about whether to change structure more than just copying in folders - easier migration now vs. restructure again in the future", "Timeline: soon after world moveit day do the merge - REVISED: before", "Cherry-picking multiple commits into different branch vs squashing them into one", "Most people seemed to prefer squashing them", "Ferguson: No one-fit-all solution", "Gorner: will create PR will overview of guidelines on moveit website for further discussion", "August 23rd @ Fetch and elsewhere", "See preannouncment email Dave sent out", "Dave: organize list of issues to help with (Shaun: use github milestone)", "Ian: organize documentations list for people to help with", "Dave: announce event to everyone tomorrow (Wed)", "MoveIt! Community Meeting should not be on WMD, but soon after", "Jorge has working STOMP, not CHOMP, will create PR to moveit_planners for STOMP", "Jonathan has working CHOMP", "Jorge catkinized moveit_experimental, also", "Robert has created a move_group unit test  with Fanuc m10’s using ROS Industrial examples!!! Will create PR"], "url": "https://discourse.ros.org/t/maintainer-meeting-recap-july-26th/366"},
{"title": "MoveIt! Package Tracking via Table", "thread_contents": ["I made a new python script to generate an html table that can help us visualize the status of various MoveIt! packages (temporary location):", "It is pretty similar to ROS’s ", " but is better customized for our purposes IMHO, can can easily be further customized.", "I wanted to improve the script that generated our ", " but I realized html was the better route than Markdown so we could control the padding and formatting…", "I need to move it to some central location if everyone likes it where perhaps it will be automatically updated. The code is located ", ". I’ll work on it some more later, let me know your thoughts.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/moveit-package-tracking-via-table/415"},
{"title": "World MoveIt! Day Planning", "thread_contents": ["Here we can discuss World MoveIt! Day planning. See the ", " for details on the event.", "For those curious we’ve updated the section ", " and added an IRC channel: ", " at ", "Happy MoveIt Day!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/world-moveit-day-planning/365"},
{"title": "Joint State Visualization", "thread_contents": ["I’ve been working on simulating the UR10 in Gazebo, simulating the ", " interface with ", " and I’ve been spending a lot of time tuning the controller. To help with that I’ve been using lots of instances of the plot plugin in ", " to plot the joint states of the arm to find position biases, look at the response curve, look for oscillations, and to see if I’m getting close to my effort and velocity limits. I’ve found a few frustrating things with using lots of individual plots, like not easily being able to line up the x-axis scales, having non-descriptive legends (e.g. ", " rather than ", "), and generally taking a lot of steps to introspect an additional part of the joint state.", "So my question is, are there any tools out there that you guys use that make this easier to do? If not, do you guys think it would be nice to have an rqt plugin dedicated to plotting joint states?", "I know this has a little more to do with ROS control than moveit, but it was the closest matching category on discourse.", "I agree, a convenient visualization of Joint State is a tool missing from ROS. To me, it has also been more of a control than a motion planning issue.", "I’d like to add two more nice-to-haves to your already long list:", "First, I often want to switch between different groups of joints I want to plot. De-/selecting 12+ plots is annoying. It would be cool to specify convenient configurations, i.e. left-arm: position + velocities.", "Second, stuff happens fast when tweaking controllers, and often you only figure out what you want to see after a motion happened. Recording a trajectory and then conveniently plotting the relevant parts after the fact seems the way to go for me.", "I’m also curious whether someone has already has a great tool for this. So, thanks for starting this discussion.", "+1 to better GUI for joint state visualization", "I’ve used RQT to plot joint values for a long time, and I’ve never been satisfied with the GUI. (Actually I created the tutorial you’re talking about).", "This might sit next to or within ", "I’ve been using a very hacky script to plot both the goal trajectory and the actual joint values for a given joint controller: ", "Something that plotted those values for more than one joint, and that was more configurable, and that was integrated into RQT would be awesomely useful…", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/joint-state-visualization/405"},
{"title": "Maintainer Meeting minutes - Sep 27th", "thread_contents": ["Community offering welcomed: Today we could have hit a Google Hangout communication issue; the number of participants that free version of Hangout allows is limited to up to 10. Any pro-user who can offer to host a Hangout in the future, we’d like to hear from you. Please hit the reply on this post.", "Notes from previous meeting: ", "Integration tests use rostest (see ", " for an example) defining some .test files,", " will open a PR to open a discussion.", "We’ll utilize these new nice github features.", "Postponed", "post-poned", "Dave plans to coordinate one in October.", "\nSpeakers welcome.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Jonathan Binney", "Dave Coleman", "Christian Dornhege", "Shaun Edwards", "Robert Haschke", "Michael ‘v4hn’ Görner (connectivity issue)", "Ian McMahon", "Isaac IY Saito", "Maarten de Vries", "using ", "\n", "and finally starting some python code that does the unit testing, e.g. ", "\n", "Replaced boost::ptrs to std::ptrs. Work in progress.", "For client code of MoveIt!, there should be no code change in terms of C++11, unless those code specifically used boost::ptrs.", "boost::function can be replaced with std::function", "Open tickets at ", "\n", "API needs to be stabilized too especially because it’s LTS.", "No set date yet for the release.", "Open tickets at ", "\n", "Version number scheme remains the same despite API break this time (the decision is based on the discussion in the ", ")", "PR is opened ", "\n", "This can improve performance (by not parsing URDF multiple times).", "Help on unit testing needed.", "Use moveit-users forum for announcements, and use ", " for technical questions (as general ROS community does).", "Announce in moveit-users once documentation is updated.", "Maarten de Vries joins as maintainer", "Update maintainers in package.xml’s, see current list here: ", "\n", "volunteer for packages here: ", "\n", "Recruit new maintainers (Dave will create a document for it)", "Ian or Ferg can coordinate BoF?", "Ian, Shaun will be present"], "url": "https://discourse.ros.org/t/maintainer-meeting-minutes-sep-27th/534"},
{"title": "Maintainer Meeting Recap - March 7th", "thread_contents": ["Recap of the meeting from March 7th, 2017:", "Thanks to the maintainers who joined the call.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Michael ‘v4hn’ Görner", "Robert Haschke", "Isaac IY Saito", "Jorge Nicho", "Shaun Edwards", "G.A. vd. Hoorn", "Paul Hvass", "Christian Dornhege", "Dave Coleman", "Keep development in kinetic-devel branch as long as possible", "If we have to branch for Lunar, we will also still develop out of Kinetic", "Drop support for Jade, just like the main ROS release will", "Only add bug fixes for indigo-devel branch", "Accept pull requests to kinetic-devel branch that allow for backward compatibility with ROS Indigo", "An exhaustive interface review of the current API is impractical", "Decouple the meaning of MoveIt!'s major version number from ROS 2.0", "Stop using minor versions to indicate ROS release", "Increment major versions more often to indicate API changes", "We desire to integrate ROS 2.0 with MoveIt!, but it is not highest priority", "This effort would require funding and a dedicated full-time developer", "MoveIt! would be a good poster child candidate for pushing the entire ROS community to adopt ROS 2.0", "Desired features include the DDS communication layer and switching our plugin based architecture to nodelets", "We would likely rename MoveIt! to MoveIt! 2.0", "There are still many dependencies we are waiting for, such as URDF 2.0", "Needs further discussion with OSRF team", "Everyone is very excited to proceed with this effort", "Best approach is likely to create a new MoveIt! capability that calls Descartes", "Need to define new ROS message types", "Decided against enabling this feature because it does not solve a current problem and only makes merging PRs more difficult", "MoveIt! applied to the Google Summer of Code through the OSRF parent organization, which was not accepted", "We are still interested in doing some summer code sprints outside of Google", "Funding sources with high potential were discussed", "Our previous montage is dated from 2013", "Paul Hvass will be leading the call for videos along with ROS-Industrial"], "url": "https://discourse.ros.org/t/maintainer-meeting-recap-march-7th/1442"},
{"title": "Moveit for ROS Kinetic", "thread_contents": ["Does ROS Kinetic support Moveit…??", "Yes, it has been released for a while now and works nicely", "Please use ", " to ask questions like this. See: ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/moveit-for-ros-kinetic/1736"},
{"title": "Docker Containers for MoveIt!", "thread_contents": ["tl;dr: Does anyone have experience with Docker containers who would like to setup some for MoveIt! ?", "At our last MoveIt! maintainer meeting I brought up an issue with how difficult it is to test pull requests across different repos and different ROS distros. Maintainer ", " suggested I try Docker containers, as he does, to prevent breaking my local workspace and work in development when testing someone else’s PR. I have been learning Docker the past couple months and have created two example ", " that build MoveIt! from source for both Jade and Kinetic but I think I could use some help and advice on how to go about this. Currently ", " for an experimental merged MoveIt! times out while being built automatically.", "I would like to get a automated image of MoveIt! Indigo/Jade/Kinetic both built from source and perhaps installed from Debian. Does anyone want to lead this up for us? We could create a ", " repo and model it off of ", "Hey ", " ,", "\nI worked on creating the Docker Hub repo for ROS, and would be willing to assist MoveIt! use it as well. Just trying out the Dockerfile you pointed to out locally on my system; seems to be taking it sweet old time during the rosdeb install. No surprise that Docker Hub may time out on it as a measure to prevent the build servers staling from ‘failing’ image builds.", "I think your issue here is that your just missing environment variables, and calling commands from ", ", or in this case ", ". Here is a real hacky fix I made it a few minutes just using the one Dockerfile, but I think you should break out parts of the build into executable scripts, use ", " to get them into the docker build container, then execute them with bash.", "Just finished, with 8 cores and a modest internet connection:", "But I know the DockerHub buildfarm has 32 cores and a better bandwidth to the repo.", " thanks for working on this.", "Are all the funky hacks such as sourcing ros_entrypoint.sh every time really necessary?", "\nCan we make it cleaner somehow?", "\nWill this build fit on the automated Dockerhub build farm also?", "Although I am still unsure how you would incorporate this with DockerHub for continuous integration, as that service is predominantly catered towards merely distribution, and thus may not be suited for testing. Still a fine meanes to share stable or beta releases of intermittent frequency.", " I gave you commit access to ", " in its temporary home. Feel free to skip PRs while we spin up the initial containers.", "I don’t intend to use this for continuous integration, but rather to allow me to pull down a contributor’s PR and test it manually. Perhaps even for testing GUI changes, ", "I talked with ", ", and from that I think I have a better understanding. You’d like to create and use a development image for MoveIt! that includes all the necessary build and test dependencies, then have that image serviced from an automated DockerHub repo, so maintainers and contributors could easlly pull the current base environment and build and test branches in question. Have I got that correct?", "I can see how contributors could use this base dev image to build their PR locally and push the image of the PR to DockerHub to share with maintainers. I think that, if alone by itself, might require a fair bit of confidence that what is tested from the image that the maintainer pulls, is an exact build of the contributors PR, as any intermediate build and push steps might be chance for a misstep.", "Getting GUI’s to work in Docker is not that difficult, I started some wiki pages on that subject last year:", "\n", "\n", "You’d like to create and use a development image for MoveIt! that includes all the necessary build and test dependencies, then have that image serviced from an automated DockerHub repo, so maintainers and contributors could easlly pull the current base environment and build and test branches in question.", "Exactly!", "push the image of the PR to DockerHub to share with maintainers", "I had not thought of doing that, actually. I just want base MoveIt! images ", " that are ready for development, and each contributor can do whatever they like with it from there. One use case is testing PRs locally.", "Good news about the GUI - ", " also just pointed me to his ", "I’ve got the full* set of MoveIt! Docker images ready on Dockerhub - I’m pretty happy with their functionality. I’d like to invite everyone to review the Dockerfile build files, try the images out, and share feedback:", "moveit_docker - Automated Docker images for MoveIt!", "Build Status:", "\n", "My next step is to move the repo to ros-planning/moveit_docker and make this the “official” MoveIt! images - ", "*Note: the Kinetic images are still queued on the server and have not been built yet. WIP.", "MoveIt! has official docker images now available here: ", "MoveIt! has official docker images now available here: ", "URL might have been slightly updated ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Are all the funky hacks such as sourcing ", " every time really necessary?", "Can we make it cleaner somehow?", "Will this build fit on the automated Dockerhub build farm also?", "Some of the sources are unnecessary, It was just copy/pasta. I think the catkin call only requires it.", "yes, I’ll send you a PR with a cleaner approach", "I think it should, I’ve had longer builds before, one where I had to build stuff like PCL from scratch on DockerHub. Size becomes a factor there though. However the build above is only 1.932 GB."], "url": "https://discourse.ros.org/t/docker-containers-for-moveit/280"},
{"title": "MoveIt! Montage 2017 now online!", "thread_contents": ["We’re excited to announce the new video montage is ready, with many morphologies of robots doing various tasks:", "Thanks to Paul Hvass and SwRI in their assistance in putting the montage together.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/moveit-montage-2017-now-online/2079"},
{"title": "Maintainer Meeting Recap - August 15th", "thread_contents": ["ROS 2.0:", "Lunar branch", "World MoveIt! Day", "OMPL replacement interface (Mark Moll):", "STOMP Cost Maps (Bence):", "IK parameters:", "MoveIt! Website face lift", "Agile Grasp Generator", "Pull Requests", "Thanks to all the maintainers who attended the meeting!", "Thanks ", " for the recap!", "Glad to see that ROS 2.0 was on the agenda! I’m dropping a few notes / questions here but I’m happy to continue the discussion on a separate thread to not clutter this one.", "Looking at MoveIt! recently, there seem to be a few changes required for ROS2 that are compatible with ROS1 and can be done on the current development branch:", "Current features used by MoveIt! but not in ROS2 yet:", "Specific ROS 2 changes:", "Questions:", "(I know this is a summary and a good way to have more details would have been to attend the meeting ", " )", "Thanks!", "/cc ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Beginning ROS 2.0 efforts - Ian", "Ending Jade support and forking for Lunar - Isaac", "World MoveIt! Day 2017 - Dave", "STOMP Cost Maps", "Generalize IK parameters", "OMPL Updates", "Agile Grasps", "New maintainers", "New MoveIt! website", "Michael ‘v4hn’ Görner", "Robert Haschke", "Isaac IY Saito", "Jorge Nicho", "G.A. vd. Hoorn", "Dave Coleman", "Ian McMahon", "Bence Magyar", "Jonathan Binney", "Mark Moll", "\n", "\n", "Challenges\n", "Robot representation file to be decided in the future.", "Communication layer", "ROS parameters no supported", "\n", "Action items\n", "Using the bridge as an initial step.  Have verification from OSRF", "Separate branch to be created for changes related to ROS 2.0 transition", "\n", "\n", "\n", "\n", "Create new branch for large feature changes", "Freezing jade", "Continue cherry – picking into indigo, kinetic", "\n", "\n", "\n", "After ROS Con, maybe week after ICRA, tentative date 10th of October.", "\n", "\n", "\n", "Current Features\n", "Planning with Cost functions", "Existing Cost function framework in OMPL", "\n", "In progress features\n", "Hard Constraints (very specific)", "Framework will load new planners that adhere to the ompl interface.", "\n", "\n", "\n", "\n", "Too many Assumptions in both the MoveIt! and STOMP frameworks.", "Fixing start state is limiting.", "Bence to compile list of issues", "\n", "\n", "\n", "Parameters exposure is lacking", "Alternatives include using generic structure with downcasting or passing a function callback", "\n", "\n", "\n", "Setup a Bounty source account for funding this effort?", "\n", "\n", "\n", "Integration in MoveIt! in progress", "No general perception tool in MoveIt! to supplement grasping functionality.", "\n", "\n", "\n", "Maintainers to look at PR list more frequently.", "Four eyes principle for merging unless change is insignificant (e.g. typos).", "Michael’s Remarks\n", "To help distinguish between “bottlenecked” and other requests, I just created a new tag “awaits 2nd review”. Now, if you open ", " you get friendly red highlights on some requests.", "Also please have a quick look at our maintainer side guidelines if you have not read them before:", "\n", "\n", "\n", "\n", "moving to package format 2", "migrate to tf2", "no actions yet (C++ or Python)", "no parameters in Python yet", "pluginlib: class_loader has been ported but not pluginlib yet, it’s not yet sure what plugins api will be like exactly", "no nodelets in ROS 2, all nodes are nodelets (there is almost no nodelets left in MoveIt! but the remaining one(s) will have to be converted to nodes)", "Could you clarify what is in the “ROS parameters not supported” bullet?", "Could you also give more details about the “Communication layer” challenge?", "“Using the bridge as an initial step. Have verification from OSRF” << We can discuss this in more details on the follow-up thread as well"], "url": "https://discourse.ros.org/t/maintainer-meeting-recap-august-15th/2473"},
{"title": "Maintainer Meeting Recap - November 30th", "thread_contents": ["Topics:", "Attendees", "Summary", "Thanks to all the maintainers who attended the meeting!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["World MoveIt! Day recap", "Branching for Lunar", "Task-planning framework", "New website & tutorials", "Contributor code of conduct", "Next release", "ROS 2.0 update", "Michael ‘v4hn’ Görner", "Robert Haschke", "Isaac IY Saito", "Jorge Nicho", "Dave Coleman", "Ian McMahon", "Bence Magyar", "Jonathan Binney", "World MoveIt! Day recap\n", "Overall successful event with 100+ participants", "Issues at various locations regarding setup of computers, teaching brand new users", "A lessons learned document was collected for next year’s event planning", "\n", "Branching for Lunar\n", "No need to branch for Lunar, will just branch for ROS-Melodic", "We are ready to branch whenever, just need a motivational breaking change and someone to put the effort into making the branches", "\n", "Task-planning framework\n", "Robert and Michael have been co-developing a new task planning framework between their two labs", "Uses default MoveIt! components but replaces the unfinished MoveIt! Pick Place pipeline", "\n", "New website & tutorials\n", "Still in process on finding funding for this initiative", "\n", "Contributor code of conduct\n", "Maintainers aren’t thrilled about it but if we can find one that doesn’t hold the maintainers highly responsible one could be merged in", "\n", "Next release\n", "Isaac will be working on this in the coming weeks", "\n", "ROS 2.0 update\n", "Still in the future due to missing ROS Actions (actionlib)", "\n"], "url": "https://discourse.ros.org/t/maintainer-meeting-recap-november-30th/3564"},
{"title": "Announcing MoveIt! Tutorials Codesprint with Franka Emika & PickNik", "thread_contents": ["We are excited to announce that the robotic arm manufacturer Franka Emika is partnering with PickNik to sponsor a MoveIt! codesprint to further improve MoveIt!’s tutorials, documentation, and website. For more details please see the ", ".", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/announcing-moveit-tutorials-codesprint-with-franka-emika-picknik/4069"},
{"title": "Google Summer of Code 2018, Internships, Full Time", "thread_contents": ["Hi MoveIt! Community,", "I’m excited to announce a couple opportunities for MoveIt! developers:", "We are seeking students to participate in GSoC code sprints to improve the MoveIt! code base this summer. We have two sponsoring organizations this year - the Open Source Robotics Foundation and the JSK Robotics Lab, University of Tokyo. Applications open March 12th.", "PickNik Consulting has a position opening for a MoveIt! developer looking for a summer internship. You need strong C++ abilities and some familiarity with MoveIt!. This is a paid position and your responsibilities will include making open source contributions to MoveIt! and ROS. To apply please email jobs@picknik.ai with your resume, code samples, and relevant experience.", "PickNik Consulting is looking to grow its team with a Software Engineer with expert level experience with C++. Please checkout our ", " posting for more information.", "Cheers,", "\nDave", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/google-summer-of-code-2018-internships-full-time/4144"},
{"title": "Maintainer Meeting Recap - March 20th", "thread_contents": ["Branching for ROS Melodic - see ", "New website and tutorials effort - feedback:", "MoveIt! Task Planner", "Cartesian path planning in MoveIt!", "Moving to Discourse", "C++11 auto et. al. in MoveIt", "Future of indigo-devel", "Python interface changes", "ROS 2.0", "GSoC", "WMD Potential Dates", "As some of you know, I’ve been working on compliant manipulations that require real-time Cartesian motions, so I made a Cartesian jogger package. Currently I do Cartesian motions programmatically (vs. teleoperated) by sending ROS msgs (as if coming from a joystick) but I’m definitely interested in getting this integrated with MoveIt. I don’t think it will be tooo difficult either. Advice on where to start?", "Hi Andy - the video looks great and the package idea sounds very much needed. I think this discussion belongs either on a different Discourse topic within MoveIt!, or on Github - your choice. We can discuss further there ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Branching for ROS Melodic", "New website and tutorials effort", "Task planner", "Cartesian path planning in MoveIt!", "Moving to Discourse", "C++11 auto et. al. in MoveIt", "Future of indigo-devel", "Python interface changes", "ROS 2.0 (as always)", "GSoC", "Michael ‘v4hn’ Görner", "Robert Haschke", "Isaac IY Saito", "Jorge Nicho", "Dave Coleman", "Ian McMahon", "Bence Magyar", "Jonathan Binney", "Gijs Vanderhoorn", "Mike Lautman", "Andy McEvoy", "Dave will fork for branches and setup CI", "Jorge will run plugin migration scripts", "Ian will work on tf2 migration", "Python2 will be EOL mid-life of Melodic", "Currently its a loose collection of individual points (needs a storyline)", "Consistency", "Planning for more advanced use cases (more complicated scenarios)", "Additional sensors (kinetic)", "Needs move_group interface API summary", "Heavy development, about to change API again", "Execution module still missing", "Break messages sooner for new functionality", "Discussed different planning methods - we need a plugin interface", "everyone is +1", "Rename current MoveIt! Developers Discourse topic to MoveIt! users", "Gorner will update style guidelines for “auto” usage", "Namespace brackets can be around whole file instead of for each function", "Lots of PRs not backported into indigo at the moment", "Its a lot of effort to backport everything", "One more indigo release then stop making changes", "PR2 is almost ready for Kinetic, lots of progress made", "Most of functionality doesn’t really work in python", "Python interface diverging from C++ interface", "Bence will try to keep slowly adding tests", "moveit_python (Ferguson), does not wrap C++ but is native", "PickNik trying to find sponsors for this effort", "We will do some of the initial migration in ROS Melodic (tf, python)", "Several students are currently applying via OSRF and JSK", "ROSCon: Sept 29-30th", "IROS:  Oct 1", "WMD: Oct 23 or 24 or 25?", "NIPS: Dec 3"], "url": "https://discourse.ros.org/t/maintainer-meeting-recap-march-20th/4255"},
{"title": "CodeSprint", "thread_contents": ["Hello,", "(I am not sure if this is the right place to ask…) How can I get involve in the MoveIt Code Sprint?", "Hi Zhe,", "‘Codesprint’ is a bit ambiguous - are you referring to a particular event? We have the annual World MoveIt! Day which is essentially a day-long hackathon. The next one will be in October likely.", "You can submit new features to MoveIt! at anytime via Github - though it would be great to discuss what you want to add first here.", "Another meaning of ‘codesprint’ is a funded effort by a sponsoring company to add new features to an open source project. I’m working on pursuing these currently, and in fact there is one effort right now to improve the MoveIt! tutorials and website sponsored by Franka Emika. If you’d like to get involved beta testing the tutorials please contact me privately!", "Hello, thank you very much for the information. I have found the Codesprint contributing opportunity from ", " and I am particularly interested in the perception pipeline. Is this the open source project you are pursuing now? Do you have a email address that I can contact you privately?", "Thanks!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/codesprint/4362"},
{"title": "Move_group.launch Error", "thread_contents": ["Hey guys,", "I am trying to move my robot arm with XBOX controller and for that first I am launching the demo.launch file followed by move_group.launch file and then the joystick_control.launch file.", "In both the move_group.launch file and the joystick_control.launch files, I am getting an error. In the demo.launch I am getting warnings as follows:", "The error in move_group.launch is as follows:", "and my move_group.launch file is as follows", "and the error in the joystick_control.launch file is in the following link below", "Hello Kashyap_Maheshwari", "(As ", " usually answers) Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ", " provides a forum which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", "If you’d like you can reply with a link to your ", " question, but in the future please start there.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/move-group-launch-error/4696"},
{"title": "MoveIt! Project is Selected for 3 Google Summer of Code Grants", "thread_contents": ["The MoveIt! project, ", ", and ", " are excited to announce that MoveIt! was selected for 3 Google Summer of Code (GSoC) grants this summer. GSoC is an international program in which Google awards stipends to students who complete a free and open-source software coding project during the summer.", "Ridhwan Luthra will be working on the perception pipeline, Mohmmad Ayman Salah will be making improvements to the Setup Assistant with Gazebo and Raghavender Sahdev will be improving the motion planning interfaces. Dave Coleman (PickNik), Michael Goerner (University of Hamburg), Mark Moll (Rice University), Feroze Naina (Mercedes-Benz), Mike Lautman (PickNik), and Andy McEvoy (PickNik) will be co-mentors for the students.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/moveit-project-is-selected-for-3-google-summer-of-code-grants/4782"},
{"title": "MoveIt! Maintainer Meeting Recap - Dec 18 2018", "thread_contents": ["Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["World MoveIt! Day and MoveItCon 2019", "Master branch and release versions", "Improving Code Reviews", "Pilz’s Cartesian planner and MotionPlanRequest changes", "World MoveIt! Day China", "Michael Görner", "Jorge Nicho", "Gijs van der Hoorn", "Robert Haschke", "Dave Coleman", "Harold Yang", "Adam Alami", "Andy McEvoy", "Isaac Salto", "Joachim Schleicher", "Jonathan Binney", "Mike Lautman", "Nathan Brooks", "Simon Schmeisser", "Will Baker", "Zak Kingston", "Henning Kayser", "Daniel Bakovic", "Ian McMannon", "World MoveIt! Day 2019\n", "Possible dates: Nov 19 - Nov 21", "ROS-Industrial wants to support WMD", "Not before IROS, since it’s good advertisement", "\n", "MoveItCon 2019\n", "Maintainer meeting earlier?", "Look into workshop at ICRA", "\n", "Master branch release\n", "When melodic API is stable?", "Possible release types\n", "Debian", "Build Farm", "Open Robotics", "Docker", "Tarball package", "Snap", "\n", "\n", "Improving Code Reviews\n", "Not enough reviewers (lack of confidence an issue?)", "Allow faster merging of pull requests\n", "Maintainers should commit small changes to pull requests branch", "Decrease number of required reviews?", "\n", "Label pull requests for better assignment and workload distribution?", "\n", "Pilz’s Cartesian Planner\n", "Cartesian planning using the MoveIt! planning pipeline", "Supports the full MotionPlanRequest specification", "Adds changes the MotionPlanRequest message", "\n", "World MoveIt! Day China\n", "Held by Intel", "Attendees/support from industrial companies and government", "Agenda:\n", "Morning: Technical presentations and sharings\n", "Intel open source contributions to ROS2 and MoveIt!", "Intel platform technologies, partner companies and smart manufacturing", "\n", "Afternoon: MoveIt! Workshop\n", "MoveIt! projects and hands on", "Code contributions and working on issues", "Review session", "\n", "\n", "Intel funding for MoveIt! 2.0?", "\n", "IK Regression in Melodic and Ubuntu 18.04"], "url": "https://discourse.ros.org/t/moveit-maintainer-meeting-recap-dec-18-2018/7176"},
{"title": "MoveIt! China Developer Workshop - Jan 16th 2019", "thread_contents": ["We’re excited to announce that MoveIt! China Developer Workshop will be held on Jan 16, 2019 in Suzhou, China, as follow up of 2018 World MoveIt! Day (WMD), led by Intel (China) Ltd., the People’s Government of Xiangcheng District Suzhou, China Association of Small and Medium Enterprise High-Tech Industry Branch, and Artificial Intelligence Industry Innovation Alliance (AIIIA). Expected attendees of this workshop include MoveIt!/ROS community developers, industrial robot developers, technical experts from industrial companies in industrial robot arm, cobot (collaborative robot), machine vision, motion control, smart manufacturing, etc.", "Detailed agenda of this workshop can be found at meetup: ", ". We warmly welcome developers attendance and you can register ", " to confirm your attendance. Additionally, there will be online video streaming for all of the technical presentations of morning session, starting from 9:30am, for developers who can’t attend onsite session. URL for online video streaming will be published later via meetup.", "我们很高兴地宣布，英特尔（中国）有限公司，苏州市相城区人民政府，中国中小企业协会高新技术产业分会和人工智能产业创新联盟将于2019年1月16日联合在苏州市举办MoveIt!中国开发者研讨会。预计出席此次研讨会的人员包括MoveIt!/ROS社区开发人员、工业机器人开发人员以及来自工业机器臂、人机合作机器人、机器视觉、运动控制以及智能制造等工业企业的技术专家。", "MoveIt!中国开发者研讨会的具体日程可以从meetup获取：", "。我们诚挚欢迎各位开发人员参加此次活动。您可以通过注册 ", " 进行确认。此外考虑到不能出席本次活动的开发人员，我们将对所有上午的技术讲座进行网上直播，开始时间为早上9:30。视频直播的链接会稍后通过meetup更新。", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/moveit-china-developer-workshop-jan-16th-2019/7218"},
{"title": "Google Summer Of Code Improvements to Perception Pipeline", "thread_contents": ["Submitted by: Ridhwan Luthra, Cluster Innovation Centre", "Over the summer, Open Source Robotics Foundation (OSRF) and PickNik Robotics teamed up to mentor a Google Summer of Code (GSoC) student, Ridhwan Luthra, while he made meaningful contributions to MoveIt!. Ridhwan worked with Michael ‘v4hn’ Görner and Michael Lautman to produce two new tutorials demonstrating the perception and manipulation capabilities available in MoveIt!.", "Ridhwan’s work focused on developing tutorials for ", " as well as the ", ". Ridhwan also made significant progress towards generalizing a grasp generation package to incorporate into a grasping tutorial. This work is still continuing outside the scope of GSOC.", "While developing the ", ", Ridhwan identified and fixed a common race condition that was triggered by the way that MoveIt! was maintaining and updating octomaps. This was accomplished by adding a parameter that allows users to configure the maximum rate at which the octomap is updated.", "The animation below shows MoveIt! using an octomap to perform collision avoidance.", "The next item Ridhwan worked on was building a pipeline to detect, segment, and add a cylinder from point cloud data as a collision object. The first image below shows the original octomap and the second image shows the final octomap with the cylinder collision object added to the planning scene.", "After finding a collision object, the next task is to pick it up. There was previously no tutorial on how the ‘pick and place’ pipeline worked, so Ridhwan ", " to address this gap.", "The animation below shows a cuboidal object being moved from one table to another using the pick and place pipeline.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/google-summer-of-code-improvements-to-perception-pipeline/7290"},
{"title": "MoveIt! Maintainer Meeting Recap - January 11 2019", "thread_contents": ["Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Kinematics Base API Rework", "MoveIt! 1.0 Release", "Policy for Contributors and Maintainers", "Clang-tidy Work", "Misc", "Dave Coleman", "Jorge Nicho", "Robert Haschke", "Mike Lautman", "Jon Binnery", "Gijs van der Hoorn", "Michael Görner", "Zak Kingston", "Bryce Willey", "Nathan Brooks", "Felix von Drigalski", "Technical side: Regression in Melodic: KDL IK doesn’t provide nice results\n", "Assumption: things are a little slower causing earlier timeouts", "\n", "The API for Kinematics isn’t satisfactory (Comments are in Issue ", ")", "Lots of cruft/redundancy", "General agreement that it needs to change", "However, it’s an old API, with lots of plugin users.", "Better documentation of the features are needed as well", "Several use cases:\n", "any IK solution, close or not", "closest as possible solutions", "\n", "Some IK plugins won’t support all of these options, maybe we expand the ability to check if a certain plugin has a certain feature", "Major users: Descarte", "Redundant Kinematic’s Base\n", "Major discussion: do we break user’ API unnecessarily?", "\n", "ROS 2.0 is a giant API change", "Do we want to be able to have MoveIt! 1.0 and 2.0 on the same computer?\n", "Probably not", "\n", "Who do we optimize for: People using MoveIt! and want it to ‘just work’, and those who can handle breaking changes and update\n", "Mostly the latter: see ", " (under-optimizing for contributors)", "\n", "ROS 2 will be hard, it’s still missing a lot of features\n", "It does have actions and parameters, but no parameter server", "We will have 2 branches: master for ROS 1.0, and d***-devel for ROS 2.0", "Beta ROS 2 release in December, release next year", "\n", "Dave has been working getting resources to move to ROS 2.0, but the maintainers need to have a plan", "Issue: someone has to write a ROS 2.0 branch, but while it’s being written, there will be enough changes that they will have to catch up toWorkshop", "Other big projects that have done the ROS 2 switch:\n", "RViz: they did a hard fork for the new branch.", "\n", "If someone wants to split off a branch, try to make sure you can isolate as many components as you can. It will be work in development for a long time.", "Main difference: recognizes “Core Contributors” who might not be Maintainers, but still have significant MoveIt! experience.\n", "recognized on the website, can put on CV, possibly could have Github tags for them so the community can recognize them.", "\n", "\n", " describes the next steps in detail", "Travis might time out: could look into Coverity (used to find issues like ", ") that might run these things on other sites besides Travis", "need to be cautious around function name changes, maybe those go in at the same time as the other API changes (discussed at the beginning of meeting)", "Developer Workshop in China is focusing on clang-tidy", "Nathan is still working on smarter PR assignment, has found a repo that might help", "Discussion of ", ", ", ", and   ", ", attempting to merge them before the China Developer Workshop"], "url": "https://discourse.ros.org/t/moveit-maintainer-meeting-recap-january-11-2019/7416"},
{"title": "Moveit! motion planning issue", "thread_contents": ["Greetings!", "I am trying to manage to Pick and Place using UR5 and 2F-Robotiq85, simulating it in Gazebo.", "\nIs there any way to combine Moveit motions of different groups together ", ", but not separately.", "\nHere is a ", " to a video to understand the question.", "\nMy assumption, I’m not subscribing to simulated robot Current joint trajectory?", "\nAnother question, what is this strange motion planning solution of the manipulator group.", "\nFeel free to ask for extra information.", "\nPlease, give me any references, thank you in advance!", "Best Regards,", "\nArtemii", "Hi Artemii,", "I struggled myself on this one a few years ago. It’s actually not a motion planning issue !", "\nIf I remember well, the UR5 joints can each rotate from -2pi to 2pi, so there is several joint solution to reach the same position.", "\nThe problem you have here is that the IK solver does not give you the closest solution to your current joint position. To solve that issue I recommend using ", " with the option ", "\nYou can see an example here : ", "Cheers,", "\nJimmy Da Silva", "My personal solution, which worked pretty well, was to limit the range of the angles, in particular the elbow (3rd axis).", "Thank you, Jimmy, for your response!", "\nI am definitely trying this IK solver later on, sounds like a good solution.", "\nAnd let you know about the progress.", "Cheers,", "\nArtemii", "Thank you, facontidavide", "It solved the second part of the problem.", "\nSimply added joint limits to ", " and updated limits to ", ".", "\nBut the first part problem didn’t get solved, it still collides without any reason, although ", " is in the workspace. but not under.", "If I understand your question correctly, you want to append a robotiq gripper trajectory at the end of your ur5 robot trajectory. This shouldn’t be a problem since the ", " takes in a ", " which simply maps the trajectory for each joint in joint_names to an appropriate controller for that joint.", "In the video that you provide, it is unclear what you are displaying, please include the rviz displays side panel. If you are able to see the robot moving with only the planning_scene robot visualized, then you are on the right track. If you are instead just displaying the published joint trajectory, then you need to look into how you are connecting to gazebo.", "Also, I would recommend using the ur_kinematics analytic solution for the UR5 since it is much much faster than any iterative solver (kdl or trac_ik)", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/moveit-motion-planning-issue/7641"},
{"title": "Migration to one GitHub repo for MoveIt!", "thread_contents": ["We are planning to consolidate most of the moveit* Github repositories to a unified “moveit” repo for the following advantages:", "Disadvantages:", "Goals:", "Method:", "Timeline:", "Target Repos:", "Experimental Repo:", "\n", "moveit - The MoveIt! motion planning framework", "\n", "Migration notes:", "\n", "moveit_merge - Scripts for merging moveit", "\n", "+1 for this in general; I think the advantages significantly outweigh the disadvantages. Especially having one place to look for issues, and being able to submit a single PR that spans a bunch of packages.", "One small note: there is also a slight disadvantage to having “desktop” and “robot” stuff in the same repo (although moveit_ros already has this issue). If someone clones the repo into a catkin workspace on a robot and wants to build everything, they’ll need to install rviz (for example), which will in turn install a ton of graphical dependencies. This is not good on a robot that may be running ubuntu server. This can be worked around by having deployment scripts that (through selective copy or rsync or symlinking) create a workspace with only the packages you want to build. Just something to think about though.", "+1 generally a good idea to have far fewer repositories", "You might want to consider separating the moveit_ros repo from the ROS-independent components. I also agree with Jon’s comment about keeping on-board components separate from desktop stuff.", "Even if you end up with 2 or 3 repos, that’s still a big improvement over the current plethora.", "This is going to be a ‘me too +1’ post, but the point Jon raises is indeed something to be careful about. ", " can better cope with this, but it would need to be documented clearly, and a blanket ", " step won’t work anymore either.", "I do see the advantages of having a unified repo for development. On the other hand the migration will create a lot of pain and I’m not sure, that we can target this for a Kinetic release, which should be out as soon as possible.", "\nHow often did you observed changes across the different repos in the past? From my impression, they are nicely separated from each other. Of course, introducing new features and API changes in core have to be reflected in downstream packages…", "\nIn order to test PRs, I have setup a separate workspace to not conflict with my own development environment and I have separate ", " files to easily switch between branches in all repos simultaneously.", "Altogether, I’m undecided whether to merge or not. Pros and cons for both options are balanced in my opinion.", "Other disadvantages:", " takes much longer even if someone just wanted a single package (anyone who has hg clone’d gazebo knows about this, and we are currently splitting gazebo into the ignition repositories)", "releasing and building a subset of packages is more of a hassle for meta-packages (see ", " ), but CATKIN_IGNORE can workaround these issues", "I know that the NASA JSC team working on Valkyrie has many packages in separate repositories, but they encourage all issues to be filed in a single repo that also hosts the wiki ( ", " ). That helps with issues, but not pull requests.", "I’m personally “-1”: I think the disadvantages outweigh the advantages.", "I’ll abstain from voting, but I also see the pros and cons. I don’t know, but the advantages may outweigh the cost.", "However, I didn’t see anyone mention the constraint that bloom can only release multiple packages from the same repository when they share the same version number. So if packages across the different repositories have different version numbers now, then part of the migration will be to jump them all up to a common version that’s newer than all previous versions.", "That’s what I meant by", "But I believe most of MoveIt! already has the same version numbers, because the stuff I’m suggesting we merge is so dependent on each other", "Oh, ok, sounds good to me ", "Yeah, it’s always a balancing act. And for every project it’s always different.", "On one end everything is released separately and completely independent. On the other end it’s one big repo that gets released monolithically.", "I believe that MoveIt is farther toward the many packages model since there are lots of coupled releases. However I do suggest not overcompensating and going to the other extreme of one repo as well. A good discussion on a case by case basis of how closely coupled repos are is probably worth conducting.", "Good cases for keeping things independent generally are things like plugins and other things that are more loosely coupled and bring in large extra dependencies. (Note that MoveIt having core plugins means that this rule of thumb is probably not exactly appropriate for this project.)", "Lots of good points here. I look at MoveIt! similar to PCL, OpenCV, and the navigation stack - all which are centralized under one repo. If companies like Google can maintain their vast amount of software on a single repo, it seems like our modest MoveIt! can also. I understand there are corner cases that might require manually pulling out a package, but I don’t think they warrant the drag it has caused on the agility of the MoveIt! project’s progress.", "they’ll need to install rviz (for example), which will in turn install a ton of graphical dependencies. This is not good on a robot that may be running ubuntu server", "As you mentioned, simply add CATKIN_IGNORE, delete the folder, or using catkin-tools’ blacklist feature", "consider separating the moveit_ros repo from the ROS-independent components", "moveit_core was suppose to be ROS agnostic, but it in fact does have ROS dependencies such as ROS Time, ROS Package, ROS Console, and lots of ROS messages. I also believe no one is using it outside of ROS, so why should we waste so much developer time maintaining this separation?", "I’m not sure that we can target this for a Kinetic release", "We are going to be using Kinetic until 2021, so if we don’t target it we can’t really migrate because of the need for backports, etc. Considering Kinetic is not released yet, and even if it is we can still switch over, I think we should try our best for it.", "How often did you observed changes across the different repos in the past?", "Many times. Many of the features MoveIt! lacks require deep architecture changes across, at minimum, moveit_core and moveit_ros. For example: “KinematicsBase changes” required these PRs:", "\n", "\n", "\n", "\n", "Even something as simple as upgrading to Eigen3 requires me filling out many many PR pages across MoveIt!", "git clone takes much longer even if someone just wanted a single package", "I believe almost everyone who builds MoveIt! from source already downloads all the separate repos per the Quick Start guide, so it shouldn’t change the download time, right? Of course if our repo gets too big we could delete some of the history.", "releasing and building a subset of packages is more of a hassle for meta-packages", "good point", "If companies like Google can maintain their vast amount of software on a single repo, it seems like our modest MoveIt! can also.", "Google also employs many people to maintain that infrastructure and to provide tools to make the workflow easy to use. While I agree fewer repositories is easier for moveit’s developers in this situation, I don’t think you’re comparing apples to oranges when you compare moveit in a single repository to all of Google’s code in a single Perforce repo (which is also different from git – it’s not like Google uses a single git repository).", "Again, not arguing against the move, just pointing out that Google’s setup is very different from both what moveit has now and what you’re proposing.", "Considering Kinetic is not released yet, and even if it is we can still switch over, I think we should try our best for it.", "Kinetic was release on May 23rd, 2016, but maybe you mean moveit for Kinetic.", "Of course if our repo gets too big we could delete some of the history.", "I can’t -1 this enough.", "Good points on Git vs. Perforce. I did mean MoveIt!'s release of Kinetic. By some of the history, I was referring to old commits that have ", ".", "Thanks ", " for taking the time to have this discussion - I agree that a lot of good points have been brought up, and I like your summary in that last comment.", "CATKIN_IGNORE helps avoid the need for big dependencies when only building a few packages. I was thinking more of the problem of doing “rosdep install --from-path src” but that can also be worked around by installing deps only for the packages/subdirectories that you want to build. To be clear, I think that these issues are far outweighed by the advantages that have been listed of moving to one repo. Especially if tutorials are added/updated to show people useful workflows.", "Ok, that’s good, so long as you’re removing unused branches and stuff. Removing actual history would not be good. That brings up another thing to watch out for, which is that it would be best to try to preserve the history when merging the repositories. It’s easy to accidentally miss the history when moving the files.", "I instantly favored this idea when I heard it in a ROSCon 2015 video where Dave mentioned it. I’m still +1 now.", "\nAs I recently started helping to make releases of MoveIt!, I add some thoughts to the maintainer’s perspective. Not all / none of these may be of significant importance, but hoping these help for some purpose:", "Advantages is to reduce the cost of:", "back/forwardporting between branches; Doing so involves at least: paying attention to any existing portable commits/PRs, cherry-picking commits, opening PRs, waiting for CI result and adding correction if needed, waiting for the reviews, discussion if needed. Spanning over multiple repositories just multiplies the cost. Ideally the original authors of PRs take care of porting, but I doubt we can force that and thus it’s one of maintainers’ responsibility currently (at least at MoveIt!).", "managing version;", "But I believe most of MoveIt! already has the same version numbers, because the stuff I’m suggesting we merge is so dependent on each other", "Actually there are slight differences. For example, to cope with the difference between ", " and ", ", I incremented the minor version of Jade to 0.8.x. Version ain’t nothing but a number? No it takes some thoughts, and the more repositories we have the more time needs to be spent among maintainers.", "sorting changelog; I tend to spend some time to edit changelog upon making a release to group into categories (fix, feature etc.) since bulk of raw commit messages don’t make much sense to me personally. This gets more important I think for packages with vast amount of users. Again the more the repos the more the time it takes, and moreover more mental stress.", "running prerelease test manually; first going to web and get the necessary script snippet, and run the snippet locally. Again the mroe the repos the more the time, which is non-trivial amount for volunteer maintainers.", "This week’s example: currently ", " is adding a much needed feature to MoveIt! but he has to create 4 PR’s to apply it throughout the code base. And if you include adding documentation, 5! This means I get tons of emails for all these PRs, have to merge them in the correct order, and its very difficult to make sure they all work together correctly.", "\n", "\n", "\n", "\n", "\n", "\n", "I’ve created an automated ", " that keeps each repo’s git history in place. I’ve tested this merge script with Jade and it passes CI except for some previously disabled tests that are now enabled - you can see the experimental merged repo ", ".", "Thanks to ", " and ", " for their input on this.", "Sorry if I say anything obviously stupid here… I’m quite new to ROS and MoveIt.", "From my end-user point of view, ROS Kinetic is the ", " since its release on May 23rd 2016 and compatible with Ubuntu’s latest 16.04 LTS. MoveIt is an essential part of the ROS ecosystem, and should therefore become quickly available for new ROS releases.", "So, I don’t think that this change should block an initial MoveIt release for Kinetic. Even if the initial one is done from the multiple repos as before, it should not prevent future MoveIt bug fix releases for Kinetic to be done from the unified repo.", "But maybe I’m totally wrong and this subject isn’t what’s currently blocking the release.", " That’s a valid comment. Thank you for sharing your thoughts!", "\nI’ll wait for “more-core” maintainers to chime in, but as ", " commented on ", ", main reason why MoveIt! hasn’t been released into Kinetic is the dependency. MoveIt! is a huge set of software, so is the number of the depended packages.", "Also we’re making fundamental changes that will require far less maintenance effort, one of which as discussed above is to consolidate the distributed repositories into fewer repo. Since ROS Kinetic is “LTS”, meaning once it’s released we won’t be able to make a substantial change for 5 years, we’re rather taking time now to make as much work done as possible. In fact some maintainers (notably ", " ", " ", ") have been ", " working hard these few weeks for making it happen for Kinetic.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Easier to create pull requests that currently span multiple repos", "Easier to test pull requests when working on a different fork or branch locally", "Less duplicate work when maintaining continuous integration, creating distro branches, etc", "Easier for beginners to find code in one central place", "Will break everyone’s current source build workspace layout", "Will be effort to migrate current issues, branches, pull requests to the new repo", "All packages must be released at the same time", "Document the merge process exactly so that developers can replicate locally their feature branches", "Do some test merges first before switching", "Merge the git histories of the various repos", "Merge for all current branches - Indigo, Jade, and Kinetic", "Merge as many PRs first to reduce future sync issues", "For at least phase one of the migration, directly copy in the package name as a subfolder in the new “moveit” repo", "Do not flatten any subfolders that contain multiple subpackages i.e. “moveit/moveit_ros/planning” could become “moveit/moveit_ros_planning” since this better represents the package name, but this should not be in phase 1", "Notably we will keep moveit_msgs and moveit_pr2 separate.", "August 5th, 2016", "Target ROS-Kinetic and begin releasing debians for Kinetic from this repo", "moveit_core", "moveit_ros", "moveit_planners", "moveit_plugins", "moveit_setup_assistant", "moveit_commander", "moveit_ikfast", "moveit_experimental", "\n", "\n", "\n", "\n", "All packages must be released at the same time", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "BTW there’s a package called ", " that has a feature to start the ROS prerelease test from PR (", ").", "\n"], "url": "https://discourse.ros.org/t/migration-to-one-github-repo-for-moveit/266"},
{"title": "Developing a MoveIt compatible driver for Hekulex Servos", "thread_contents": ["I’ve been developing a ROS driver for the Hekulex family of smart servos over the last couple of months. We are building a simple arm using these servos and we’ll be controlling it using MoveIt. The standard interfaces I have or am in the process of adding are the joint_state topic and trajectory action server.", "\nThis is the minimum required to be able to control the hardware but I wanted to know what other interfaces would be worth implementing? For example what is the velocity control interface used by the Jog Arm package?", "I also wanted to ask at what level of development should I add this package to the wiki and buildfarm? It’s available now on my GitHub and I’d like to get some feedback from more experienced robot driver developers.", "I can answer a small part of that. ", " uses ros_control ", " or ", ". Those are the controller types that allow for streaming commands.", "If I could only choose one, I would choose the ", ". It will be more responsive.", "Thanks for the info. I’ll look into adding the velocity controllers, that should be fairly straightforwards with the interface they have.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/developing-a-moveit-compatible-driver-for-hekulex-servos/7876"},
{"title": "Report On MoveIt! China Developer Workshop 2019", "thread_contents": ["Following last October’s World MoveIt! Day, the first-ever MoveIt! China Developer Workshop 2019 was successfully held on January 16th in Suzhou, China. This event was co-led by Intel EDO (Ecosystem Development Office) & Intel OTC (Open Source Technology Center), with support from the People’s Government of Xiangcheng District Suzhou, the China Association of Small and Medium Enterprise High-Tech Industry Branch, and PickNik Consulting. The workshop aimed to give an opportunity for MoveIt!/ROS developers to come together to share their experiences, projects, and plans while also exploring collaboration possibilities and working together to fix outstanding issues for the future growth of MoveIt! and industrial robots in China. Approximately 210 technical experts attended this workshop, including technical leaders from 30+ industrial companies (industrial robotics, smart manufacturing, machine vision, etc), professors, researchers and students from 7 universities, and ROS/MoveIt! community developers. ~7300 viewed the workshop’s online video stream.", "It is the first time that MoveIt!, the globally renowned open source project, was represented in China. Intel OTC brought MoveIt! expertise to Chinese developers by preparing technical content and a hands-on workshop, while EDO bridged the resources of speakers and audience through its smart robotics ecosystem developed over the past 3 years, which covers ~300 ecosystem partners. By the close collaboration of EDO and OTC, the workshop had significant impact on developers and ecosystem partners by presenting a full picture of open source robotics, including authoritative technical methodology, influential academic perspective, typical industrial application as well as inspiring case studies.", "In the morning, 6 industrial / community leaders and university professors delivered technical sharing, focusing on MoveIt!, industrial robot applications, smart manufacturing, and collaborative robots:", "In the afternoon, about 120 attendees joined a MoveIt! hands-on activity. They were technical leaders from industrial companies who either work on robot products or are eager to upgrade their product line from traditional equipment to intelligent ones and students from colleges who are interested in or majoring in robotics technologies.", "Intel OTC robotics team hosted the afternoon’s hands-on lab activities. MoveIt! lead maintainer Dave Coleman also joined and provided support and answered questions. We went through the below hands-on activities and had an open discussion in the end.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["MoveIt!: Past, Present, and Future\n", "Dave Coleman, lead maintainer of MoveIt! project, CEO of PickNik LLC", "\n", "Smart Manufacturing Trend\n", "Qingshan Xie, Intel SMG", "\n", "Industrial Robot Use Case and Optimization on IA platforms\n", "Sharron Liu, Senior Software Engineer, Intel OTC", "\n", "Collaborative Robot and its Development on ROS\n", "Min Huasong, Professor, Wuhan Science & Technology University", "\n", "Smart Manufacturing Ecosystem and Product Line Quality Control\n", "Yang Weijie, Siasun Corporate", "\n", "Industrial Robot Platform Based on MoveIt!\n", "Lin Minghao, NexCom Corporate", "\n", "ROS and MoveIt! setup", "Arm configuration in Gazebo simulator", "Draw “X” in simulator", "Pick and place in simulator", "Demo OpenVINO enabled random pick and place with UR5 robot arm"], "url": "https://discourse.ros.org/t/report-on-moveit-china-developer-workshop-2019/7959"},
{"title": "MoveIt! Maintainer Meeting Recap - February 28 2019", "thread_contents": ["Notes taken by ", " :", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["MoveIt 2.0 - ", "\n", "Acutronic’s sponsorship (Victor)", "General migration logistics", "Logging in ROS 2", "\n", "Finalizing changes to ", " - add seed trajectories to MotionPlanRequest", "\n", " (Bryce / Yu)", "Auto-assigning reviewers to new PRs", "Tesseract-related Collision Checking improvements as discussed at ROSCon with SwRI", "moveit_grasps", "maintainer email list", "Dave Coleman", "Robert Haschke", "Víctor Mayoral Vilches", "Jorge Nicho", "Mike Lautman", "Gijs van der Hoorn", "Bryce Willey", "Nathan Brooks", "Andy McEvory", "Yu Yan", "Simon Schmeißer", "Rob Coleman", "Welcome/intro from developers", "Discussion about some issues with MoveIt! 1.0 regarding an upcoming release,", "Discussion about MoveIt! 2\n", "Víctor hopes to get moveit_core ported in OS X and Ubuntu by the end of this week", "Important to keep the existing CI infrastructure", "Iterating on small spirals for now, making sure submodules compile", "Logging being discussed at ", ". Input is welcome", "Dave asked if developers had comments about our approach", "Discussed the compatibility between moveit and moveit2, eventually we’ll diverge due to some changes", "(personal comment) it’ll help a lot getting some additional insight on those changes so that we all can help", "Dave shared his insights about maintaining compatibility by making active use of ROS bridges.", "Víctor shared that approach already works fine and has been used by their team for a while", "\n", "Discussion about moveit_msgs", "Having a faster response time to PRs was discussed. Assigned PRs by categories/expertise to reduce the level of noise and allow maintainers to focus\n", "Dave will make an initial proposal", "\n", "Tesseract-related collision checking into moveit discussion\n", "Dave pointed out they want to keep themselves independent to evolve faster", "Ongoing work seems to be happening at ", "\n", "\n", "Mike working on ", ", allows to generate grasp candidates\n", "for now working for cuboids", "aiming to merge it in the core moveit repo", "\n", "Robert mentioned that they’ve been working on a multi-gripper solution also backed by yaml files, he said that the community will have several options for grasp generations"], "url": "https://discourse.ros.org/t/moveit-maintainer-meeting-recap-february-28-2019/8063"},
{"title": "How to get involved with MoveIt?", "thread_contents": ["I am Abhishek Mishra from Bhubaneswar,India. I have previously worked in ROS kinetic and designed path planning of a drone i simulated using V-REP. Currently, I am interested in introducing some path planning libraries to MoveIt…", "Hi Abihishek,", "To get involved in MoveIt, see the intro ", ", our pull request guidelines ", ", and ideally our infinite list of ", " ", "Sir, actually i am interested in adding path planning libraries for gsoc 2019 and previously i have worked in path planning using ompl plugin . Can you guide me a bit so that i can get to know from where to start?", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/how-to-get-involved-with-moveit/8121"},
{"title": "Versioning Roadmap: MoveIt! 1.0 Release Plan", "thread_contents": ["tldr; we’re targeting to release MoveIt! 1.0 on March 1st, 2019, then future major version releases whenever API changes.", "MoveIt! has been in beta since 2013 (6 years), yet we have been planning the ROS 2.0 version for the past couple years. It’s important to actually use major release versions so we can break API in a structured, transparent way. See ", " for more reasoning.", "Up until now we haven’t used major version numbers with MoveIt! due to lack of leadership direction, resources, and ambiguous role of ROS distros vs major software versions. We can no longer rely on ROS distros as our only versioning strategy as there will not be a 2019 ROS release, and we wish to accelerate MoveIt! development going forward. Conflating this discussion is the ROS 2.0 conversion effort that will be taking off soon.", "In the following table we show MoveIt!'s past git branching / versioning / and ROS distro strategy and propose future strategy as well:", "The following is necessary to consider 1.0 released:", "At the same time as the 1.0 release we will implement our desire to have a master branch where future development will take place. Once switching to the master branch approach, there will not be regular debian releases until we figure out how to do releases outside of the ROS buildfarm. This is necessary because OSRF is not making a 2019 ROS1 release.", "It would make the most sense from a marketing perspective if MoveIt! version 2.0 was the release that included support for ROS 2.0. However, this would mean that after the 1.0 release, we can’t release another version of MoveIt! for ROS 1.0 that breaks API. This would stagnate development once again, so it may make sense to have MoveIt! 3.0 be the version that includes ROS 2.0 support. This decision depends on how long it takes to get ROS2 support and how many core MoveIt! maintainers are willing to make the switch soon.", "Once funding / resources has been secured for ROS 2 development, a new branch will be created off master called \"dashing-devel\". This branch will be dedicated to the ROS2 port of MoveIt!, but changes to the master branch (ROS1) will be cherry picked as much as possible. Eventually the dashing-devel ROS2 branch will become the master branch of MoveIt!, but when that occurs is an open question for the future based on a lot of factors.", "This roadmap has already been discussed in the most recent MoveIt! maintainer meeting as well as various email exchanges, but there is still room for debate and modifications as necessary. Let us know if you see issues with this proposal, but baring that we are hoping to proceed with the MoveIt! 1.0 release in the next month!", "I’m happy to share that Acutronic Robotics will be supporting the MoveIt! transition to ROS 2.0.", "During the following weeks, we’ll formally allocate resources to commit our developer’s time and start porting MoveIt! to ROS 2.0. While we don’t promise we’ll port the complete MoveIt! framework, we hope to contribute with the community and put together the first stones to have some basic form of native MoveIt! support in ROS 2.0.", "For those that care, our contributions are justified by our current work in modularity and will be funded to ensure that our ", ", based in ROS 2.0, can interface with the motion planning framework natively. Currently, we’re in conversations with PickNick to ensure our efforts contribute in the most productive way with the community. Input on this regard is more than welcome.", "We hope and invite other manufacturers to contribute in a similar manner.", "I couple of comments regarding the information in the above table:", "Thanks ", " for the feedback, I’ve updated the orignal table where appropriate.", "Our MoveIt! Melodic branch builds for 16.04 also, so I’ve included both in the table", "We’re calling our next version of MoveIt! “Noetic” now even though the main ROS distro won’t be out until end of 2019. We can’t let ROS’ slowing down of releases slow down MoveIt! development.", "After further debating versioning numbers internally and with Acutronic Robotics (", "), I believe it is best if we reserve “MoveIt! 2.0” version to coincide with ROS 2.0 support.  In my original post above I had said:", "This decision depends on how long it takes to get ROS2 support and how many core MoveIt! maintainers are willing to make the switch soon.", "Because Acutronic Robotics and PickNik are now beginning development on ROS 2.0 support (full announcement pending), the timing does not make sense to call it instead MoveIt! 3.0. This would be a confusing break from the standard being used by the rest of the ROS community e.g. rviz2", "This would be a confusing break from the standard being used by the rest of the ROS community e.g. rviz2", "It might be worth pointing out that rviz2 is the package name not the version. As of this writing rviz2 is at ", " since the project is following a SemVer style and thus bumping the major with API breaking changes.", "@", "Great to know ROS 2.0 support is kicking off and coincide with MoveIt! 2.0 development.", "Is there a project page to get more details on this (schedule, task list, etc) and how to contribute?", ",", "There will probably be an official repository in ", " org and code will end up there but for now, for dev. purposes, our group is working at ", ".", "There are tons of TODO items there so feel free to pick any (let us know that you’ll be working on it). Wish we get your contributions!", "I’ve just created the moveit2 repo here: ", "I’ve also created a project board and a May milestone for the ROS2 Dashing release:", "\n", ":robot: MoveIt! for ROS 2.0, Alpha. Contribute to ros-planning/moveit2 development by creating an account on GitHub.", "\n", "There are currently no issues or cards yet, but I think that should be the hub for collaboration on ROS 2 development.", "I’ve just created two milestones for the moveit2 release, see ", "This is great news! Please keep us posted.", "The master branch for the ROS 1.0 release has just been created, the first PR to the master branch:", "\n", "\n", " Is it going to be a MoveIt 2.0 release for ROS 2 Crystal?", "We’re targeting ROS2 Dashing for MoveIt 2, see the progress bars under “Current and Future Versions” at the bottom of the homepage: ", " Thanks for clarifying this. I think I have read some info before that MoveIt 2.0 is for ROS 2 Crystal and MoveIt 2.1.0 is for ROS 2 Dashing.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Tag all the package.xml files with the new major release number and release to bloom", "Update website and other documentation with version number and status", "Create a master branch for development beyond melodic-devel", "ROS Jade / Lunar are also targeting the same Ubuntu LTS as the previous ROS distro", "ROS Melodic is targeting Ubuntu 18.04 LTS (not 16.04).", "A beta release of ROS Noetic won’t be available before the end of 2019 since it will target Ubuntu 20.04 (and Python 3) and neither Ubuntu 18.04 not 16.04", "ROS 2 Dashing is scheduled to be released end of May 2019", "ROS 2 E-turtle is scheduled to be released end of November 2019", "(just as an outlook) ROS 2 F-turtle is scheduled to be released in May 2019 (together with ROS Noetic) also targeting Ubuntu 20.04", "ROS Melodic is targeting Ubuntu 18.04 LTS (not 16.04).", "A beta release of ROS Noetic won’t be available before the end of 2019 since it will target Ubuntu 20.04 (and Python 3) and neither Ubuntu 18.04 not 16.04"], "url": "https://discourse.ros.org/t/versioning-roadmap-moveit-1-0-release-plan/7437"},
{"title": "Announcing the MoveIt 2 Port", "thread_contents": ["Exciting news – the MoveIt! port to ROS 2.0 has begun! We are happy to announce that ", " is partnering with ", " to sponsor a MoveIt! codesprint to begin the port to ROS 2.", "Acutronic Robotics has agreed to allocate their internal resources. Two engineers for 4 months of engineering time will begin the port of MoveIt! along with funding technical support from PickNik.", "This collaborative effort is a natural co-development due to Acutronic’s extensive experience working with ROS 2 and PickNik’s lead maintenance support of MoveIt!. Acutronic Robotics will be focused on porting the code to enable their ", " modular robotic arm in the MoveIt! ecosystem. The entire MoveIt2 port will be a large undertaking and we expect other organizations will co-sponsor in the near future. We welcome others to contribute to this effort as much as possible.", "The MoveIt! migration is important for a numbers of reasons, a key one being that it will accelerate ROS 2 adoption. Many companies and R&D teams report they are waiting to migrate to ROS 2 once MoveIt 2 is ready. This was similarly true when ROS Kinetic was released; months later when MoveIt! was ready for Kinetic, adoption picked up dramatically.", "Some key objectives and approaches of this development include:", "We would like to thank ", " for agreeing to sponsor this code sprint and would like to highlight their modular robotic arm, MARA, the first modular cobot.", "Is there a simple timeline published somewhere? I’d like to start using a manipulator in my ROS 2 tutorials as soon as possible, so knowing when MoveIt will be usable will help with planning.", "Two sources:", " stick to ", "’s pointers for the official MoveIt! 2 repos but if you’re looking for the latest, cutting edge changes/situation on the port, have a look at ", ".", "We update that pretty much every day.", "Alas, beginner MoveIt users are more likely to be put off by cutting-edge stuff! But thanks for the pointers. It looks like there will be a usable release in time for one larger tutorial I’m going to be running.", "Looking at the roadmap, I noticed that aside from reorganising the source, most of it is focused on “port X to ROS 2”. There isn’t much about taking advantage of the new features of ROS 2 or fixing any problems with the existing MoveIt design. By contrast, the navigation group has taken a from-scratch approach to allow them to fix problems and to take advantage of architectural features that ROS 2 enables. Do you plan to do this work later in the timeline?", "I also noticed the item to make “ROS 2 nodelets”. Nodelets don’t exist in ROS 2, but nodes that can be structured as components (i.e. no main function by default) do. Maybe it’s just terminology but it helps to use the right words when doing searches.", ",", "Do you plan to do this work later in the timeline?", "This is simply a matter of limited resources. We could promise more but it might be an empty promise. Additionally, I’m getting a lot of push back from moveit 1.0 maintainers who want us to maintain the ability to back port / forward port changes between the two branches. I think its wise to keep this ability for the next few months, until MoveIt 2.0 is actually running.", "Nodelets don’t exist in ROS 2", "Yes, we should be more rigorous with our terminology, but I think more people know what we mean by using the ROS1 term “nodelets” than the new term “components”. IMHO “components” is far more ambiguous to non-expert ROS2 users as its used in general software engineering all the time.", "I think more people know what we mean by using the ROS1 term “nodelets” than the new term “components”.", "I disagree. I think that they do not. I think that “nodelet” heavily implies “not a node”. It is in the interest of your users to get the terminology correct for when they go to ROS Answers for help. If “component” will confuse them, then I think a better solution is to make or point them at a ROS 2 porting guide that includes a glossary.", "Could you point me to the documentation for ROS2 Components? ", "Yes, we should be more rigorous with our terminology, but I think more people know what we mean by using the ROS1 term “nodelets” than the new term “components”. IMHO “components” is far more ambiguous to non-expert ROS2 users as its used in general software engineering all the time.", "This is actually my bad, I recall it was me the one who accepted those changes in the roadmap. I’d say, feel free to suggest changes directly ", ", input and contributions are more than welcome as we said in several threads.", "ROS 2 porting guide that includes a glossary.", "Does that actually exist? I use actively ", "  but I’m not aware of a ROS 2 glossary. Which by the way, it’s a rather good idea, even beyond the MoveIt! 2 port.", "I don’t think one does, but I agree that it’s a fantastic idea. ", "Really a good news for MoveIt 2.", "\nI’ve just uploaded a ", ", being excited to work with MoveIt 2 soon.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Basic migration to the colcon build system, DDS-based middleware, and other new ROS2 tools", "Strategic planning of migration roadmap and release strategy of the MoveIt 2.0 port", "Involving MoveIt! community throughout the development process", "Focusing on best approaches to keep the ROS 1 project synchronized with the ROS 2 fork during the transitional period", "Quality control through extensive code reviews to ensure best practices and MoveIt!'s style guidelines are followed", "Documenting changes in MoveIt! on ROS 2", "Releasing the basic form of native MoveIt! support in ROS 2.0"], "url": "https://discourse.ros.org/t/announcing-the-moveit-2-port/8051"},
{"title": "A real-time motion planner?", "thread_contents": ["This is just a discussion of if and how to integrate real-time motion planners in MoveIt!", "Currently the ", " package does this with a Jacobian-based jogger – it subscribes to joystick commands or force feedback commands to calculate a trajectory. I’m OK keeping this as a separate package but there are  lots of advantages to moving under the MoveIt! umbrella, I think.", "Of course, it’s also worth considering how future real-time planners might fit in…", "Pros of the real-time Jacobian planner, in comparison to the current MoveIt! planners:", "Drawbacks of the Jacobian planner:", "Thanks!", "Hi Andy,", "Can you please edit your post above with links to the said packages e.g. jog_arm?", "Do you think the functionality in this realtime motion planner mimics some of the capabilities in the RobotState:computeCartesianPath() functions in MoveIt! already? Can we have them share the same code?", "How does jog_api connect to the low level controllers? This is the biggest question I ask myself. The FollowJointTrajectory action interface might not be fast enough - it wasn’t for me but I know others have had success with it by changing the TCIP stack. But that isn’t for the faint of heart IMHO.", "I would like to see this added into the ros-planning/moveit repo, in the ", " package for now.", "OK, thanks for the feedback.", "The FollowJointTrajectory action interface might not be fast enough", "You might be right for some robot models/controller setups. On UR robots it’s fine. Velocity control helps in that regard. I think the other two who have used it on custom robots are doing:", "Position control", "They are not using ros_control but have written their own low-level controllers. I will have to confirm this for ", " 's case.", "I believe it’s also being used on a Motoman arm, so I’ll check for details there as well.", "It does mimic some of the capabilities of computeCartesianPath but I don’t think you can achieve smooth compliance or teleoperation with computeCartesianPath() and an OMPL planner. I have tried and it wasn’t fast enough. Yep, it would be good if code could be shared… I’ll work on that.", "BTW I added a library for compliance into the devel branch. I would like to get to the point where DARPA Challenge tasks like turning a valve with two grippers, with compliance, is supported just as well as MoveIt! supports point-to-point motion.", "I’ve looked through the code and I think it would be great to see this merged into the experimental package! Perhaps open a Github pull request and we can continue discussion there?", "This package looks quite interesting. I was wondering if the merge into experimental package is done and what’s the github address for that.", " The merging is still happening at ", ". There’s been a lot of iteration since these last posts though, it should be close to merging.", "thanks for sharing the pull request address.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Determinism (if starting from the same pose, with the same target, its motion will be repeatable)", "~0 planning time", "No reconfigurations, i.e. sudden, wild swings of the arm", "The trajectory can be altered in real-time", "Trajectories can’t be previewed in RViz", "The planner takes a straight line – it doesn’t know how to plan around obstacles, singularities, or joint limits", "This Jacobian technique is generally only useful over short distances.", "\n", "\n", "\n", "\n"], "url": "https://discourse.ros.org/t/a-real-time-motion-planner/4354"},
{"title": "MoveIt Maintainer Meeting Recap - March 28 2019", "thread_contents": ["Moveit maintainer meeting 03/28/2019", "Notes taken by ", "Suggestions for how to make it easier for developers to develop with the latest MoveIt, build takes too long:", "Remembering the discussions when the migration to a single repository was considered, this would seem to be one of the potential issues that were raised.", "It’s unfortunate that we’re running into this so “soon” already.", "Anecdotal, but I’ve recently had to explain to a potential contributor that it is still possible to build parts of MoveIt by just copying the packages out of the local ", " clone. It was completely unclear to him that this was possible.", "Rather inconvenient work-around of course.", "Edit: on my own system I have ", " with ", " installed. After an initial build (which does take a bit of time), a complete rebuild of ", " takes mere seconds.", "Remembering the discussions when the migration to a single repository was considered, this would seem to be one of the potential issues that were raised.", "I know I’ve argued this plenty before, but I don’t see a strong relationship between number of git repos within the MoveIt project and build time. Almost all of the packages in the consolidated repo are arguably needed on a regular basis. Most people like the high level interfaces like the MSA, ROS interfaces, and Rviz plugin. Assuming you like having those around… you need to build all of MoveIt.", "However, to make it even easier to disable packages, I totally refactored the source install instructions just now:", "\n", "\n", "Edit: could you document how you use ccache and distcc on the source install page, please? That would be really useful to a lot of people.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Feedback on MoveIt 1 release process, code freeze policy\n", "Which branch to release from?", "When is our next MoveIt 1.0 release going to be?", "What will the release branch be called?", "\n", "Progress on MoveIt 2 and request for help", "Thoughts on CODEOWNERS effectiveness", "How can the community dismiss stale reviews?", "Tesseract-related Collision Checking improvements as discussed at ROSCon with SwRI", "Other topics?", "Jorge Nicho", "Isaac Saito", "Dave Coleman", "Nathan Brooks", "Anas M", "Andy McEvoy", "Andy Zelenak", "Bryce Willey", "Felix Von Drigalski", "Henning Kayser", "Jon Binney", "Levi Armstrong", "Mike Lautman", "Robert Haschke", "Simon Schemeisser", "Repository status:\n", "Currently only 20 PRs.", "\n", "Moveit 1.0 release and branch:\n", "Minor back fixes should go to the melodic-devel branch", "API and ABI changes go to the ", " branch", "\n", " : all new development should go to the master branch. Changes applicable to the melodic-devel branch will be decided on a case by case basis.", "Suggestions for how to make it easier for developers to develop with the latest MoveIt, build takes too long:\n", "Use Launchpad to build a ", " from the latest code in MoveItto facilitate using the latest features/changes in move it without building from source.", "Gitlab CI packages the build as debian packages.", "Gazebo build process could be a resource to look into", "White and blacklisting packages to speed up the build. (Moveit setup assistant, MoveItvisualization take a lot of time). Setup a default build that is more lightweight and builds faster.", "\n", "\n", "Move 2.0 Acutronic update from Anas M:\n", "Currently porting Moveit Core and planning scene monitor.", "Working on minimally working example. Move Group tutorial in the works.", "Current effort is focused on porting ROS1 to ROS2 code, not new features or significant design changes.", "\n", "CI for ROS 2.0\n", "\n", "  has prepared a Docker container with a travis script and the required dependencies.", "Clang requirements will be relaxed or disabled.", "\n", "Code Owners:\n", "\n", " : Code owners file allows automatically assigning reviewers to PRs by matching a maintainer based on files/packages/directories.", "Reviewers are assigned after PR creation.", "Reviewers need to be under the “ros-planning” organization.", "\n", "Stale Reviews:\n", "In the PR, comments or questions should be entered as github comments instead of a “change request” as it keeps the PR from being approved for merging.", "Stale comments or change requests can be overwritten if originator cannot follow up in time. Two other reviewers could overwrite a stale change request.", "\n", "Tesserac integration\n", "Meeting in Automate conference 2019", "Google summer of code program could be leveraged for this integration effort; It would be helpful to produce a write-up of what this integration effort entails.", "\n", "Other Topics:\n", "Drop the exclamation mark and just call it MoveIt", "\n"], "url": "https://discourse.ros.org/t/moveit-maintainer-meeting-recap-march-28-2019/8528"},
{"title": "MoveIt Survey 2019", "thread_contents": ["Now that MoveIt 1.0 is officially released, we are polling the community of MoveIt users to get feedback about MoveIt. How easy it is to setup/use? What features are popular? What new features users would like to see in MoveIt? This survey should take less than 5 minutes to fill out. This form will stay open until May 15th. We will share the results after all the results are gathered.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/moveit-survey-2019/8663"},
{"title": "MoveIt! Maintainer Meeting Recap - July 25th, 2018", "thread_contents": ["1 - Introductions", "2 - ROS Melodic", "3 – GsOC", "4 – New OMPL interfaces", "5 – Intel", "6 – World MoveIt! Day", "7 – Monthly Meetings", "As a follow-up to the “ROS2 Grasp Library” mentioned in the meeting recap, please let me share the progress:", " ", " ", " ", "Maybe it’s a good idea to create a space for MoveIt to hold the advanced industrial robot applications developed on MoveIt? I have initialized a discussion for this in ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Status of ROS Melodic", "Building Melodic on Kinetic", "Progress with GSoC students", "World MoveIt! Day Planning", "New OMPL interfaces", "Potential Intel collaborations", "Switching to reoccurring monthly meeting of shorter length", "Michael ‘v4hn’ Görner", "Isaac IY Saito", "Jorge Nicho", "Dave Coleman", "Ian McMahon", "Gijs van der Hoorn", "Mike Lautman", "Zack Kingston", "Will Baker", "Nathan Brooks", "Matthew K Hansen", "Mark Moll", "Andy McEvoy", "Sharron Liu", "Matthew K Hansen from Intel", "Zack Kingston from RICE’s Kavraki robotics lab\n", "Works in MoveIt!, Robonaut 2.0", "\n", "Will Baker from Houson Mechatronics\n", "Worked on MoveIt! with Robonaut", "\n", "Nathan Brooks from Picknik", "MoveIt! migration PR still un-reviewed", "Most users still on kinetic", "No robot drivers, many packages still behind", "API changes in Melodic, pluginlib, TF2(ABI changes) , etc., make it incompatible with ROS- Kinetic. These changes bring ROS Melodic closer to ROS 2.0.", "Michael Görner update:\n", "Pull Request on grasping, grasp generation and tutorial.", "Fixes to MoveIt Grasp Package", "Detect Object button in Rviz being examined for possible fixes;  it currently does nothing.", "\n", "Andy McEvoy update:\n", "Mentoring student Mohamed.", "Working on new features for the Setup Assistant that work with Gazebo and add improved visualization", "ROS Control Integration in progress.", "Grasping screen, not much progress.", "\n", "Mark Moll update:\n", "Working on improving CHOMP and STOMP", "CHOMP’s original implementation is very brittle.", "MoveiIt! Website now has tutorials on how to setup those planners.", "CHOMP Author claims that planner has lots of downsides, especially when dealing with obstacles.", "STOMP optimization framework is very promising, needs repository maintainers to be more responsive.", "Collision refactoring issue is being addressed, a PR has been created.", "More participation from industrial_move maintainers, add new admins to keep development from stagnating.", "\n", "OMPL planner plugin refactoring allows new and existing planner implementation to load their own configuration, allows selecting planner types (joint planner, Cartesian planner) and reuse of configuration spaces.", "Big internal API change, for external user it should look the same; behavior effectively remains unchanged.", "Perhaps integrate into melodic?", "Pull Request is being broken down into smaller PRs.", "State Space discontinuity has been a long standing issue.", "Matthew K Hansen and Sharron Liu", "Focus in enabling ROS 2.0 for industrial applications.  Looking into enabling MoveIt in ROS 2.0", "ROS2 Grasp Library Presentation:\n", "MoveIt Plugin", "Prototyped GQCNN (originally trained with Tensorflow) grasp method with Interl OpenVINO, 93% success rate was achieved.  Original implementation has UCB license (not-for-profit) so it cannot be used for commercial purposes.", "Grasp Library Proposal, trained with caffe and RGBD image data.", "Alternatives to TensorFlow or Caffe Can is OpenVINO which provides hardware acceleration benefits.", "Goal is to create a ROS 2.0 Grasp Library with the option to enable OpenVIN.  A demo with the UR5 robot that works with MoveIt! will be created and documented", "\n", "Planned for October 25th", "Lessons learned document from last year is available.", "Not very well advertised.  Official announcement soon to come.", "Will start scheduling monthly meetings.", "The initial version of ROS2 Grasp Library was released (ROS2 Release on discourse ", "), enabled with OpenVINO Grasp Pose Detection and MoveIt. Verification with MoveIt 2.0+ is working in progress.", "A demo application ", " is enabled with MoveIt, demo video available on Youtube ", "\n", "Tutorial is also available guiding the development workflow. First evaluate the existing application with simulation tools (Rviz, robot fake controller, rosbag recorded point cloud), then apply customization for user hardware and working platform"], "url": "https://discourse.ros.org/t/moveit-maintainer-meeting-recap-july-25th-2018/5504"},
{"title": "Descartes MoveIt integration!", "thread_contents": [" and ", " are excited to be releasing a standalone ", " capability for planning semi-constrained Cartesian paths with ", ". This capability is a drop-in replacement for ", "'s ", " that uses a thin wrapper around Descartes instead of the very simple Cartesian planner in MoveIt Core.", "Check it out on ", "!", "Thanks for sharing! ", ", ", ", ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/descartes-moveit-integration/8724"},
{"title": "The MoveIt 2 journey (part 1): porting and understanding moveit_core", "thread_contents": ["The MoveIt 2 motion planning framework is an open source software for motion planning, manipulation, 3D perception, kinematics, control and navigation. It’s built on top of the Robot Operating System (ROS 2) and altogether, remains the third most popular package in the ROS world. MoveIt provides an easy-to-use platform for developing advanced robotics applications, evaluating new robot designs, and building integrated robotics products for industrial, commercial, R&D, and other domains. MoveIt 2 is is the ROS 2 version of MoveIt.", "This is the second of a series of articles to describe our learning experience and contributions with the MoveIt 2 and ROS 2 communities. The complete series is listed below:", "In this second part we will discuss ", ", one of the most relevant elements of the MoveIt motion planning framework. ", " includes the core libraries used by MoveIt 2. Mainly and as described on its original README:", ".", "At the time of writing, here’s the actual status of the port (available ", "):", "We are developing both in both OS X and Linux. To get initial support for both platforms and ensure good development practices, we decided to set up some initial (simple) CI with Travis ", " for both, Linux and OS X. This CI worked nicely and basically replicated the flow of the official installation instructions provided by Open Robotics in Travis. Unfortunately, this ", " got merged and we instead moved into a more sophisticated CI the moveit team has been maintaining: ", ".", "At the time of writing and while efforts have been put into enabling this for ROS 2 (credit to MoveIt maintainers), the moveit_ci isn’t yet ready to process ", " and other modules of moveit2. In an attempt to get aligned, our team has been working on ", " particularized for our infrastructure which successfully builds and tests ", " and all other packages we’re currently porting. This work is available at ", " and hopefully, it’ll eventually be merged and integrated ", ".", "At the time of writing, a first version of ", " is available and ported to ROS 2 in our ", "[1]. Most ", " submodules depend on a number of other ROS packages that had to be similarly ported to ROS 2 and fetched into a workspace:", "To ensure alignment with the community, Pull Requests have been submitted to MoveIt 2 ", " for the different ", " submodules as follows:", "Our investment in the MoveIt 2 project is made with a vision of long term. We hope to be involved with it for a very, very long time. However, nowadays, we have very limited resources and our commitment has been to put effort into contributing to deliver ", ". We hope this will drive the community to get involved faster in the project. At the same time, this means that sometimes we won’t fully port all dependencies nor all modules within each package. We’ll aim to port the minimum set of packages for creating a demonstration and then re-iterate on all the MoveIt 2 code, improving things on spirals as much as time and our resources allow for it.", "There’s still work to do including finalizing the port of unit tests or optimizing certain parts of the code with new ROS 2 primitives. If you have bandwidth to contribute and would like to get involved in a new fast growing project, we encourage you to jump in to any of those open pull requests or to create a new one with your contribution.", "In order to facilitate the involvement of third parties, we’ve generated simple instructions on how to reproduce our current setup in OS X and Linux:", "Moreover, we’ll be generating ", ". Furthermore, to reproduce the CI work locally, do so from the instructions at ", ".", "We’d like to credit our partners at PickNik for their support in the process and the MoveIt maintainers. Similarly, we’d like to thank William Woodall, Dirk Thomas and Tully Foote for their input.", "I appreciate your effort in creating MoveIt 2! I think a lot of groups have been waiting on MoveIt 2 before switching to ROS2.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", " (this one)", "representation of kinematic models", "collision detection interfaces and implementations", "interfaces for kinematic solver plugins", "interfaces for motion planning plugins", "interfaces for controllers and sensors", "[x] Install instructions", "[x] ", "\n", "[x] ", "\n", "[x] Upgrade continuous integration for ROS 2.0", "[x] Simple CI with Travis (Linux and OS X)", "[x] moveit_ci ", "\n", "[x] Convert all headers and link it to HRIM (contributed by ", ")", "[x] Update/setup infrastructure for development", "[x] Delete metapackages", "[x] Upgrade continuous integration for ROS 2.0", "[x] Refactor/cleanup folder hierarchy", "[x] Dependencies on other packages", "[x] tf2_kdl ", "\n", "[x] eigen_stl_containers ", "\n", "[x] geometric_shapes ", "\n", "[x] random_numbers ", "\n", "[x] srdfdom (contributed by ", ", ", " and ", ") ", "\n", "[x] urdf_parser_py ", "\n", "[x] Created a ROS 2 version (with package.xml) of urdfdom_headers ", "\n", "[x] octomap ", "\n", "[x]  octomap", "[ ]  octovis", "[ ]  dynamicEDT3D", "\n", "[x] Convert moveit_core packages to ROS 2.0", "[x] version", "[x] macros", "[x] backtrace", "[x] exceptions", "[x] profiler", "[x] logging", "[x] background_processing", "[x] kinematics_base", "[x] controller_manager", "[x] sensor_manager", "[x] robot_model", "[x] transforms", "[x] robot_state", "[x] robot_trajectory", "[x] collision_detection", "[x] collision_detection_fcl", "[x] kinematic_constraints", "[x] planning_scene", "[x] constraint_samplers", "[x] planning_interface", "[x] planning_request_adapter", "[x] trajectory_processing", "[x] distance_field", "[x] collision_distance_field", "[x] kinematics_metrics", "[x] dynamics_solver", "[x] utils", "[ ] moveit_ros\n", "[x] moveit_ros_planning_interface (", ")\n", "[ ] py_bindings_tools", "[ ] common_planning_interface_objects", "[ ] planning_scene_interface", "[ ] move_group_interface", "[ ] robot_interface", "[ ] test", "\n", "[ ] move_group", "[ ] planning\n", "[x] collision_plugin_loader ", "\n", "[x] rdf_loader ", "\n", "[x] kinematics_plugin_loader ", "\n", "\n", "[x] moveit_ros_perception\n", "[x] occupancy_map_monitor", "[ ] lazy_free_space_updater", "[ ] point_containment_filter", "[ ] pointcloud_octomap_updater", "[ ] mesh_filter", "[ ] depth_image_octomap_updater", "[ ] semantic_world", "\n", "[ ] moveit_ros_manipulation\n", "[ ] move_group_pick_place_capability", "\n", "\n", "[ ] Necessary for a Minimal Working Example (This list can vary, they are >the initial includes for the ", " that >is what we need for a ", " and ", ")", "[x] moveit_ros_perception\n", "[x] occupancy_map_monitor", "\n", "[ ] move_group\n", "[ ] capability_names", "\n", "[ ] planning\n", "[x] collision_plugin_loader", "[x] planning_scene_monitor\n", "[x] current_state_monitor", "[x] planning_scene_monitor", "[x] trajectory_monitor", "\n", "[ ] trajectory_execution_manager\n", "[ ] trajectory_execution_manager", "\n", "[ ] common_planning_interface_objects\n", "[ ] common_objects", "\n", "\n", "[ ] planning_interface\n", "[ ] planning_scene_interface\n", "[ ] planning_scene_interface", "\n", "\n", "[ ] moveit_ros_manipulation\n", "[ ] move_group_pick_place_capability\n", "[ ] capability_names.h", "\n", "\n", "[ ] New features in ROS 2.0", "[ ] Migrate plugin architecture to ROS2 nodelets", "[ ] Major refactoring and divergence from moveit2", "[ ] Run ROS2 C++ and python linters", "[ ] Delete excesses packages that are left over from rosbuild stacks: moveit_runtime, moveit_plugins, moveit_ros", "[ ] Rename non-package folders:\n", "[ ] rename moveit_planners to planners", "[ ] rename moveit_plugins to controller_interfaces", "\n", "[ ] Restructure folder layout of moveit repo:\n", "[ ] flatten moveit_ros folder to root of repo", "[ ] rename all moveit_ros folders with moveit_ros prefix", "\n", "[ ] Rename major classes\n", "[ ] ControllerManagers become ControllerInterfaces", "[ ] Rename related packages", "\n", "[ ] Merge repos:\n", "[ ] moveit 9.6 MB", "[ ] moveit_task_constructor", "[ ] moveit_tutorials  28.6 MB", "[ ] moveit_msgs", "[ ] moveit_resources  61 MB", "[ ] moveit_visual_tools", "[ ] moveit_advanced?", "[ ] DELETE: moveit_kinematics_tests", "\n", "[ ] Remove large binaries from moveit repo", "[ ] Add gitlfs?", "\n", " (with package.xml)", "\n", " (only octomap submodule ported)", "[1] ", "\n"], "url": "https://discourse.ros.org/t/the-moveit-2-journey-part-1-porting-and-understanding-moveit-core/8718"},
{"title": "Workspace for Testing MoveIt", "thread_contents": ["I’ve been very frustrated in trying to use MoveIt for the ARIAC competition. The challenge to me is more than ROS answers can provide. I’ve worked through the MoveIt Melodic tutorial but still cannot translate it into working with the Universal Robots UR10 arms. I am determined to figure this out.", "I’ve created a public ", " on BitBucket that contains the MoveIt Tutorial, the Panda Arm, and the ARIAC version of the UR10 code as submodules. There is a standard repository ", " that contains my attempts at using the UR10. There is a wiki explaining how to use the repository for your own experiments. I’m willing to add additional submodules for other robots if asked.", "I’m hoping this can be a general resource that adds to the existing MoveIt material. The Wiki especially could be a useful place for adding explanations of working with MoveIt.", "I’m willing to open it for others to work on this.", "Hi Rud,", "We welcome your contributions and help in making the MoveIt documentation better, thanks for these efforts.", "I would like to encourage you to contribute to our existing documentation and tutorials where applicable. You’ve correctly identified that we don’t have any exact UR10 tutorials. This is because we couldn’t possibly support every commercial robot arm in existence, and even maintaining more than one flagship robot example would be difficult.", "By all means, continue to work on your custom application as needed. However, if you plan on creating new MoveIt documentation content and tutorials, it would be best if they were contributed back to our main code locations (also thoroughly documented ", "):", "We are very fast at responding to tutorial changes, thanks to ", "’s dedication. In the past three years, our activity on tutorials alone:", "I’m trying to provide a place for testing MoveIt in new situations. Until an arm, to illustrate, is working with MoveIt there is no way to write a tutorial. If experienced MoveIt users look at the problems and provide answers on getting a device working then a tutorial can be produced. IMO this repository is better than asking on ROS Answers since all of the files that illustrate the problem are available.", "In working through the tutorials, as nice as they are, I feel they are more demonstrations of capabilities than explanations on how to make MoveIt work with other devices. One specific aspect I couldn’t find is setting up launch files to get all the background infrastructure operating. This may have been complicated with the ARIAC competition using 2 UR10 arms. I finally got some tips from 2 other competitors that are allowing me to get the arms moving. But the main contribution from the one competitor was the launch file setup.", "One specific aspect I couldn’t find is setting up launch files to get all the background infrastructure operating. This may have been complicated with the ARIAC competition using 2 UR10 arms.", "Yes, this.", "I’ve taken a look at both the ARIAC setup and your repository and from a beginners perspective they are way too complex. A single robot would be 10x simpler. A normal dual arm setup would still be about 10x simpler.", "In working through the tutorials, as nice as they are, I feel they are more demonstrations of capabilities than explanations on how to make MoveIt work with other devices. One specific aspect I couldn’t find is setting up launch files to get all the background infrastructure operating.", "In a normal setup, there is basically only a single file that needs to be created which starts up the various pieces, of which ", " is an example (and essentially, only two things need to change to use that with a real robot: have a driver started somewhere, and set ", " to ", ").", "Don’t confuse the ARIAC setup with a typical configuration of MoveIt.", "Hey ", ",", "I sympathize with your frustration and encourage you to take an active roll in improving the tutorials wherever you find they are lacking. MoveIt is a community driven project. Come join us by exploring the code, learning how the pieces fit together and making contributions back so that the next users will be slightly less overwhelmed.", "Regarding your criticism that getting the entire background infrastructure set up correctly is under-documented… I totally agree. In my opinion, that is the biggest shortfalls of the tutorials. I would love if someone like yourself would be able to take the time to document everything that is happening with the demo.launch file and turn that into a tutorial for new users.", "M", "If I could figure out what was necessary I would document it. But where do I go to learn it?", "Fortunately, someone else competing in the ARIAC competition provided me with a launch file that showed allowed me to make some progress. (But the arm moves like a drunk when I do Cartesian planning.)", "So I thought I’d try ", " after finding info about it in a reference. I get the arms up and running with Gazebo and other launch files. The bare command line knows nothing about the arms, of course. So I try:", "Is there something else I need on the command line? How can I know since nowhere is there documentation on what it needs to work. Why can’t it find ", " when my code can find it?", "Isn’t something like ARIAC exactly the situation where better explanation of configuration is needed? I also have done the NASA Space Robotics Challenge and found MoveIt equally frustrating to use then.", "This is the classic problem of software. If you aren’t in a group that already knows all the tricks you’re left fumbling for answers. I’ve been doing software since my first FORTRAN IV program in '68.", "It’s not just MoveIt. I worked on ", " for a robot I’ve built and modeled in Gazebo. I get so far and end up banging my head against the desk.", "This is the classic problem of software. If you aren’t in a group that already knows all the tricks you’re left fumbling for answers. I’ve been doing software since my first FORTRAN IV program in '68.", "It’s not just MoveIt. I worked on ", " for a robot I’ve built and modeled in Gazebo. I get so far and end up banging my head against the desk.", "I sympathise, but I believe taking a complex setup and then learning both the setup and the underlying systems is not the ideal way to approach this.", "If I have to understand how something works and at the same time how a particular (complex) setup works, removing one of those is the first thing I do (ie: go to a minimal setup).", "Isn’t something like ARIAC exactly the situation where better explanation of configuration is needed? I also have done the NASA Space Robotics Challenge and found MoveIt equally frustrating to use then.", "re: ARIAC: I’m not part of the organisation here, just a user, like you.", "My response to your post was just to let you know that some of the problems you’re running into are probably caused by the way the ARIAC cell is setup and the MoveIt configuration was created.", "Edit: and please don’t take my post as me dismissing your frustration or implying that what you experienced is not a problem. I just wanted to clarify that the ARIAC setup may not be the best to learn how to setup MoveIt yourself.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Tutorial on writing ", "\n", "Documentation repos for making changes:\n", "\n"], "url": "https://discourse.ros.org/t/workspace-for-testing-moveit/8617"},
{"title": "Announcing Realtime Robotics RapidPlan Integration", "thread_contents": ["Boston-area startup ", " has just released RapidPlan, its innovative solution for collision-free motion planning and we’re happy to announce that there is already a MoveIt integration in place. Over the last couple of weeks ", " implemented a planning plugin for MoveIt that allows running Rapidplan using the familiar planner interface.", "RapidPlan enables machines to navigate dynamic environments smoothly and quickly through high-frequency collision checking and planning using roadmaps. The framework can handle occupancy sensor data like point clouds and check for collisions in all roadmap edges at the same time using the  ", "   ", "  (MPA), a dedicated FPGA hardware board. The FPGA uses pre-generated roadmaps of states and edges, which encode the robot’s potential motion within an occupied space. RapidPlan comes with a graph-based path planner that together with the MPA enables planning rates of up to 1kHz. This makes RapidPlan highly equipped for a wide range of robotic applications that require low latency collision checking and short reaction times.", "To allow seamless integration with existing robot setups, ", " implemented a  ", "  motion planning plugin for MoveIt. The plugin should offer the full planning and collision checking capabilities via the common motion planning interface. The main challenge was the task of joining the two different methodologies. For instance: the plugin supports converting the collision objects in the planning scene to an occupancy voxel grid that can be processed by  ", " . Conversions of these types naturally come with a computational overhead that can reduce the planning rate. Other steps like converting motion planning requests, goal constraints, and processing the solution path also play into this. When using point clouds, the plugin can produce solutions with a rate of up to 700 hz which is more than appropriate for most real-time planning applications.", "The collaboration with ", " has shown that MoveIt is adaptable to new planning methodologies. Reliable real-time planning and collision checking are a long expected key features required by modern robot applications and also a driving factor for the development of ", ". The project has set out the importance of online-planning capabilities in current MoveIt versions and the just started implementation of ", ".", "          ", "\n", "That’s a pretty neat video.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/announcing-realtime-robotics-rapidplan-integration/8918"},
{"title": "MoveIt Maintainer Meeting Recap - April 25th, 2019", "thread_contents": ["Notes taken by Andy Zelenak", "The “!” is officially gone from the title of MoveIt", "Thank you ", " much. ", " No more grammatical conundrums in my tutorials!", "It’s uncertain if the Dashing release will be met", "Do you know when the decision will be made on whether to release in Dashing or not? I have a tutorial to do in September and I need to decide soon if I use an arm or a mobile robot.", "Thanks for the notes!", "Our team would’ve loved to participate in the meeting. Asked for an invitation but never got one (", " and ", ", what happened?). Would it be possible to post it (publicly) in advance the same way other groups are doing?", "I’d argue several of these points and further extend some others but unfortunately, we didn’t get the chance to participate.", "Overall, we are aiming to have a minimum set of functionality for Dashing including some demonstrators but certainly not a feature complete port (which was never the goal for Dashing). May/June are our internal deadlines.", "For anyone interested in the ROS 2 port, we’ll be having meetings from now on in the open through the ROS 2 Manipulation WG. First meeting already announced at ", ".", "Do you know when the decision will be made on whether to release in Dashing or not? I have a tutorial to do in September and I need to decide soon if I use an arm or a mobile robot.", "If you need to decide now, then I’d advice for a navigation tutorial however if you have still room for the decision, I’d advice to check back with us at the end of June. That’ll give you a nice picture of the status and enough time to prepare the tutorial.", "(", ") While our current roadmap finishes in June with the first demonstrators of MoveIt 2, provided we have enough resources, we probably will continue supporting the MoveIt community for a few more months.  This should push the maturity of the port over the summer.", ", my apologies for you not being included on the invite. We recently switched the calendar invite to be auto-populated based on the MoveIt maintainer Google Group. We had a breakdown in process where, when we added you as a MoveIt Contributor on ", ", we forgot to also add you to that Google Group mailing list. I’ve just sent you the invites to ensure this doesn’t happen again.", "Thanks ", "!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Dave Coleman", "Jon Binney", "Robert Haschke", "Ian McMahon", "Bryce Willey", "Gijs vd. Hoorn", "Jorge Nicho", "Nathan Brooks", "Mike Lautman", "Henning Kaiser", "Andy Zelenak", "Yu Yan", "real-time, Jacobian-based jogging at ~500-1000 Hz control rates", "Has been tested mostly on UR robots", "Will not work yet for most industrial robots because it’s not jerk-limited", "Exists in moveit_experimental for now", "The MoveIt tutorials page is getting busy", "May create a new page for larger demos/ integration tests/ tutorials", "Yu to provide an example he has already created", "Continuing the efforts of Zak Kingston and Ryan Luna to make the OMPL planning plugin more modular, i.e. you’ll be able to write your own sampling-based planner (or any other type of planner) in OMPL and use it in MoveIt without compiling MoveIt from source.", "Starting off by splitting up ", "\n", "First PR in the series: ", "\n", "MoveIt requested 1-2 slots through OSRF for students to work on the proposed projects focusing on collision detection and TrajOpt integration (", ").", "OSRF received many of it’s requested spots for Google Summer of Code students.", "The selected students will be announced May 6th, so be on the look out for new faces in the community.", "Travis CI limits test time to 50 minutes", "The MoveIt repo is large enough to often exceed that limit", "Mike is working on a Docker method to run tests locally", "Robert recommends a different approach, will work with Mike offline", "General approval", "Mike will continue providing a monthly report", "Accutronic is making good progress", "It’s uncertain if the Dashing release will be met", "Emphasize on high-quality, well-tested code vs. Dashing release, if needed", "This initial effort is mostly a port, an extensive rewrite is desired for later", "Planning can take several seconds, during which the PlanningScene could change", "Would be nice to update the PlanningScene faster in ROS2", "Accutronic is making good progress", "It’s uncertain if the Dashing release will be met", "Emphasize on high-quality, well-tested code vs. Dashing release, if needed", "This initial effort is mostly a port, an extensive rewrite is desired for later"], "url": "https://discourse.ros.org/t/moveit-maintainer-meeting-recap-april-25th-2019/8934"}
]