[
{"title": "Giving a TurtleBot3 a Namespace for Multi-Robot Experiments", "thread_contents": ["As I was researching, I noticed that ROBOTIS doesn’t provided a guide on how to run multiple TurtleBot3 robots together. It is especially dangerous if you run them in the same network because they all run on the same topic names and node names, which can interfere with their individual operation. So to help run multiple TurtleBots on the same network, you need to give each robot a unique namespace. The following guide will show you how to do this for the TurtleBot3.", "For this guide, we will be using ", " as the namespace we wish to use for our TurtleBot3 Burger robot. This helps us number our robots easier when running multiple robot experiments. This guide also assumes you have followed the procedure located ", " for installing and setting up your TurtleBot3 with ros2!", "Start by changing into your ", " directory of your workspace that also contains the ", " and ", " packages provided by ROBOTIS.", "Now, create two empty directories in the new package:", "Change into the ", " directory and create a new bringup launch file.", "In the ", " ros2 package, copy the contents of ", " into the ", " with the following changes marked as ", " in the following code:", "Next, copy the file ", " from the ", " directory into your package’s ", " directory. Make sure it has the same name! Once complete, make the following changes as marked by the following comments:", "Finally, copy the file ", " from the ", " package located in the ", " directory into your package’s ", " directory. Again, make sure it has the same name!. Modify the launch file with the following changes marked by the comments below:", "Now copy the ", " file located in the ", " directory of the ", " package, and make the following modification at the top!", "As you can see, the top most parameter used to be the node name (", " and ", "). For the node namespace that you added to work, you will need to add the node namespace (", ") one level ", " the node name!", "In Step 2, we already changed the launch file to point to ", " yaml file instead of the one located in the ", " package.", "For this section, we will just be adding a small code snipet to our ", " that will install the ", " and ", " contents of our ", " package.", "Add this snippet right before the ", " section of the ", " file.", "Finally, compile the code on your TurtleBot3:", "Now, run your launch file to make sure it works!", "You should get the following topics when you run ", " in another bash session:", "You can repeat these procedures with other TurtleBot3 robots with different namespaces to have multiple robots working in your network. Hope this helps and happy programming everyone!", ", this is really cool I’m going to try it out myself. ", "Great! Let me know if it works well with you!", " ", "There are currently 4 PRs on the stack, which you might want to take a look:", "\n[multirobot - Part1] Spawn multiple robots into Gazebo#1146", "\n[multirobot - Part2] Add namespacing to nav stack ", "\n[multirobot - Part3] Add multi-robot launching ", "\n[multirobot - Part4] Multiple robot control via RVIZ ", "Cheers!", " Nice tutorial! Thanks for your contribution ", " Cool, I did not know about these! Thanks for the heads up!", " Thanks! Glad you liked it!", " and ", ", can we get these tutorials added to the ROBOTIS E-manual and linked back to the ROS2 tutorials here:", "\n", "I think this is useful, but posting it to Discourse is not the best place for people to find it in the future.", "I’m more than happy to let ROBOTIS use the guide if I am credited. It is really up to them at this point! I also don’t know many places to post these other than my blog or the discourse channel. Do you have any suggestions?", "You can submit Tutorials to the ros2 Tutorials also, via pull request.", "Cool, I’ll try that!", ", ", ",", "Awesome! I am very grateful to ", ". It was also helpful when ", " had previously posted about using ", ". This time, I think it will be very useful information for many users. I have a plan to add this information in the ", ". Thank you very much. ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/giving-a-turtlebot3-a-namespace-for-multi-robot-experiments/10756"},
{"title": "What are the great multi-robot systems with ROS out there?", "thread_contents": ["To kick off this category, I would like to start a collection of cool existing ros projects/packages in this area.", "The ones I know are:", "Full Multi agents framework including MA-navigation and order (task) planner including rviz plugin and everything ", "A fleet manager to rule them all ", "A fleet manager for the one above if you have none ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", "\n", "\n", "\n", "\n", "\n"], "url": "https://discourse.ros.org/t/what-are-the-great-multi-robot-systems-with-ros-out-there/11831"},
{"title": "Multi-robot path planning", "thread_contents": ["Hi all,", "I am working on a multi-robot project where the robots are supposed to search an indoor environment. How would I go about doing this? How can I make the robots search different parts of the building?", "Are you still working on this? I never saw this post when it was first posted!", "Hi ", ",", "\nI am currently exploring this subject for my use case.", "\nWould like to know your work and approach on this.", "Thanks", " What would you like to know?", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/multi-robot-path-planning/6368"},
{"title": "About the Multi-Robot Systems category", "thread_contents": ["The Multi-Robot Operations category contains discussions on all aspects of tooling for multi-robot systems.", "Relevant topics include fleet management, multi-fleet integration, traffic/spatial planning, large-scale multi-robot simulation, and other related areas.", "Hi! Is there some discussion about a set of algorithms to distribuite a large scale number of robots in simulation with some criteria, for example, uniform distribution along an axis or random distribution in the 3D or 2D plane in the space?", "Could you please post this as a question. (Or can some mod move it to be a separate question ", " ?)", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/about-the-multi-robot-systems-category/11803"}
]