[
{"title": "HRIM models for communication components", "thread_contents": ["Right now it seems like there are ", " only. In traditional network monitoring the state of network components like managed industrial switches, industrial wlan access points, etc. is gathered via protocols like SNMP or via other interfaces. What’s the state of the ", "?", "Hello ", ",", "Right now our main contributions to the HRIM project is in sensors and actuators. But we are really excited about adding more and more models to HRIM. Communication is a very interesting. Can you provide more details about what are you looking for?", "We can start a discussion about what you need and introduce these new models into the HRIM project.", "Hi ", ",", "probably it’s necessary to add some additional contextual information to help people understand why there is the need for a ", ".", "Ethernet switches are potentially contained in ROS2 communication network infrastructures connecting several components of an overall robotics application.", "The status of switches may lead to data throughput (safety) and security issues in the application. Monitoring the status of Ethernet switches is possible using external tools of the traditional IT monitoring domain. However integration of the observed data into the ROS2 application is not straightforward and the observed data may not be considered real-time.", "A HRIM model for Ethernet switches would enable the integration of observed data into ROS2 application with better real-time characteristic.", "Ethernet switches are usually managed. This means they provide at least one interface which allows the configuration and observation of the switch configuration and status. Typical interfaces are protocols like ", ", ", ", etc. .", "A typical industrial Ethernet switch is e.g. the ", " ", ". ", " define what data may configured/observed. The HRIM model should reflect all characteristics of switches relevant for ROS2 applications.", "I’ll have a look into the ", ". Probably I’ll think about and propose a model as PR.", "Hi ", ",", "Nice discussion!  As ", " explained we focused mainly in sensors and actuators so the communication part is completly open to discussion.", "Here are some ideas that in my opinion would be the way to go for HRIM communication models.", "I’ll have a look into the [HRIM models (", "). Probably I’ll think about and propose a model as PR.", "I think in this what make makes more sense to me is to reuse the existing network management models (", "). A first approach could be a simple wrapping of these models in HRIM.", "The status of switches may lead to data throughput (safety) and security issues in the application. Monitoring the status of Ethernet switches is possible using external tools of the traditional IT monitoring domain. However integration of the observed data into the ROS2 application is not straightforward and the observed data may not be considered real-time.", "For this topic the  ", " proposal is going to be very relevant. One of the aims of this proposal is to be able to configure a TSN network based on the DDS QoS requirements. I think this fits very well with the aim of HRIM because the network configuration would follow a more DDS approach, and hence, a more ROS 2 approach. For instance, a robotic component would specify their network requirements (bandwidth, deadline, LatencyBudget) and a network manager would try to configure the network in order to meet these requirements. If the network configuration fails (not enough bandwidth for example), the network manager would inform the component about the failure the ROS 2 application won’t reach an active status.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/hrim-models-for-communication-components/9613"},
{"title": "ROS For Beginners: Localization, Navigation and SLAM", "thread_contents": ["Hi", "I am pleased to announce the release of my new course", "ROS For Beginners: Localization, Navigation and SLAM.", "The course has currently 2.5 hours with 47 lectures. It covers all the fundamental concepts of localization and navigation. It also present the theoretical background needed to understand ROS navigation.", "I am working during this summer to extend this course with more advanced concepts of navigation and I will explain in detail how to tune the navigation stack to improve the navigation.", "I am offering a discounted price for the early access to this course using this link with coupon", "It will be enabled for 48 hours and the first 100 subscribers.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-for-beginners-localization-navigation-and-slam/9733"},
{"title": "IEEE ROS 2 Summit 2019 report - 600 developers!", "thread_contents": ["Here’s a bit re last month’s ", " in Taipei put together with the help of many. You’ll notice familiar faces including ", " plus ROS 2 dashing demos. 600 developers & roboticists made it … the biggest ROS 2 event ever? Here’s the ", ", lots of great talks and a big panel too.", "\n", "oops, correction it was only 570 developers, not 600", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ieee-ros-2-summit-2019-report-600-developers/9610"},
{"title": "ROS2 type masquerading status and alternatives?", "thread_contents": ["Hey!", "\nI’ve taken on the challenge of porting both the “velodyne” driver package and “perception_pcl” from ROS -> ROS2 and as discussed here ", " and here ", " type masquerading is one of the big missing pieces to at least more easily port it to ROS2. Discussions ongoing here as well ", "The ROS2 road map (", ")  also mentions this to be quite a major undertaking. So I have 2 question in relation to this:", "Is there any timeline for this, or has anyone started the work on this? Do you have any expected time frame, 1 - 6 months as when this might be available as an alpha implementation ?", "What would a viable alternative be ? Trying to do something similar to what is shown here ", " passing pointers. The other thing I was thinking about was to implement most of the PCL types as PCL-messages in the “pcl_msgs” package.", "\nMaybe you have some other/better idea on how to solve this?", "Many thanks,", "\nBest regards/Andreas", "Is there any timeline for this, or has anyone started the work on this?", "No, and not yet.", "Do you have any expected time frame, 1 - 6 months as when this might be available as an alpha implementation ?", "It really depends on when someone has resources (time and/or funding) to work on it. I think it’s a super important feature, but there are a lot of other things that need to be worked on as well. I thought I’d get it implemented for Dashing but then priorities changed and it got dropped. I expect it will take 4-6 months (real-time not necessarily person hours) to implement once we start working on it, but we’re not working on it right now.", "What would a viable alternative be ?", "You can always convert back and forth to a the ROS point cloud and then intra-process communication will just work, but doing so without converting (just sticking with PCL types) is not going to work right now (at least not without something hacky). There are a lot of workarounds you could do, but none of them will be future proof or really clean right now.", " tangentially to your question - you probably have not seen our port ", "?  We will be upstreaming this to ", " in the next couple of weeks.", "While doing the port we also took the chance and substantially changed the driver design which we then also described in this blog post: ", ".", "One of our engineers spent significant time prototyping an optimal type conversion solution. I’ll let him comment on it.", "Thank you for your answer. I’ve had a brief look but not in depth. The blog looks great, and I will take a deeper look into your velodyne node implementation as well.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", "\n", "\n", "\n"], "url": "https://discourse.ros.org/t/ros2-type-masquerading-status-and-alternatives/9461"},
{"title": "Call4Participation to Robot Security Survey", "thread_contents": ["Dear Roboticist,", "Many now agree that robotics is set to be the next major technological revolution. A robot can be defined as a cyber physical system that can automate traditional and nontraditional tasks of humans in an automated manner. Adding new capabilities is increasingly important for the robotics domain, but security aspects are rapidly gaining relevance with the advent of industry 4.0 and IoT.", "Security should not be mistaken with safety. Safety is about preventing the robot harming the environment where it operates, whereas security is about preventing the environment from harming the robot.", "Thank you for participating to: ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/call4participation-to-robot-security-survey/10290"},
{"title": "Last call for EU-funded Focused Technical Projects (FTPs) and Education Projects (EPs) by ROSIN-project: Deadline September 13, 2019", "thread_contents": ["Dear European ROS community members,", "it is only one month to the next & maybe final* ROSINproject ", "  & next ", " funding round!", "Cut-off date for both calls is September 13, 2019.", "As an inspirations, please also check our running projects:", "*= depending on funds left, there ", " be another FTP round in November.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/last-call-for-eu-funded-focused-technical-projects-ftps-and-education-projects-eps-by-rosin-project-deadline-september-13-2019/10266"},
{"title": "Safety Critical WG meeting #20191010", "thread_contents": ["Minutes for the Safety Critical WG’s meeting on 2019/10/10.", " Geoffrey Biggs", "Mirror the wiki to the repository so that contributions can be made via PRs that can be discussed; the wiki itself will be locked from direct editing.", "This can be automated: ", ".", "That’s the plan! I’ve done that in the past for the old Autoware repository/wiki, and it works really well.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Geoffrey Biggs", "Shawn Schaerer", "A GitHub repository for the working group has been created\n", "\n", "The plan for this repository is to use it to host information about best practices for using ROS in safety critical robots.\n", "Use its wiki to host information in a viewable format", "Mirror the wiki to the repository so that contributions can be made via PRs that can be discussed; the wiki itself will be locked from direct editing.", "\n", "Initial content for the wiki will likely be how to construct common patterns for redundancy and availability in ROS."], "url": "https://discourse.ros.org/t/safety-critical-wg-meeting-20191010/10965"},
{"title": "Calling SolidWorks URDF Exporter Users! Reference request", "thread_contents": ["Greetings all,", "I’m looking for users of the SolidWorks to URDF exporter who would like to provide ", " to SolidWorks to support my application as Solution Partner. The reference should take about 20-30 minutes. Please email me at ", " if you are interested in helping out!", "Requirements:", "\nActive SolidWorks user, and active SolidWorks to URDF exporter user", "\nAffiliated with a business (sorry, no student users)", "The Solution Partner program provides me with access to SolidWorks products to help maintain and develop the exporter plugin. Everyone knows how expensive this software can get, and this program provides a license to me to test and evaluate any changes I make.", "Thank you all for your community support of this FOSS software!", "\nStephen", " I am going to see if I can’t help you out here. The SolidWorks URDF exporter is a really important tool for the community. Do you have an idea of how many references you need?", "Hi ", " thanks for your initiative.", "\nAt ", " we daily use SolidWorks for mechanical design and we have recently started using the URDF exporter to easy up robot model creation and maintenance.", "\nWe have detected an issue that would be really important to solve: when “Override Mass Property” is used, model mass isn’t correctly exported. This is critical for getting a reliable dynamical model of the robot.", "\nWe are going to fill the reference request form to support your application.", "Best regards!", "Thank you Katherine and Luca! I only need two actually, and have received one so far. Someone else contacted me personally in response to this thread, so I think I’m covered.", "Apparently I was supposed to apply for this partner level several years ago, but only was recently notified that I needed to get on the application or my current partner status would be revoked.", " I agree that overridden mass properties would be very helpful, but I haven’t found a way to incorporate them through the SolidWorks API. I looked into the issue extensively about a year ago, but couldn’t find a way with the API they provide.  I’ve started an ", " for the add-in to track that discussion.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/calling-solidworks-urdf-exporter-users-reference-request/10932"},
{"title": "Reactive ROS", "thread_contents": ["Hi,", "Just out of curiosity, did someone experiment with ROS and the reactive programming paradigm ?", "It seems to me this could be a good paradigm to introduce in ROS to give a more theoretically sound basis for it s distribution mechanism (ROS messages are events transmitted via streams). Has anyone tried that yet ?", "Considering a ROS application a system where the behaviour is as much determined by the flow of data as it is by the way it is orchestrated is something I think many of us have been doing for a long time, precisely because – as you write – it is a natural way to think about these systems.", "I’ve seen quite some applications where ROS is essentially used to physically distribute what is essentially a monolithic program with a traditional (imperative) flow of control over a set of nodes that are all tightly coupled in both time and space by just replacing regular function/method calls with RPC (services). Those typically also include some form of sampling (storing ‘the latest’ msg in a member variable, delagating the processing of data to a separate flow of control), which can lead to synchronisation issues between components and dataflows (the ", " problem with late laser scans is a famous example of this).", "Perhaps it would be a good idea to expand the ", " page with some actual software patterns. Reactive (or Event Based) systems would seem to be a good candidate.", "The ", " tool does something similar to what you ask for.", "roshask - Haskell client library for the ROS robotics framework.", "wow, roshaskell is pretty cool, thanks for that Geoff. I’m sure Brian would remind us that if you want functional-style ROS, roslisp has been around since basically the beginning. But uh, I like the type system of Haskell a lot because talking about monads makes me feel cool.", "ROS was developed before the React community came about but the frameworks seem to have come out of similar needs. It appears that the community articulated their design principles in a nice application-inspecific way: ", "The stream abstraction in the React paradigm is great. It’s basically the abstraction of TF that I talk about sometimes. An API for reaching backwards in time across information streams is ", " useful and a repeated pattern in robotics and controls.", "For anyone thinking about ROS 2, I saw a presentation one time where Sumant, an RTI engineer, talked about using RxCpp as an intra-process communication mechanism to be used alongside DDS. Cool ideas all around.", "RxCpp - Reactive Extensions for C++", "Thanks for the feedback. I think I ll dive into ", ", and check what can be done with ROS…", "This is very cool topic. Recently I worked on a ", ", which wasn’t using ROS but ", ".", "Have there been any more development in this space (the last comment is ~2yrs old)?", "We now have RxROS (just released into Kinetic and Melodic): ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/reactive-ros/1176"},
{"title": "ROSCon 2019 Birds of a Feather (BOF) Sessions", "thread_contents": ["ROSCon is fast approaching. One of the best parts of any conference is the hallway track; where like minded individuals can meet and chat about their favorite topics. If you would like to host a birds of a feather session during ROSCon please post it here. The best times to have these sessions is during lunch, during the breaks, and after the conference. You can find the ", ".", "If you would like to orchestrate a BOF session please list the following:", "If you see a session you would like to attend please let the organizer know.", " and I have been discussing a chat on ", " (perception_pcl, image_pipeline, vision_opencv, slams, etc) and a potential formation of a perception working group.", "Update:", "Lets do Day 2 lunch, find me – should be easy the only person with a sling on their arm.", "I would like to discuss robotics system integration and fleet management for ros application with certain use-cases. this is not really exactly about ROS core technical perspective, but more importantly for users how to manage the robots in their use cases. not sure if anyone interested in this topic, but if there is, we would like to share opinions.", "Day#2 during lunch would be nice to me. (but can be flexible)", "\nif anyone intereseted on this topic, please try to reach out via linkedin (Sony, Tomoya Fujita) !!!", "Thursday October 31st (Day 1) @ 15:30 coffee break", "Loulan 4105", "We’ll try to have a sign on the table, and you should be able to spot members of Open Robotics’ simulation team.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["A time you want to meet.", "A topic you want to discuss.", "A rough location or a way to find you (twitter, a weird hat you’ll wear, or an online profile so people know what you look like). There is an ad hoc meeting space located in Loulan 4105. Use of the space will be casual and is first come, first served. As well corners of hallways and the reception areas can also be utilized."], "url": "https://discourse.ros.org/t/roscon-2019-birds-of-a-feather-bof-sessions/11054"},
{"title": "Funding for SMEs by RobMoSys project: Deadline November 13, 2019", "thread_contents": ["Dear ROS community,", "I would like to draw your attention to Instrument ", " of our currently ", ", which could be interesting for SMEs and small teams in large industrial companies.", "In Instrument ", " we are looking for Fast Adopters to boost the RobMoSys approach in the industry. Within the RobMoSys project, we can offer Fast Adopters funding to ", " for a runtime of ", ".", " is an EU- H2020 project whose goal it is to create and consolidate an EU Digital Platform for Robotics to establish a common methodology for model-based software development.", "What do we expect from participants of Instrument # 1?", "\nThe funded projects must develop RobMoSys-conformant pilots (industrial case studies) based on existing assets (software and tools from the RobMoSys ecosystem).", "They are not expected to build applications with fully RobMoSys-conformant software components, but at least two of these RobMoSys-conformant components have to be implemented.", "The call is open until ", "If you have any questions, please do not hesitate to contact me to ", " or send to opencalls@robmosys.eu", "We will get back to you as soon as possible.", "Just a slight remark: this multiline ticker that changes the text layout every few seconds needs to be gone!", "\n", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/funding-for-smes-by-robmosys-project-deadline-november-13-2019/11293"},
{"title": "ROS trending Hacker News", "thread_contents": ["ROS is trending in the front page of hacker news, just in case your ears are burring:", "Please help to add all the new tooling from ROSCon and IROS 2019.  Unfortunately, I wasn’t there. I do what I can based on the public resources.", "Would be good if ", " could post some comments under some of the top-rated comments. Just mention of ROS 2 and it trying to address the issues the community has identified in ROS 1 would already go a long way.", "I see multiple “there is no QoS”, “custom build tool” and “difficult to integrate with” comments. That last one is admittedly still not completely solved, but the first two are not true any more and scare a lot of potential new users.", "I’m already on it but could need some help.", "Hello all, found you guys from the HN post. ROS looks like a super cool project!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-trending-hacker-news/11335"},
{"title": "ROS2 Security Working Group Online Meeting 2019/10/29 11:30 MDT", "thread_contents": ["Hello ROS2 Security Folks - We will have the October monthly ROS2 SWG meeting Tuesday 10/29 at 11:30 MDT", "Dialin Info:", "Real-time meetings by Google. Using your browser, share your video, desktop, and presentations with teammates and customers.", "\n", "\n", "‪+1 385-325-0281‬ PIN: ‪422 295‬#", "Agenda: ", "Moving forward we will have these meetings on the last Tuesday of each month, unless folks want to change it, we are flexible.", "I look forward to chatting with you all.", "Cheers,", "\n-Joe", "If you have any additional agenda items, please make a comment here and we’ll add them!", "Thanks for managing this ", " ", " !", "I’d love to attend this meeting however I will be in the middle of the ocean around this time (and I guess many of us attending ROS may as well). Is there any chance we can move slightly this before or after ROSCon to avoid collisions?", "Apologies for the inconvenient request.", " ", "i would love to join but as ", " mentioned, i will be too on flight.", "Hey ", " and ", " sure thing, Lets do it on 11/12  at 11AM MDT. The calendar invite has been updated.", "Cheers,", "\n-Joe", "Note that the TSC has a new calendar and new invitation groups per working group, more details ", ". Going forward (including for this upcoming meeting), ", " will no longer be used. Please join ", " to receive invitations specifically for the Security working group.", "it is scheduled not really friendly time for Asia Pacific… but will try, since there is no perfect time for everyone.", "The notes (and recording) are posted in the ", ". This is a slight departure from the way the Working Group used to work, but we copied over previous meeting notes and think it’s generally more open and discoverable.", " we will look into varying times to try and cover more timezones, thank you for the feedback!", "we will look into varying times to try and cover more timezones", "appreciate it.", "Recommendation for using syslog in common logging format. Common Event Format (CEF). How open of a standard is this? Could use this in DDS logging plugins as well.", "not sure what is discussed on this, rcl_logging_syslog or something? or just a format? if i may, could i have more information on this?", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros2-security-working-group-online-meeting-2019-10-29-11-30-mdt/11157"},
{"title": "Robot Security Survey updates and first results", "thread_contents": ["Dear roboticists,", "For those of you awaiting Survey Results, attached below a blogpost summarizing some of the preliminary results and first conclusions out of the Robot Security Survey. I just presentated it in Cybersecurity for Robotics (CSFR19) event in Bilbao (Spain) as a joint effort by Alias Robotics and Joanneum Research.", "Find there as well, some relevant results about security perception improvements in ROS are published.", "We present some  results from an online survey (Robot Security Survey) conducted by Alias Robotics and  Joanneum Research. We aimed to assess the overall security status and awareness on robot security and the degree of uptake of security measures...", "Thanks very much for those of you who participated! And we’d love to hear back from those of you who still didn’t. The survey will be still online for some time.", "Please feel invited to participate in: ", "Feedback, of course, is always welcome!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/robot-security-survey-updates-and-first-results/11556"},
{"title": "Safety Critical WG meeting #20191124 minutes", "thread_contents": ["The safety critical working group held its biweekly meeting today. The minutes can be found here:", "ROS safety working group repository", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/safety-critical-wg-meeting-20191124-minutes/11600"},
{"title": "Thank you!", "thread_contents": ["Just want to acknowledge the fantastic work and say “Thank you” to everyone who contributed to ROS/ROS2!", "The documentation is very thorough and detailed!  Appreciate all of the hard work to make learning and using ROS easier.", "Best regards,", "\nScott", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/thank-you/11708"},
{"title": "Couldn't find executable named talker.py", "thread_contents": ["hello,", "\nI’m new to ros and I just go through the tutorial while running the created publisher and subscribers in python I got an error like this", "\"", "\nmishra@mishra-OptiPlex-3060:~/catkin_ws/src/beginner_tutorials/scripts$ rosrun beginner_tutorials talker.py", "\n[rosrun] Couldn’t find executable named talker.py below /home/mishra/catkin_ws/src/beginner_tutorials", "\n[rosrun] Found the following, but they’re either not files,", "\n[rosrun] or not executable:", "\n[rosrun]   /home/mishra/catkin_ws/src/beginner_tutorials/scripts/talker.py", "\nmishra@mishra-OptiPlex-3060:~/catkin_ws/src/beginner_tutorials/scripts$", "\n\"", "\nwhat should i do ?", "i believe that this is not the place to ask questions, you could ask ", " .", "and it just seems like that you do not load your catkin workspace.", "\nmaybe you could the following procedure,", "\n", "\nI’m really sorry for that .", "\nand yeah i did that, i bulid my catkin_ws after load the scripts .", "can i repost the qustion in rosanswers?", "Yes please, let’s continue with this in ROSAnswers. BTW, did you make your script executable?", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/couldnt-find-executable-named-talker-py/9474"},
{"title": "[Research] Survey on Robotics Software Engineering", "thread_contents": ["I hope this post doesn’t violate the rules of the community.", "I am conducting an industry-wide survey on software-engineering practices in mobile and service robotics. I would like to invite robotics practitioners and researchers to participate. Participating will allow you to reflect on your practices and learn about others’ practices, by receiving a state-of-the practice report with the survey results. It will also help the research community focus on relevant problems that meet real industrial needs.", "\nFilling in the questionnaire will not take more than 15 minutes. It elicits industrial engineering practices and challenges, and is available at: ", "Your response will be anonymized and described in a report without revealing your identity or company name. At the end of the questionnaire, I ask you to provide your name and email for verification and analysis (e.g., to identify duplicates), to be informed about the study results, and whether you opt-in for future clarification questions.", "I would also be grateful if you could forward this invitation to any of your colleagues working in this area. If you have any questions or concerns, please do not hesitate to ask me.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/research-survey-on-robotics-software-engineering/9505"},
{"title": "Kinetic Ubuntu 16.04 on Toyota HSR", "thread_contents": ["I am trying to get Yolo to work on an updated Toyota HSR robot. It was shipped with 14.04. Is it even possible to get Yolo with !6.04 and kinetic running on this system?", "Thanks.", "Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ", " provides a Q&A site which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/kinetic-ubuntu-16-04-on-toyota-hsr/9601"},
{"title": "To the German (speaking) community members that travelled to Macau and have issues with their travel reimbursement for ROSCon2019", "thread_contents": ["To the German speaking members that travelled to Macau and have to report travel costs for ROSCon2019… (as this is referring to some German administrative issues, I post the following in German language.) If your travel expenses reimbursement are settled according to the German Federal Travelling Expenses Act2 (Bundesreisekostengesetz) this could be of interest for you…", "+++", "Hallo ROS-Freunde,", "sollten Ihr Probleme mit der Reisekostenvergütung Eures ROSCon2019 Besuches in Macau haben, so habe ich eine Email aus dem Auswärtigen Amt, aus der hervorgeht. dass die anzusetzenden Kosten bei Macau denen von Hongkong entsprechen sollten und nicht denen von Festland-China.", "Das heisst, dass die Pauschalbeträge für Verpflegunsmehraufwendungen nicht 50 sonder 74 EUR und die für Übernachtungskosten nicht 78 sondern 145 EUR wären.", "Gruß", "Thilo", "Hallo Thilo,", "inwiefern geht dies aus dem .pdf hervor? Dort taucht Macau gar nicht auf und es ist vermerkt, dass", "\n", "Daraus ergibt sich für mich, dass für den Pauschbetrag China und nicht Hong Kong maßgeblich ist.", "Viele Grüße", "\nPatrick", "es geht nicht aus dem pdf hervor, sondern aus der Email, die ich Dir soeben weitergeleitet habe…", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/to-the-german-speaking-community-members-that-travelled-to-macau-and-have-issues-with-their-travel-reimbursement-for-roscon2019/11931"},
{"title": "Navigation2 WG cancelled 1/9", "thread_contents": ["Due to CES and not a lot of new issues to discuss, I’ve cancelled this weeks Nav2 WG.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/navigation2-wg-cancelled-1-9/12227"},
{"title": "Tutorial introducing Numba", "thread_contents": ["I feel Python gets relegated to bring glue or “that thing we write some of the tools in” too much in ROS and anything performance critical or CPU heavy gets done in C++. The Numba JIT compiler does a lot to bridge this performance gap. I’ve been using it a lot lately and thought to make a reasonably thorough intro video for it. I hope it can help someone here.", " is another valuable resource to implement high performance soft realtime capable systems.", " High Performance Python is indeed a good resource.", "Another thing to consider when using compilers is code runtime predictability. AOT (ahead of time) compilation leads to predictable code runtime. When JIT (just in time) compilation ist used the first execution of e.g. a function takes way longer than following executions of the same function.", "For sure. Numba can AOT compile functions in almost all cases which is pretty nice but there’s still situations where that can’t be done. I’ve seen some folks forcibly run the functions they are providing at import time which can also be helpful.", "On the subject of maturity, I would have classified Numba as an immature project when I first encountered it in 2017 but I wouldn’t say that about it now.", "For sure. Numba can AOT compile functions in almost all cases which is pretty nice but there’s still situations where that can’t be done. I’ve seen some folks forcibly run the functions they are providing at import time which can also be helpful.", "I personally prefer to have full and explicit control about whats going on. Forcing functions to execute once initially sounds error prone to me. However If it works for these folks … great.", "Numba is great for sure. It’s just no fit for me.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tutorial-introducing-numba/12107"},
{"title": "authority concerns on trade issues about US EAR", "thread_contents": ["We are concerned about the authority of ROS as recently arised trade issues between US and the rest of the world (especially China). We are looking forward to get your official answers for the questions below:", "Just to clarify this is the ", " mentioned. The TL;DR is that this is a new regulation imposing ITAR restrictions on software related to the automated processing of geospatial data using deep learning.", "I am in a unique position in that I used to work on this type of software at a previous employer. I do not believe this law applies or is intended for the ROS community. It seems to be narrowly scoped to be applied to deep learning for satellite geospatial imagery. Having said that, I am not a attorney, and this is just my personal opinion. If you are concerned about this issue you should consult with an attorney.", "Could this be something OR could make sure of for at least something like ", " and the other official variants (REP-142, REP-150)?", "That would help avoid confusion and uncertainty (and perhaps a lot of work for lawyers, but ", " ", ").", " Where in ROS core do you see these specific tasks? The order it is very narrowly scoped to impact a specific set of vendors that provide products for that particular workflow.", "In my experience it doesn’t really matter what I believe or how I see things, especially in contexts that are sensitive to these kinds of topics (ie larger corporations looking to make use of externally developed components), as I’m not a lawyer.", "Seeing as much (most?) of ", " and related packages is essentially under OR’s control, it would be beneficial to have a statement that says something like you just wrote.", "True enough, but you can’t have a lawyer check ", " ECCN. What makes this ECCN special? Given the part that ", " quoted, I don’t see how anything in ", " (or even ", ") could possibly fall under the scope.", "True enough, but you can’t have a lawyer check ", " ECCN. What makes this ECCN special?", "Not every one, no. But this one has gotten a bit of attention.", "And the questions don’t come from engineers who know what is going on or what they’re using.", "Given the part that ", " quoted, I don’t see how anything in ", " (or even ", " ) could possibly fall under the scope.", "Again, it doesn’t matter what I (or you) see or imagine.", "I’ll withdraw the request though: let’s see what happens and how many questions we get about this (both on and off-line).", "Not every one, no. But this one has gotten a bit of attention.", "And the questions don’t come from engineers who know what is going on or what they’re using.", "Ok, that partly answers my question “what makes this ECCN special”: you seem to have gotten questions before about this, whereas for me this thread is the first I heard of it. If this specific ECCN is something that many (potential) ROS users care about, we should consider an official statement. I think it hasn’t gotten to that point yet, or have I missed something completely? (honest question)", "Again, it doesn’t matter what I (or you) see or imagine.", "I think the point where we agree is that if you have doubts whether a given legal document applies or not, you should hire a lawyer instead of doing your own guesswork. I think the point where we disagree is that you seem to have those doubts, whereas I don’t.", "I could of course provide absurd examples of ECCNs where we would both agree that they have nothing to do with ROS or even with software in general, so what you and me “see or imagine” clearly does matter to an extent.", "and perhaps a lot of work for lawyers", "The ol’ shuffling lawyers fees to the other folks trick, very clever ", ".", "But more seriously, I think this starts a bad precedence making it OR’s problem to tell people if they are allowed to use [ROS and related stuff] according to [some treaty, international restriction, etc]. That would be a never ending battle at great legal expense to OR for a company’s individual concerns.", "And as a personal, non-legal opinion, that restriction has nothing to do with their field of robotics or ROS. I don’t think it should be a concern unless you’re using ROS for a geospatial application, but in that case its still not ROS’s fault that you’re using that technology in that way.", "Are there other ECCNs that may be relevant to the core parts of ROS?  Surely some UAVs and components must be covered?  Especially the large, long-duration stuff.", "Given how long these documents are, it seems unlikely there is only one ECCN relevant to mobile robotics.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Is the ROS project subject to U.S. Export Administration Regulations (EAR) and classified under ECCN 0D521? Or such AI software is subject to EAR, but not classified under ECCN 0D521?", "Is U…S. Bureau of Industry and Security license required for exporting this project to China？"], "url": "https://discourse.ros.org/t/authority-concerns-on-trade-issues-about-us-ear/12446"},
{"title": "The Future of ROS Simulation, 2025", "thread_contents": ["Hey All,", "\nSo I’m not sure what category this question really falls into but here it goes…", "Gazebo Sim has a EOL date of 2025. Meaning, as of now, the software will no longer be developed/supported after then. Since Gazebo is the primary simulation supporter of ROS what does this say about ROS’ future? Will another simulation environment take Gazebo’s place? Will ROS become deprecated or “useless” without Gazebo and replaced fully by ROS2? What does this say about robotics simulation competitions by organizations like NASA, FetchIt, DARPA, etc?", "Curious of your thoughts.", "Thanks.", "Hi Stephen,", "The simulation team at Open Robotics is currently working on the release of Gazebo 11, which is planned to be the last version released from the ", " codebase. As you mentioned, Gazebo 11 will EOL in 2025 (which, by the way, is also the expected EOL year for ", ").", "The team is also working on the next generation of Gazebo, called ", ". Ignition has already had 2 named releases (", " and ", ") and the next one, codenamed ", " is coming up before the end of the year. Citadel will be Ignition’s first ", ", but we still expect large changes in the upcoming versions, as the codebase is currently under fast-paced development. You asked about competitions, and in fact, the ", " is already using Ignition Blueprint with ROS Melodic.", "Having said all that, both Gazebo and Ignition are projects independent of ROS or ROS 2. Users are able to use ROS with other simulators, as well as Gazebo / Ignition with other frameworks. However, since Open Robotics maintains all of them, we make sure that they’re all well integrated ", " Here are some more resources for you:", "Cheers", "I have few questions about Ignition;", "Hey Louise, I was looking into some of the documentation for Ignition and I saw that it is installable on  macOS. Will the ros2 integration be added to the macOS version as well?", "Can be used as a drop-in replacement of gazebo or does the user need to change something in their system?", "The SDF files can remain basically the same, but the plugins need to be completely rewritten. It’s currently not trivial to port plugins and that’s one of the things we’re working to improve. Meanwhile, here are some relevant resources:", "Is it possible to run ignition without any graphic interface, for example to create end-to-end testing?", "Yes, like Gazebo-classic, Ignition uses a client-server architecture, so you can choose to run simulation headless (i.e. ", " for server only and ", " for GUI only). That’s currently being used to run ", ", for example.", "Is there a list of features that Citadel will include?", "Here’s the ", ". The Citadel section is being updated with more bullets soon.", "Will the ros2 integration be added to the macOS version as well?", "You should already be able to build ", " ", " on OSX for ", ". If that’s not working, please open an issue on that repository with the specific problem you’re seeing (or even better, open a PR fixing it ", ").", " see this ", " regarding MacOSX.", "Also, check out the ", " project; which is bringing the OpenAI (RL) capabilities into Ignition.", "I interviewed Louise about Ignition Gazebo for the ROS Developers Podcast. You can listed to the interview here: ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Can be used as a drop-in replacement of gazebo or does the user need to change something in their system?", "Is it possible to run ignition without any graphic interface, for example to create end-to-end testing?", "Is there a list of features that Citadel will include?"], "url": "https://discourse.ros.org/t/the-future-of-ros-simulation-2025/11538"},
{"title": "Call for Help: Open Source Co-Creation-Platform RoboPORT", "thread_contents": ["Dear ROS-Community,", "as presented last December at ", " in a public funded research project we are developing the (open source) online platform ", ", which is intended to support the development of ", " by Co-Creation and networking:", "Core features of the platform: See a short >> ", " <<", "See also my ", " and ", " of the presentation (sorry for the poor sound quality)", "\n", "However the ", " and the technical maturity level (security and bugs) of the self-developed platform is still low and we are looking for capable developers to take over the further platform development.", " of the Open Source Co-Creation-Platform ", ".", "The following web technologies are used in the platform: a combination of Node.js backend and a React frontend (see figure). Node.js offers a good scalability, which makes it easy to extend the platform later on. In addition, Nest.js, TypeORM, GraphQL and Bootstrap are other frameworks that support development. The development of the source code for backend and frontend is managed in our GitHub repositories.", " if someone would like to join the further (short term and long term) platform development - on the side of the used web technologies as well as the further development of the existing base platform.", "In the following step, ", " repository. As we have some project money left we could also give you a financial reward.", "In the name of the RoboPORT project team ", " for your help and support", "\nMaik", "I think many projects could benefit from RoboPORT platform as you also support important steps like ideation processes, hackathons and makeathons and offer a network of highly motivated experts that help realizing project ideas…", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Provide a digital ProjectSpace for project data (CAD, docu, tutorials …)", "Projects can call for support and offer Microtascs, Workpackges or Jobs", "Developers can refer to the projects they have been involved in and the skills they have"], "url": "https://discourse.ros.org/t/call-for-help-open-source-co-creation-platform-roboport/12497"},
{"title": "Is it correct to set topic names from parameters?", "thread_contents": ["This topic ", " in a project I frequent, and although I thought the answer was relatively simple, asking it at ROS Answers has turned up aspects I hadn’t considered. In the interest of broadening the range of opinions, I thought I would raise it here, too.", "Please discuss over at ROS Answers rather than here, unless Tully is happy with this turning into worse cross-posting than it already is. ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/is-it-correct-to-set-topic-names-from-parameters/12551"},
{"title": "Convert Topic Message to Dictionary in Python Callback", "thread_contents": ["I would like to save a topic message into a file in a Python callback. I can use a csv.DictWriter if I first convert the message into a dictionary. Is there a better way of converting a message into a dictionary rather than iterating over msg._fields_and_field_types? I cannot use vars() since the message does not have a ", " attribute. Is it safe to rely on _fields_and_field_types in future ROS distributions? Thanks!", "Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ", " provides a Q&A site which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/convert-topic-message-to-dictionary-in-python-callback/12617"},
{"title": "ROS.org Refresh", "thread_contents": ["The current incarnation of ", " is getting a bit long in the tooth; in fact the original roll out of the site was some time in 2013. We’re well past due for a website refresh. After some internal discussion at Open Robotics our general consensus is to drop Wordpress in favor of Jekyll and do a full website rebuild for ROS 2. The motivation for using Jekyll is that the posting workflow is much more developer friendly, and it should make it easier for the community to submit events using pull requests.", "Currently, we believe that ", " serves three primary use cases for the community:", "The current ", " website generally suits these users but is woefully out of date. Our proposal is to keep most of the existing information architecture but give it all a solid update and a facelift. In this new version of ", " we would also like to address a few things that were overlooked in previous versions of the website like responsive design, accessibility, and localization. We’re particularly interested in hearing from anyone who might be willing to help translate the core ", " pages into their local language.", "One of the aspects of the current ", " that we would like to keep are the user submitted “cards” for ", ". These robot/component cards are simply small bits of markdown that can be submitted by a user in a pull request, and we believe that this approach would be a great way for the community to interact with ", ". While we generally prefer ROS related information is on discourse, answers, or the wiki, our current belief is that it would be good to help maintain a lightly moderated lists of things like educational resources, robots and components, and companies using ROS.", "Below is a rough outline of what we think the new ", " would look like. Sections marked with “card based” are sections where users would contribute cards to update the content. Sections in bold are new sections.", "Before we begin the transition process in earnest we wanted to talk to the community about the future of ", ". We have the following requests/questions:", "We’re also looking for assistance on this project. In particular we need:", "We’re particularly interested in hearing from anyone who might be willing to help translate the core ", " pages into their local language.", "I think myself and ", " can wrangle up several volunteers to do Japanese.", "Should we have something about local user groups in the “ROS Community” section? It could just be cards that copy the category descriptions from the Discourse categories, or it could be something more substantial, but I think that showing there are locally-active members is good for showing the strength of the community.", "Hi Katherine!", "Under ROS Community, May I suggest the following two additional subheadings, immediately  below Education, as follows:", "ROS Agriculture", "ROS industrial", "My reason for making this suggestion is that currently as the website stands it is not easy to locate these two areas. It takes a lot of patience to locate these two areas.", "I know this may have been included somewhere, but this may send the unintended message to the effect that these have been removed from ROS.", "Kind regards", "Collen Gura", "from C Gura’s iPad", "I could see that being a useful feature. What would this look like exactly? I could see *.ros.org for regionalization/translation, e.g. ", ". What would a regional page have? Contact information? Generally event announcements should be done on discourse.", "Oh, that’s perhaps not clear from my outline. I have that as ", " I would prefer those groups stand up their own web-site like ROS Industrial, but I could see nascent groups having a single reference page to get started (contact info, charter, repositories). Does that sound about right?", "I’d also recommend having a page beyond just “Why ROS” and provide white papers.", "I somewhat cringe at the thought of white papers from my time in Aerospace / Government, but I think in this case, they have value. A common statement I hear is about how ROS is for research, immature, … and providing some example white papers of people using ROS in real, industrial, or commercial settings could be valuable (I’m looking at you, iRobot, Fetch, [an arm manufacturer]). Additionally, a white paper comparing ROS1 -> ROS2 in that regard for dispelling the claims by critics that were resolved largely in ROS2.", "These could be useful first-entry documents. Having something with that content that is citable would have value as well. Webpages are good for getting information, but white papers are more in line with the business-y people when trying to explain things without going into technical details irrelevant to higher-level management.", "I have that as ", "I think that makes sense too. I think highlighting ROS-* groups on another level would become endless.", "My only concern for the Educations / professional / robot & component resources is that it could read as OSRF (or OR in this context?) is endorsing these particular elements over others. Having that content on a Wiki is a different looking and feeling way of adding that information as a Wiki is known to be user contributed and I don’t think anyone reads those lists as official endorsements the way having it on the main ROS webpage would.", "I don’t know that that is good or bad, just being up the subject. It may be better to have that link to a user contributed wiki and have some statement on the webpage that these aren’t necessarily endorsed by any given person, unless there’s something actually endorsed by some given person.", "Over the years, I’ve spun off a couple mini-projects that I think could be integrated into/linked to from the new ", ", namely,", "I’m not sure I grok the difference between the “ROS Community” section and the “TBD ROS-X Groups section”?", "I also think it’s a bit weird to put ROS Architecture and Ecosystem/Collaborators under “Why ROS?”  That type of information is typically found under a “Developers” or “getting started” header. See ", " as a reference.", "Suggestion:", "Whenever I visit a website as a developer I like to see a link to the documentation immediately visible somewhere in the main navigation, not to make it too crowded but I think it warrants getting added in there somewhere. perhaps just after ROS Architecture?", "I agree. I think in my mind “ROS Architecture” ", " the documentation.  Perhaps naming that header “Documentation” is clearer?", "I somewhat cringe at the thought of white papers from my time in Aerospace / Government, but I think in this case, they have value. A common statement I hear is about how ROS is for research, immature, … and providing some example white papers of people using ROS in real, industrial, or commercial settings could be valuable", "I second this. In industry, white papers are essential for convincing business people. The engineers will just read the documentation, but when they need to convince the project managers or other higher ups white papers provide the material and the evidence.", "I think that would help, in my mind when I read “ROS Architecture” I just think of a picture of a diagram or something, but might just be me. ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["The initial entry point for new users looking to get started with ROS.", "A resource for non-technical individuals to find information about ROS and robotics in general (e.g. journalists, investors, educators, etc).", "A rough index of ROS resources for the established community.", "About:\n", "About ROS", "History", "Contact Information", "\n", "Why ROS?\n", "What is it?", "ROS Architecture\n", "Core Libraries", "Packages", "Hardware", "\n", "Ecosystem and Collaborators\n", "Gazebo / Ignition", "Move It", "ROS Industrial", "OpenCV", "\n", "\n", "ROS Community\n", "\n", "Building A Robot (getting started)\n", "Download Now", "Community Support (HELP!)", "Robots & Components (card based)", "\n", "Get Involved\n", "Donate", "Contribute", "ROSCon", "\n", "Does this outline look sound?", "Did we miss anything? What would you like to see on ", "?", "Are there any accessibility needs over and above the ", "?", "Contractors to help with some of the styling and design work. ", "\n", "Contributors who would be willing to help with translation or regionalization. ", "\n", "About:\n", "About ROS", "History", "Contact Information", "\n", "Why ROS?\n", "What is it?", "\n", "Download", "Developers\n", "ROS Architecture\n", "Core Libraries", "Packages", "Hardware", "\n", "Ecosystem and Collaborators\n", "Gazebo / Ignition", "Move It", "ROS Industrial", "OpenCV", "\n", " for additional package/project resources", "\n", "Robots & Components (card based)", "\n", "ROS Community\n", "\n", " for additional interest groups", "\n", "Learn\n", "Community Support (HELP!)", "\n", "Get Involved\n", "Donate", "Contribute", "ROSCon", "\n"], "url": "https://discourse.ros.org/t/ros-org-refresh/12603"},
{"title": "Workshop on Security and Privacy in Robotics - Call for contributions", "thread_contents": ["========================================================================", "========================================================================", "IMPORTANT DATES", "Submission deadline: March 31, 2020", "Notification: April 15, 2020", "Camera-ready deadline: April 25, 2020", "Submission site: ", "SCOPE", "The workshop on “Security and Privacy in Robotics” addresses recent security", "\nand privacy challenges with the robotic systems. The trend of integrating", "\nrobots with information and communication technologies (ICTs) such as cloud", "\nservices and IoTs has imposed cybersecurity risks. Interdisciplinary", "\napproaches that bridge cryptography, communication networks, data sciences,", "\ncontrol systems, and robotic operating systems will be examined and discussed", "\nto address the emerging challenges. This workshop will gather experts in this", "\nemerging area of research and provide a perspective on relevant challenges", "\nand opportunities for the academia and industry. The workshop will focus on", "\nrecent advances in areas such as ROS security, cloud robotic security, and", "\nprivacy issues in robotics. It will give the audience an overview of the", "\nsystematic security solutions to robotic systems in these areas and provide a", "\nplatform to discuss new research directions. Conclusions will be summarized", "\nin a report released to the community.", "TOPICS OF INTEREST INCLUDE (BUT ARE NOT LIMITED TO)", "SUBMISSION GUIDELINES", "The (WiP) session provides an opportunity to present and discuss", "\nnew challenges and visions, showcase early research results, and", "\nexplore novel research directions. The specific aim of the WiP", "\nsession is to provide a forum for timely presentation, discussion", "\nand feedback for novel, controversial, and thought-provoking ideas.", "Demonstration submissions should list any special requirements", "\n(tables, power, wireless connectivity, etc.) n a separate page to", "\nthe submitted abstract (see the instructions below). This page is", "\nnot part of the technical content of the abstract, can be formatted", "\nat the discretion of the authors.", "Authors are requested to submit original, unpublished abstracts of", "\nno more than 500 words or 2 pages of extended abstract. All submissions must be", "\nin PDF format and uploaded through the online system", "This workshop aims to addresses recent security and privacy challenges with the robotic systems. The trend of integrating robots with information and communication technologies (ICTs) such as cloud services and IoTs has imposed...", "The submitted abstract describing the work or demo will be", "\nevaluated based on technical merit, innovation, and the potential", "\nto stimulate lively discussions at the conference.", "For any further questions on the submission or workshop format,", "\nplease don’t hesitate to contact us (email addresses given below).", "WORKSHOP ORGANIZERS", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", "\n", "\n", "\n", "\n", "\n", "Robot security architectures", "Secure deployment of robotic systems", "Accountability", "Safety and Security modeling of robot systems", "Lessons learned from practice", "Demonstrations of practical solutions", "Cloud operated robots", "Cryptography and Applications in robotics", "Cross-disciplinary topics", "Resilient robotic systems", "Security of multi-agent robotic systems", "submission of work-in-progress", "submission of demos", "Quanyan Zhu, New York University, USA, quanyan.zhu@nyu.edu", "Stefan Rass, Universitaet Klagenfurt, Austria, stefan.rass@aau.at", "Bernhard Dieber, Joanneum Research, Austria, Bernhard.Dieber@joanneum.at"], "url": "https://discourse.ros.org/t/workshop-on-security-and-privacy-in-robotics-call-for-contributions/12780"}
{"title": "[TB3] Machine Learning tutorial", "thread_contents": ["Do you want to try the machine learning?", "We provide machine learning tutorial with TurtleBot3.", "First, we wanted to try machine learning, but we provided an installation tutorial for people who were frustrated at the installation stage.", "Second, This tutorial is reinforcement learning using DQN. We provide basic theory of DQN and algorithms that we use to help users understand reinforcement learning so that they can apply their own learning. What is important in learning and what to do to get the learning you want.", "Finally, In this tutorial, TurtleBot3 learns to go to the goal in gazebo maps:", "\nNo obstacle, Static obstacle, Moving obstacle, Combination obstacle", "Each map has different learning time and reward function.", "\nChallenge to create more efficient learning models and create agents with different goals in different maps.", "\nWe are by your side.", "For more information, please refer to the manuals below.", "\n[Source code] : ", "\n[Document] : ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tb3-machine-learning-tutorial/5659"},
{"title": "Lecture notes specifically for \"Programming Robots with ROS\"", "thread_contents": ["For better or for worse I’ve concluded that the best “textbook” for teaching ROS to Python developers is “Programming Robots With Ros” by Quigley, Gerkey and Smart. It is a few years old and uses Indigo. Many of the code and other instructions don’t work exactly as written. But the sequence of explanation and examples is really excellent.", "My question: have any of you developed course notes, powerpoints or similar to go with that particular book that you’d be willing to share? I am starting to write some myself to see how it goes and thought I would reach out.", "If you see this book, you may change your mind", "\n", "Hi everyone, 🙂  I’m happy to announce a new ROS book: “ROS Robot Programming, A Handbook is written by TurtleBot3 Developers”. Now, this book has been published English and Chinese versions. You can download the pdf of this book.  The authors of the...", "\n    ", "\n", "I’ve looked very closely at that book and its quite good. However it uses only C++ while I think for teaching purposes python is much better suited.", "For teaching students they should be well versed in both C++ and Python, and perhaps any other language tricks of the trade. It would be doing them a disservice as with ROS in my experience I actively use both, all the time, sometimes both in the same day to achieve a goal.", "I have been teaching ROS with C++ at least two times at Universities, and it was clear that students struggled more with C++ syntax and build requirements that with ROS concepts.", "\nLast ROS courses I used Python with student with zero background on Python and it was much more easier for them to grasp faster ROS concepts.", "\nSo, I think, unless you have students with good background in C++, it will be painful for them.", "\nIt seems with new C++ 11 supported in ROS2, programming in C++ with ROS will be less tedious.", " I totally agree and have reached the same conclusion. Our students know Java and Python (and many know additional languages. But C++ is a rare bird.) I do agree that to get a “job” in the ROS world you probably are going to need to know C++ but for teaching Python is the way to go.", "(Anyway I have no desire or intention to start a debate on this. Everyone has their own experiences.)", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/lecture-notes-specifically-for-programming-robots-with-ros/5729"},
{"title": "HackadayPrize - Robotics Module Challenge", "thread_contents": [" “is the world’s largest collaborative hardware development community.”", "\nThey organized a ", " as part of their ", " this year.", "\nProbably the ", " will be repeated next year. Could be a good platform to promote robotics hardware projects of students, etc.", "Do you know anybody who submitted something (submission deadline was June 4, 2018)?", "According to their website “On October 22nd, the top 100 projects will be sent to our expert judges who will select the top 5. The 5 winners will be announced at the Hackaday Superconference on or around November 3rd, 2018.”", ": this is a reminder to both of us/anybody, to post the winnung teams of 2018 to get a better understanding if or to which kind of student ROS projects this challenge fits…", "The yearly challenge way organized the first time in 2014. But there are other ", " as well. The robotics category in the yearly challenge seems to be new. However the list of projects show a lot of robotics projects. The main sites of recent yearly challenges:", "There are a lot of potential ROS projects (", ") on ", " but probably no ROS2 projects (", ") yet.", "If I where student I’d love to hack around with ROS2 and HROS ", "Do you know anybody who submitted something (submission deadline was June 4, 2018)?", "No. I don’t know anybody submitting something.", "Hey ", ",", "we submitted to the contest the project we asked for help here:", "Actually, right now we are preparing the last part for the final on 22nd October (", ")", "Why were you asking, by the way? If you have any question regarding it, feel free to ask ", "we submitted to the contest the project we asked for help here:", "Actually, right now we are preparing the last part for the final on 22nd October (", ")", "great! It would be nice if you could post the results here by then.", "Why were you asking, by the way?", "just general interest. always in search for good feed for my ", " account ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["(could not find the 2015 main page)", "(could not find the 2014 main page)"], "url": "https://discourse.ros.org/t/hackadayprize-robotics-module-challenge/5744"},
{"title": "SLAM - Definitions", "thread_contents": ["Simultaneous Localization and Mapping, right?", "As the robot moves through the world, it is collecting scanner information and using various strategies comes up with a gradually improving map of the places it has been (mapping) and where it is located in that map (localization.)", "What about navigation? It knows where it is (localization) and some of the map (mapping) and a destination on the map. Does the usual definition of Slam include the algorithms that will find a safe path from where it is to where it wants to go?", "I ask to clarify a confusion in my mind. What I’ve seen makes it look like when we get to navigation the map_server is publishing a particular map, and I don’t see provisions for that map to change while we are navigation. I am sure I am missing it, but that’s what I am trying to clarify. Thanks.", "Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ", " provides a forum which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/slam-definitions/6030"},
{"title": "[CFP] ACM/IEEE IPSN 2019 in CPSWeek", "thread_contents": ["The 18th ACM/IEEE The International Conference on Information Processing in Sensor Networks (IPSN)", "===================================================================", "\nApril 16-18, 2019, Montreal, Canada", "IPSN’19 is part of CPS-IoT Week 2019, co-located with HSCC, ICCPS, CPS-IoT, and RTAS.", "===================================================================", "The International Conference on Information Processing in Sensor Networks (IPSN) is a leading annual forum on research in networked sensing and control, broadly defined. IPSN brings together researchers from academia, industry, and government to present and discuss recent advances in both theoretical and experimental research. Its scope includes signal and image processing, information and coding theory, databases and information management, distributed algorithms, networks and protocols, wireless communications, collaborative objects and the Internet of Things, machine learning, mobile and social sensing, and embedded systems design. Of special interest are contributions at the confluence of multiple of these areas.", "Like prior years, IPSN 2019 will continue its co-location with CPS-IoT WEEK, the premier venue for research and development of Cyberphysical Systems, and its strong focus on algorithms, theory, and systems for information processing using networks of embedded, human-in-the-loop, or social sensors, as well as new hardware and software platforms, design methods, architectures, modelling, implementation, evaluation, deployment experiences, and tools for networked embedded sensor systems and the Internet of Things. Topics of interest include, but are not limited to:", "In addition to IPSN’s traditional focus, IPSN 2019 will place a particular emphasis on embedded machine learning and computer vision, with a special track centered on these topics. In this case, topics of interest include but are not limited to:", "\nComing soon.", "\nAs in previous years, IPSN will also elicit a review and response process. After the initial review, the program committee may request a short response from selected papers for additional clarifications. The authors will get a short time window of roughly 24 hours to respond. Participation in the response process is not mandatory.", "\nThe two conferences are collaborating to create new synergies, also exploiting their CPSWEEK bi-annual co-location. Prospective authors are thus strongly encouraged to consider these guidelines:", "The TPC chairs of both conferences may agree to move a submitted paper from one to the other if they see a better fit, subject to the authors’ consent. The final decision about where to submit, and therefore what program committee will review the work, ultimately rests with the authors.", "\nPaper Abstract Registration: October 10th, 2018 11:59pm AoE(UTC-12)", "\nPaper Submission Deadline: (Firm*): October, 17th 2018 11:59pm AoE(UTC-12)", "\nAuthors’ rebuttal period December 17th - 19th, 2018", "\nAcceptance Notification: January 16th, 2019", "\nCamera-Ready Deadline: TBD", "\nGeneral Chair:", "\nRasit Eskicioglu (University of Manitoba)", "Technical Committee Chairs:", "\nLuca Mottola (Politecnico di Milan and RISE SICS)", "\nBodhi Priyantha (Microsoft Research)", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Sensor data storage, retrieval, processing", "Streaming sensor system tasking and operation", "Coding, compression, and information theory", "Theoretical foundation and fundamental bounds", "Network and system architectures and protocols", "IoT gateway platform architecture and services", "Outdoor, wide-area sensing systems", "Location, time, and other network services", "Programming models, languages, and systems", "Programming models for IoT ensembles", "Modeling, simulation, and measurement tools", "Operating systems and runtime environments", "Applications in health, wellness & sustainability", "Applications in smart cities and urban health", "Experiences, challenges, comparisons of platforms", "Discovery, coordination, and use of IoT services", "Security and privacy in heterogeneous systems", "IoT reliability, adaptability, and dependability", "Technical assessment of emerging IoT standards", "Wearable systems and data processing algorithms", "Sensor-enabled drone platforms and algorithms", "Machine learning and deep learning on sensor data", "New hardware and system design to enable machine learning on sensor data", "Novel embedded machine learning algorithms", "Data related issues, such as methods, tools, and analysis", "Computer vision for resource-constrained and mobile platforms", "Contributions of embedded nature and applying to network segments from the IoT gateway to field devices should be submitted to IPSN. Examples include localization, low-power wireless networking, and embedded data processing.", "Contributions with an end-to-end perspective or applying to network segments from the IoT gateway to the cloud should be submitted to IoTDI. Examples include cloud data processing, edge computing, and systems covering multiple network segments."], "url": "https://discourse.ros.org/t/cfp-acm-ieee-ipsn-2019-in-cpsweek/6240"},
{"title": "Terminator plugin: MultiKill", "thread_contents": ["Hey there everyone,", "This post is only for  ", " users. If you find yourself pressing Ctrl+C many times on various terminals, and most of the times you just need to kill everything and restart, I may have some good news. Some months ago I created a very simple Terminator plugin, called “MultiKill” that enables you to kill all processes on the current window. You can do it either by left clicking on the terminal and selecting the MultiKill option, or by hitting Alt+C. Today I updated it to work for Ubuntu 18.04 in addition to 14.04 and 16.04. You can check it out here:", "A Terminator plugin that runs the abort command (Ctrl+C) on all open terminals of the active window. - gstavrinos/multikill_terminator", "Thanks,", "George", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/terminator-plugin-multikill/6408"},
{"title": "Learning Robotics using Python, 2nd Edition | Review the book in Amazon | FREE Access to book", "thread_contents": ["Hello Everyone", "I would like to invite ROS developers to review the latest book ", ".", "Please reply your name and mail id in the thread, and you will get FREE access to this book for review.", "I am looking for 10 reviewers.", "Regards", "\nLentin Joseph", "Hello Lentin,", "I would like to review this interesting book.", "Radaideh@nmsu.edu", "Amer Al-Radaideh from New Mexico State University.", "Regards,", "Amer", "Ahmed Radwan", "\n", "Hello,", "I’d be interested as well: ", "Cheers,", "\nZoltan", "Hi,", "I’m interested in reviewing the book.", "Felipe Ximenes", "\n", "Hello,", "\nI am interested in reviewing the book.", "\nTao Wang", "\n", "Hey,", "\nwe are planning to have a new robotics course for students and freshing up our ROS skills with this book would be a good idea.", "\nAndrej Pangercic", "\n", "\nfortiss - Research Institute of the Free State of Bavaria", "Hello,", "\nI’m learning ROS at the moment, so I can review the book as I learn.", "\nCheers,", "\nPranav Narayanan", "\n", "Hi Lentin,", "I would like to review your book.", "Tommaso Bellone", "\n", "Hi Lentin", "\nI would be honored to review your book", "Al French", "\n", "Hello Everyone", "Thanks for your interest to review the book  ", ". I can send these details to my publisher, and they will send you the book for review.", "Regards", "\nLentin Joseph", "I couldn’t get your email id from this link. Please message me.", "Regards", "\nLentin Joseph", "Oh, sorry, it’s ", " ", "Hello,", "\nI am interested in reviewing the book.", "\nJack.", "\nj.ruben@hccnet.nl", "I would love to take a look at it, we’re developing ", " ", " to use ROS from Python (both CPython and IronPython from within CAD tools like Rhinoceros 3D) and we’re very interested in using it as a teaching tool.", "My email is casas at arch.ethz.ch", "Cheers", "Hey,", "if still possible, I would love to review one too. I already answered to this via mail, but today I got a “undelivarable” mail back ", "Hope that there’s still one back. Best regards, and thanks alot!", ": connect to ", "[140.211.9.4]:25: Connection timed out", "\nReporting-MTA: dns; ", "\nX-Postfix-Queue-ID: CD08324DBF", "\nX-Postfix-Sender: rfc822; ", "\nArrival-Date: Fri, 27 Jul 2018 16:59:56 +0200 (CEST)", "Final-Recipient: rfc822; ", "\nOriginal-Recipient: ", "\nAction: failed", "\nStatus: 4.4.1", "\nDiagnostic-Code: X-Postfix; connect to ", "[140.211.9.4]:25: Connection", "\ntimed out", "Von: Thambiah ", "\nBetreff: Aw: [ros-users] [", "] Learning Robotics using Python, 2nd Edition | Review the book in Amazon | FREE Access to book", "\nDatum: 27. Juli 2018 um 16:59:55 MESZ", "\nAn: ", "\nKopie: ", ", Lentin Joseph ", "Hi Lentin", "\nI have downloaded and read the book - excellent work - where do i send my review to? and approx how long would you like it to be…", "\nCheers", "\nAl", "\n", "After reviewing the book, please write a review on the ", ".", "Regards", "\nLentin Joseph", "Hi Lentin", "\n“To submit reviews, customers must make a minimum number of valid debit or credit card purchases. Prime subscriptions and promotional discounts don’t qualify towards the purchase minimum. For more information, see our Customer Review Guidelines.”", "\nAs im in Australia and Amazon sux here i havent paid them enough to allow me to review anything…", "\nI will write my review and post it here for you and you can use it anyway you see fit… BTW - a great book - i am enjoying it immensely", "Hello", "\nI’m interested in reviewing the book", "\ns-ahmed.m.baza@zewailcity.edu.eg", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/learning-robotics-using-python-2nd-edition-review-the-book-in-amazon-free-access-to-book/5474"},
{"title": "ROS2 Navigation WG - Thursday 11/8 8:00 am Pacific (GMT -7:00)", "thread_contents": ["Last week’s meeting was good, so let’s continue with this time.", "Please let me know if you’d like me to send you a calendar invite. Otherwise, anyone can join by using the link below.", "Thursday, November 8 - 8:00 – 9:00am Pacific Standard Time", "Real-time meetings by Google. Using your browser, share your video, desktop, and presentations with teammates and customers.", "‪+1 423-588-1304‬ PIN: ‪426 363 201‬#", "Summer time must have ended in the US. 8AM Pacific is now a much worse time for Asia, unfortunately. ", "I will also be there", " - I could push it forward an hour 9am Pacific if that is better?", "You’re going in the wrong direction. ", "To get a feasible time for those of us on this side of the world, you’d either need to go an hour earlier:", "or several hours later:", "or", "If you need to organise a meeting with people spread all around the globe (like I do every week), then pretty much ", " has to have a shitty time and someone has to have a not-so-great time while someone else gets it during office hours. The only feasible solution is to find someone who’s willing to suffer the shitty time every week, or to rotate the shitty time around.", "Given that I’m the only one on this side of the world, I’ll understand if you prefer to just make it a reasonable time for Europe and America only.", "How about 2pm Pacific time? It will be 7am Tokyo and 5pm Eastern time.", "Would everyone be able to make that time?", "That time works for me.", " ", " ", " ", " ", ", would 2pm Pacific, 5pm Eastern time work for you all?", "That time works for me", "I could only make it for maximum 40 minutes.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros2-navigation-wg-thursday-11-8-8-00-am-pacific-gmt-7-00/6745"},
{"title": "ROS2 Navigation WG - Thursday 11/29 2:00 pm Pacific (GMT -7:00)", "thread_contents": ["All,", "\nWe’re meeting today, 11/29. 2pm Pacific. Sorry for the late notice.", "If you want to be added to the google calendar, message me your email address.", "Thursday, November 29", "2:00 – 3:00pm", "Real-time meetings by Google. Using your browser, share your video, desktop, and presentations with teammates and customers.", "‪+1 423-588-1304‬ PIN: ‪426 363 201‬#", " ", " ", " ", " ", "Review map server implementation changes, splitting yaml files", "\nOverview of Behavior Tree implementation", "\nOverview of Recovery Behaviors", "\nOpens", "I’ll be in attendance. Thanks!", "Attempting to join but timing out request to join", " from another project that I’m running. (Unrelated to ROS so now you all know why I struggle to find time for ROS stuff.)", "It’s Confluence, so it’s heavily using Atlassian’s features for tracked issues and so on, but I don’t see why somehting similar couldn’t be easily done with Github’s wiki facilities. The meeting video itself is just uploaded as an attachment with a link embedded in the page.", " this is google cartographers: ", "Only slides though", "We put up slides as well we when have them. That project had loads of slides every meeting up until about this year, but now it’s mostly into the implementation stages so it’s viewing a model in a tool. The meeting video is even more important now because of this.", "Since you are going to talk about Behavior Trees, I guess I would like to join too ", "My email is ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros2-navigation-wg-thursday-11-29-2-00-pm-pacific-gmt-7-00/7005"},
{"title": "Regarding Migration of Launch File from ROS1 -> ROS2", "thread_contents": ["Hi,", "Currently, I am migrating launch XML to python (ROS1 -> ROS2). I can handle <node> with python generated API but I am not understanding, How can I replace <group>, <test>, <rosparam> and other parameter from xml.launch to python file.", "Please guide me to migrate launch file.", "Thanks.", "Please read our support guidelines, ", " questions should be directed to ", " not to the discussion forum. Please don’t double post things, especially without cross references as that will potentially cause multiple people to take time to answer your same question in the different forums without knowing that someone else has already take the time. I see that you also asked ", " which is the right forum. I’m going to close this and any followups can go there.", "Thanks for guidance. Yes, I have read somewhere (mentioned thing by you) after this post and that’s why i have post there.", "Thanks, You can delete this post.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/regarding-migration-of-launch-file-from-ros1-ros2/7101"},
{"title": "Open: Call for euRobotics Technology Transfer Award 2019", "thread_contents": ["The European Robotics Forum 2019 (ERF2019) will take place in Bucharest, Romania, from 20 to 22 March 2019.", "The European Robotics Forum is a gathering of representatives of all European robotics stakeholders from industry, research, academia and public and private investors. It aims at facilitating networking between these groups through plenaries, sessions and workshops.", "The euRobotics Technology Transfer Award, now in its ", " , is seen as one of the event’s most prominent activities.", "Outstanding examples of technology transfer in robot technology and automation that result from cooperative efforts between research and industry are eligible for the prize. The three most outstanding examples of technology transfer will receive cash awards and signed certificates. The event will be highly visible.", "Applications are invited from individuals or teams from:", "A team may be represented by up to ", " (individuals) in the application.", "Applications may address, but are not limited to the following areas of robot automation:", "The project must be completed by the application date or no more than 24 months prior to the application date. Should submitted applications not come up to the required standards of excellence no prize will be awarded.", "The written application should include a summary not exceeding six pages of the project and its technology transfer, setting out:", "Furthermore, an annex (e.g. project reports, publications, video, dissertation etc.) may be provided to additionally evidence the project’s soundness and impact.", "The complete application should be sent to ", ", by  ", "Submitted applications will be evaluated by a jury consisting of members from industry and academia/research. The finalists will be informed at least three weeks prior to the award ceremony.", "The presentations and the ceremony for the 2019 euRobotics Technology Transfer Award will take place at the 2019 European Robotics Forum in Bucharest, on 21 March 2019. In a “Technology Transfer Session” the finalists will each have 15 minutes plus discussion to present their projects. Based on both the written application and the presentation, the jury will determine the winners.", "Please send your application by email to:", "Martin Haegele,", "Fraunhofer IPA", "Nobelstrasse 12", "70569 Stuttgart, Germany", "+++", "\nSource: ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", " if technology transfer has taken place in Europe.", "\n", " that are located in Europe.", "\n", " : Solutions of robot automation are sought which have contributed to cutting costs, raising quality, enhancing productivity, or saving of valuable resources or have led to a reduction of physical labour at the workplace.", "\n", " : Research results which have contributed to an innovative and competitive robot system (in any robotics application field).", "\n", " : Results leading to new or improved methods or components which contribute to robot safety, flexibility, intelligence, operation, acceptance or servicing of robot systems.", "Project title", "Participants and brief information about their organization", "Motivation and goals of the research and development effort", "State of the art", "Project approach", "Results of research and development", "Achieved innovation and commercial impact", "Handling of intellectual property rights and commercialization", "Cooperation between research and industry with benefit for the partners."], "url": "https://discourse.ros.org/t/open-call-for-eurobotics-technology-transfer-award-2019/7182"},
{"title": "Robotics in 2018", "thread_contents": ["Hi!", "Mat from Weekly Robotics at it again! I’ve recently made a post with what I think are the biggest news in Robotics in 2018: ", ".", "Hope you like it!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/robotics-in-2018/7287"},
{"title": "I tried moving robot using ROS", "thread_contents": ["Demo video.", "\n          ", "\n", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/i-tried-moving-robot-using-ros/7342"},
{"title": "Rosdep sources list", "thread_contents": ["I was wanting to get some feedback on how other people are using rosdep in a production environment.   Do most people use a rosdep database that is a fork of the main database or just use the main database for their projects?", "There have been a couple times that the rosdep database has updated changing the dependency structure of my project.  So far this has only been helpful, with the changes making improvements or picking up bugfixes that I wasn’t aware of, but this could just as easily create problems with my project switching from pip to apt for it’s dependencies.  In an effort to avoid this I plan to use a fork of the main database.  Is this practice common or not really recommended?", "Although this could be an interesting discussion, I think you might get more responses to this question if you ask it over at ", ". (Link your question here so we can see what happens.)", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/rosdep-sources-list/7583"},
{"title": "Participate in the Entrepreneurship Workshop and Award 2019 at ERF", "thread_contents": ["All entrepreneurs and potential entrepreneurs in the robotics field are invited to join the competition for the Award.", "The euRobotics Entrepreneurship Award is given out each year at the ", " to the most promising robotic start up as judged by a jury of robotic entrepreneurship pioneers and experts.", "Entrants to the competition stand the chance to gain valuable skills in how to pitch an investment idea together with the potential to gain interest in their company from the robotics and investment community. The 2019 edition of the Entrepreneurship Award will take place on 20-21 March, at the ", ".", "\n10 selected participants will have their flight and accommodation (up to € 500) and ERF attendance fees paid for one person and will furthermore receive feedback on their pitch and project from the screening committee and an offer of a further 3 * 1 hour of counselling from European level robotic entrepreneurship experts.", "Three participants will be selected as Finalists and pitch in the open Entrepreneurship Award workshop along with robotics entrepreneurship role models, and will receive a Finalist diploma, an ERF banquet fee paid for one person and recognition on stage during the ERF banquet.", "The Entrepreneurship winner will additionally receive extensive coverage on ERF social media and recognition in ERF public promotion materials and in an press release and an ERF Entrepreneurship Award winner diploma and announcement on stage at the ERF banquet.", "Interested participants must submit an application with the following format by 12:00 CET on 25 February 2019 to the following email address: ", "Learn and read more at euRobotics website. ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/participate-in-the-entrepreneurship-workshop-and-award-2019-at-erf/7601"},
{"title": "Any ROS robots in the NASA Sample Return Robot Challenge?", "thread_contents": ["The finals started yesterday and I believe ends today, there isn’t a lot of information about the competitors except for a listing:", "NASA.gov brings you the latest images, videos and news from America's space agency. Get the latest updates on NASA missions, watch NASA TV live, and learn about our quest to reveal the unknown and benefit all humankind.", "I just heard an interview on the livestream with a team Survey member who said their robot was using ROS.", "Yes, Survey uses ROS. I think the Univ of West Virginia is using ROS. Many of the competitors used it over the years. I competed in 2013 but wasn’t using ROS. Main language used is C++.", "MAXed Out - Santa Clara, California uses ROS.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Team Al - Toronto, Canada", "Alabama Astrobotics - Tuscaloosa, Alabama", "MAXed Out - Santa Clara, California", "Mind & Iron - Seattle, Washington", "Sirius - South Hadley, Massachusetts", "Survey - Los Angeles", "West Virginia University Mountaineers - Morgantown, West Virginia"], "url": "https://discourse.ros.org/t/any-ros-robots-in-the-nasa-sample-return-robot-challenge/484"},
{"title": "Last Call for ROS course of January", "thread_contents": ["Dear Roboticists,", "Still 2 spots available for the ROS in a single week course of January. This course is ideal to start learning ROS from zero.", "\nEntirely practical ROS training which integrates theory and practice, learn by programming different simulated robots and full integrated development environment.", "*Live Class", "\nA single week of basic ROS learning in Barcelona. Available for people without previous knowledge of ROS.", "\nExclusive for ONLY 5 individuals (still 2 spots available)", "\nExam and ROS Certification: There will be a test at the end of the course. Those who pass the test will receive a ROS certification.", "\nDuration: January, 16th to 20th", "\nLocation: Gran Via de les Corts Catalanes, 608, 3ºD, 08007 Barcelona, SPAIN", "\nMorning: teaching with exercises from 9:30 to 13:30", "\nAfternoon: working on ROS project from 14:30 to 16:30", "*Virtual Class:", "\nIf you cannot attend to Barcelona you have the option to attend the class online. Through a web transmission on real time, with full access to the teacher and other attendants to the class.", "\nAvailable Places: 25", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Monday: ROS BASICS: basic structure of ROS programs and its concepts", "Tuesday: ROS TOPICS: how to create topics and how to access them", "Wednesday: ROS SERVICES: how to create services and how to use them", "Thursday: ROS ACTIONS: how to create action servers and use them", "Friday: ROS DEBUG: ROS tools that allow to find errors and debug", "Saturday: Course Exam from 9:30 to 11:30", "Basic knowledge of Linux shell", "Basic knowledge of Python programming", "A laptop (can have any operating system)", "NO prior knowledge of ROS required", "You can enroll the course here: ", "\n", "You can contact us with questions and doubts here: ", "\n"], "url": "https://discourse.ros.org/t/last-call-for-ros-course-of-january/1083"},
{"title": "Python with ROS", "thread_contents": ["Hi everyone,", "Apparently there is still no “python” category or tag yet in discourse… despite all the drawbacks in ROS python workflow coming from a standard python development workflow.", "\nSo I was wondering if I am really alone doing dynamic “modern” python2 in ROS1 ?", "I have been working for a bit more than a year now to get decent, dynamic, modern, python integration with ROS, and I wanted to get the word out and get a bit of feedback from potential users.", "So if you are interested by integrating dynamic languages with ROS1 you can have a look at some of the most useful packages :", "All these use rospy underneath, so all usual features are still available, and your usual ROS still works in the same way.", "However recent python standard workflow and conventions apply so we get all the benefits from recent python2 and tools improvements.", "Anyone interested ? Any potentially useful feature missing from there ? Just let me know.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", " -> Integrate pip with catkin. Main benefits : work with python packages not made for ROS, ", ", no fork needed.", "\n", " -> Dynamic configuration-based ROS environment setup. Main benefit : no custom setup step for ROS. You can use your ", ".", "\n", " -> Dynamic ROS interface. Main benefit : any ", " underneath. ", " is an example of that.", "And I am currently working to be able to use ", " working with ROS in ", " in order to be able to cooperate easily with other messaging systems (json and REST is a first usecase)."], "url": "https://discourse.ros.org/t/python-with-ros/1092"},
{"title": "Suggestions for std_srvs", "thread_contents": ["Hi,", "I think std_srvs should be extended to include services required for common data types like below.", "bool result", "bool success", "\nstring message", "string result", "bool success", "\nstring message", "int32 result", "bool success", "\nstring message", "float32 result", "Probably it’s good to have getter and setter service for all primitive data types in std_msgs but I think above would cover the most of the common requirements", "Also Trigger service can be considered as a GetBool service but I think it’s more clearer to have separate service for the perpose of looking up an value.", "I agree something like that would be very useful. I’ve used a package with a bunch of similar definitions myself.", "I am curious about the distinction between get and set. You added ", " to the setters but not the getters. Why do you think one should have them but not the other? Personally I’d lean to not having them at all. You can already report failure anyway in your service handler.", "I have implemented ", " a couple times myself.", "Hi,", "I did not included string message thinking the same way as you that they are probably not that required. But if it is required for consistency, I’m open to have string message (and probably bool success as well) for conveying error message/failure of result in the return message.", "I did not included string message thinking the same way as you that they are probably not that required. But if it is required for consistency, I’m open to have string message (and probably bool success as well) for conveying error message/failure of result in the return message.", "But you did include them on the setters, right? I think they’re not needed for those either, since all services can return an error (including a message) already by throwing an exception in the service handler (in C++ you can also return ", ", but then you can’t set a message).", " is the lord of this particular kingdom. Would he be likely to accept a pull request for updates similar to these?", "This suggestion pops up once in a while, so there are many users stumbling about this. These services used to be included in ", " once upon a time but were intentionally removed in 2012:", "Ken Conley wrote back then:", "one of the reasons we purged so many services is that its", "\nhard to have semantically meaningful common services. Services are", "\nmore equivalent to method declarations, so a ‘GetBool’ service is", "\nsimilar to naming a method or interface, ‘GetBool’. There are cases", "\nwhere such a method is reasonable, but it doesn’t provide any higher", "\nlevel semantic other than the type signature.", " already summarized the rational why those generic services don’t exist anymore. I agree with that and don’t think these services should be added. Creating custom services with semantic meaning should be preferred.", "I can see that point, but then why do we have generic messages in ", "? I find those far less useful than a generic ", " or a ", ".", "The majority of messages in std_msgs are mostly there for legacy reasons. We would have purged them when we purged std_srvs, however we judged that although the’re not recommended, they are used in a lot of places and the disruption of removing them will cost more than maintaining the package in it’s current state.", "We could make the package description more proactive, but the wiki page is pretty clear:", "Package description.", "Standard ROS Messages including common message types representing primitive data types and other basic message constructs, such as multiarrays. For common, generic robot-specific message types, please see ", ".", "std_msgs contains wrappers for ROS primitive types, which are documented in the msg specification. It also contains the Empty type, which is useful for sending an empty signal. However, these types do not convey semantic meaning about their contents: every message simply has a field called “data”. Therefore, while the messages in this package can be useful for quick prototyping, they are not intended for “long-term” usage. For ease of documentation and collaboration, we recommend that existing messages be used, or new messages created, that provide meaningful field name(s).", "Note that this package also contains the “MultiArray” types, which can be useful for storing sensor data. However, the same caveat applies: it’s usually “better” (in the sense of making the code easier to understand, etc.) when developers use or create non-generic message types.", ", ", ", ", "Thanks for your valuable insights on rationale behind stripping down std_srvs. I also was in understanding that defining common services may not serve much purpose other than probably preventing couple of very similar looking imports from couple of packages sometimes.", "bool value", "etc.", "bool value", "etc.", "As with std_msgs we have learned from experience that it’s better to have semantic meaning. I would strongly recommend against using ", " for the same reasons that we discourage it in ", ".", "The example of ", " has semantic meaning such that if you do a rosservice list you know that this service represents ", ".", "As an example, if you have another service which is ", " which simply returns an ", ".", "The status might be {0: OK, 1: ERROR, 2: UNINITIALIZED} whereas the Awesome Variable represents a real value such as what floor of the building you’re on.", "They both carry the same data structure, and have the same fields. But the data carries different meanings.", "\nIf you were to remap the Status service topic to the AwesomeVariable topic suddenly your robot would be happy on the ground floor, but as soon as you moved to the 1st floor it would start erroring and say you went down to the basement, suddenly your status would be negative which is undefined behavior. Since the data is not semantically interchangeable it should be represented as a different type.", "But is it really the job of the ROS topic type to carry meaning? Why not use the advertised name for that?", "Don’t get me wrong, I think it is often very helpful that topics and services carry semantics as you described it. It makes something easier to understand and less error prone if used correctly. But on the other hand, it requires to create a bunch of services or topics for things which are in many cases the same or very similar. I sometimes find myself “missusing” topics just to not have to introduce my own topics just for convenience.", "This is especially important when thinking about one of the main strong points of ROS (in my opinion): The strong emphasis on interconnecting different parts of an application together without having to couple them specifically. When I use newly defined topics and services for that, I loose some of the flexibility I otherwise have when using just the generic types of std_msgs. Instead of having two packages perfectly on their own ( ", "), I will need to either have one as the dependency of the other or create a third, just to define the communication type.", "Additionally there is the option of using the advertised name for semantics. Simple example would be the camera image of a stereo camera simply named camera_left and camera_right instead of using a different message type for each.", "I wonder here if the confusion is because it sounds like it is less about semantic meaning and more about a kind of type safety. Tully’s story is like this - making absolutely sure you can’t execute if you call the wrong thing. Georg’s statement is also true - the advertised name is just as much a helper in guiding you in correct wiring but it doesn’t give you type safety and is probably more closely aligned to what people think of as semantics than the type name itself.", "For some cases, like the image example, the line between relying on type name vs topic/service name is neither black or white. It is definitely half of one and half of the other.", "Yes indeed it’s always a judgement call on a case by case basis.", "But I’d like to highlight that there are two dimensions of semantic meaning encapsulated in the type and topic names. There is the semantic meaning of the type and the semantics of what is represented in the instance of the topic.", "What I’ve been discussion above has been about the semantic meaning of the type. Such that anything with the same semantic meaning should be interchangeable.  This is Image vs PointCloud (both of which have used std_msgs MultiArray datatypes in the past in ROS), or simpler ", " vs ", "These messages have very similar data structure, but have very different meanings. It is an error to feed an illuminance signal into something that is processing the humidity.", "The second level mentioned is the semantic meaning of the instance which we recommend be captured by the topic name. ", " vs ", "  These are both images with the same type and can both be run through any image processing pipeline. And you can still get bad behavior by feeding left camera data to both sides of a stereo module. But the system knows that it’s invalid to feed a PointCloud into the input of a stereo image.", "This is especially important when thinking about one of the main strong points of ROS (in my opinion): The strong emphasis on interconnecting different parts of an application together without having to couple them specifically. When I use newly defined topics and services for that, I loose some of the flexibility I otherwise have when using just the generic types of std_msgs. Instead of having two packages perfectly on their own ( of course they are not on their own as they referr to std_msgs or std_srvs but as they will be present on every ros system it is basically the same as having no specific dependency), I will need to either have one as the dependency of the other or create a third, just to define the communication type.", "I agree that interconnectability is one of the values that ROS provides. But this value is actually provided by not taking the shortcuts you mentioned and “missusing” messages. By having the carefully defined datatypes that are fully self contained and have semantic meaning, a modules interface can be defined basically by the types and you know that if you have a matching typed publisher you can hook it up and it will process the data.", "I’ve seen many systems where if you use loosely defined datatypes, or missuse defined datatypes, you get modules that theoretically have the same information but they’ve diverged in their representation and can no longer function correctly due to the diverged use of the message. Which then breaks the whole introspection system as well as the interface definitions.", "I agree, that missusing messages and services is a tempting thing when prototyping software and it often doesn’t get replaced later on.", "However, I like to see those very simple services kind of the same as c++ functions. If you take the setBool service for example. You would create a service called e.g. ", " of type ", "In c++ you would create a function called ", " which takes a bool as an argument.", "Now you could create a custom service type, let’s name it ", " which has a boolean field called ", ". This is how I understand the counter-general-services position above.", "Taken back to c++ terms I understand this as a typdef from bool to ", " which doesn’t feel quite right to me.", "As soon as I would pack something into a struct or class or enum in c++ I agree, that it does make sense to also define it’s own message type. This also fits together with Tully’s example that you could in theory use an image for a pointcloud, but you wouldn’t.", "Another point is that everybody knows how to use these standard types. If we go back to my example and let’s say, we created a service called ", ", it’s not clear from the type which states are actually allowed. It could also contain an enum field with 20 different states. If it’s just of type ", ", then everybody knows the two possible values just by looking at the type.", "I am very well aware that the SetBool service does exist in std_srvs and I’v been cloning the repo to my workspaces a couple of times before it was released as package, however I think that the same argumentation goes for something like setFloat, setInt and so on. To quote a colleague: A float is a float, is a float. If you decide to call a service called ", " with a measurement received from a humidity sensor or from a random number generator, that’s ok. I think it is quite obvious, that this probably won’t produce the desired behavior, however.", "TLDR: I would prefer to have predefined  set and trigger services with basic datatypes, however I see the risk of tempting people to kind of missuse datastructures out of pure lazyness and that this should be prevented as good as reasonable (reasonable as in the bool typedef example).", "There are some predefined services already:", "From the list proposed, I could see enough grey area to allow ", ", but the others I don’t think are good ideas. With bool, as ", " pointed out, you know what the valid inputs are (true and false). If only one of those, or neither, were valid, then you would use ", " or ", " instead.", "With the get/set of the other types, I think the possible values are not clear and would benefit from a more specific type. String is on the fence for me, but int and float I feel pretty strongly should have constants or units attached to them by using a custom Service type with comments. For example, using ", " for a service called ", " is the kind of abuse of these types we want to avoid. In the case of string, I could see cases where using just a set/get string service type would be ok, but most all of them would benefit from, if not require, further clarification in a custom service type.", " you make compelling arguments ", "In general I am convinced by the logic of having it semantically sound and using exchange formats in a well defined manner, but on the other hand I also agree with ", ". When we treat services as function calls (or somewhat remote procedure calls), why do we treat types different than in such a function call?", "In Particular, ", ", what exactly would be the abuse of using a SetFloat32 fot /set_desired_temp? That no unit is given? Or that you could give values that are excedingly large or something like that? I think I would use a simple float as parameter for this if implemented as method. Thats why there are return values ", "Aggain, for any more complex data type, where I would use a struct or class, I agree, custom services are the thing to use. But for simple data types? Where is the harm in someone inputting something semantically differnt in the service call if it is syntactically correct?  Thats why I asked about if it really should be the task of the type definition to handle this. Because if i wanted to, I could also write some weird stuff into custom defined types. For example an image could very well be wrongly encoded or contain weird depth data. When something is offering to accept floats, the input type is also quite well defined as beeing a float.", "By the way, thanks everone for this discussion, we had simmilar discussions offline, so getting the insigths and design views of everybody is quite helpfull.", "That no unit is given?", "Exactly that. Is the desired temperature in Celsius or Fahrenheit or Kelvin? You could put this information into a topic name, but then how would a general purpose tool (say a node that visualized the temperature on a thermometer) know which units you are using? Extracting it from the topic name is hard and likely error prone. If it is agreed on in the message definition (either by comment saying it is always Celsius or by having another field that lets the publisher say which units it is in) then it is always clear to both the developer and any program.", "Is the desired temperature in Celsius or Fahrenheit or Kelvin?", "I do all ", " temperatures in Rankine!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", ": ", "\n", "\n", ": ", "\n", "\n", ": ", "\n"], "url": "https://discourse.ros.org/t/suggestions-for-std-srvs/1079"},
{"title": "2nd Annual Robot Art Competition", "thread_contents": ["Thought everyone might be interested in the 2nd Annual Robot Art Competition (", "), which features $100,000 in cash prizes. We’re a nonprofit, and the contest is free to enter and open to any age. The goal is to challenge participants to produce something visually beautiful with robotics—that is, to have a robot use physical brushes and paint to create an artwork. It’s ideal for robotic student projects involved in robotic planning and image processing, especially those who have an appreciation for art. Details, team signup, and last year’s winners are at ", ".", "Participants can use any robotic system to produce the artwork. While most teams are using existing robotic arms, the contest is open to custom hardware. Students can enter up to six paintings in each of the competition categories of “fully automated execution” and “manually (semi or tele-robotic) generated” art, where generally, there is little or no specialized software used to control the robot.", "The deadline for artwork submission is April 15th. If you have questions or ideas on who I should contact to help spread the word, please let me know.", "Thanks for your time.", "Chase", "\n", "\n", "\nRobotArt Team", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/2nd-annual-robot-art-competition/1400"},
{"title": "2017 agBOT Challenge volunteer program", "thread_contents": ["The ", " consists of two competitions:  Seeding, and Weed & Feed.  My team, Lairdscape, is competing in the Seeding competition.", "Tickets sell out quickly but there is volunteer work available.  I’ve uploaded the ", ".  For more information and to apply, use the ", ".", "This is a great way to not only see some interesting robots but also meet developers and industry leaders.  It is hosted at a farm - definitely not your typical “Con.”", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/2017-agbot-challenge-volunteer-program/1579"},
{"title": "Catkin python package code coverage report", "thread_contents": ["If I have a python package with a bunch of unit tests, I can generate a coverage report with nosetest. However, what I ultimately want is when I run ", " for it to run the python tests and generate the code coverage report. I have come up with ways to do this with c++, but haven’t found any way to do it in python and catkin.", "Following our ", " please ask questions on ", "We work to preserve this forum for news, announcements and general discussions.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/catkin-python-package-code-coverage-report/1616"},
{"title": "Rosserial_arduino performance question", "thread_contents": ["Hi,  I’ve been using myrobotlab but am looking to migrate to ROS.  SO I’m just getting started.", "Currently using Arduino to interface to 5 servos in a humanoid head including eye cameras as a starting point for some CV experimentation with object tracking and recongition.", "I’ve installed the latest version of 32 bit ROS on a Ubuntu 16.04.2 Mate system running in 32bit VirtualBox under Linux Mint.  of course I expect that things will be a bit slower running on the VM.  But Ubuntu is pretty responsive.", "I’ve built the Blink example and have successfully controlled the LED using ROS, but there is a several second delay from when I start the command to when the LED changes state.", "Same thing for the single servo example.  It takes about 4 seconds from then I start rostopic to when the servo actually moves.", "Is this just due to running in the VM environment, or is there something else that I should be looking at to improve the performance.  Obviously a 5 second latency from command to movement is going to be a problem:)", "If it is just due to the VM environment I have another machine I can sacrifice to doing a bare metal install of Ubuntu 16.04 on.", "Other than this perhaps being due to the VM installation is there anything I should be looking at that can reduce the latency? Edit: 04/09/17 - Or is it that there is a significant load time for rostopic and that is most of what I see?  In other words for the examples using rostopic to send message requests I’m assuming that during normal operation my application would be interacting with the user and would be sending the message requests off to the arduino about as fast as My Robot Lab does.  I’ll dig a bit deeper in the tutorials and perhaps there will be a framework example for a interactive application to control servos, etc. that I can pattern after for a quick start.", "Thanks,", "\nBurt", "Hi It’s definitely the VM, as ROS is a heavy software I expect it to run much slower in VM’s. Though I have used Arduino Mega with ROS indigo on a VM (Ubuntu 14 running on Ubuntu 16) and the time delay was still maximum around a second. I suggest look into the rosrate, the rate at which the communication takes place given in hertz. Maybe You can use Rviz simulation tool to simulate and check the response of your components, but you will have to create a urdf model of your setup and write some code to make it move on Rviz.", "Thanks, I don’t know if you saw my edit.  I got to thinking that at least part of the latency could be due to having to load rostopic each time to send the message from the examples, so part of the delay may be the time it takes for rostopic to load and initialize before it gets around to sending the message.", "So I was thinking that I could write a test program that would be able to send several messages in a row without having to reload and init for each command, or maybe there is a way with rostopic to accomplish the same thing for testing.  So more digging into examples and tutorials.", "I’m also working on setting up an older box to try running ROS without the VM.  Unfortunately the one I have available has some issues running 16.04 Ubuntu, and even 15.10.  I was able to get 15.04 to install and run well, but I prefer to use the latest ROS, so I’m seeing if 15.10 even with a couple of hiccups will work well enough.  If not then I’ll have to get a newer machine to use for ROS testing, or figure out the hiccups with trying to get ROS installed under Linux Mint.", "Thanks again,", "\nBurt", "OK, I have ROS kinetic running now on an older 32 bit box running Ubuntu 15.10.", "That improved things significantly.  Now each launch of rostopic has a latency of a bit under 2 seconds from the time I press enter to when one of the servos connected to the Arduino moves.  That is much better than the 4+ seconds I was seeing in the 32bit VM installation.", "Now on to some more advanced tutorials and getting things set up to drive all 5 of the servos associated with the head I’m working with, then on to looking at OpenCV integration, etc.", "You’re right about the initialization time. On startup, ", " registers a new publisher with the ROS master. Then, ", " is notified of this and negotiates a direct communication channel with ", ". All of this takes some time. So what you should do is create a publisher once and keep it open. This should greatly reduce your latency on all following ", " calls.", "Thanks Martin,  That’s what I’m working towards and I do expect that performance will be significantly improve the performance.", "Just started dipping my toe in the ROS water so I have a bit to go before I’m fully up to speed:)", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/rosserial-arduino-performance-question/1631"},
{"title": "Problem in installation of ros kinetic", "thread_contents": ["I followed the steps mentioned in the ros installation document. when i run sudo apt-get update ,I get following error", "\nW: The repository ‘", " $ Release’ does not have a Release file.", "\nN: Data from such a repository can’t be authenticated and is therefore potentially dangerous to use.", "\nN: See apt-secure(8) manpage for repository creation and user configuration details.", "\nE: Failed to fetch ", "(lsb_release/binary-i386/Packages  404  Not Found [IP: 2600:3404:200:237::2 80]", "\nE: Some index files failed to download. They have been ignored, or old ones used instead.", "\nplease help with solution.", "Thanks for your question. However, please ask your question on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ", " provides a forum which can be filtered by tags to make sure the relevant people are included and not overload everyone.", "Also please ready through the ", ". In particular please provide enough background to reproduce your problem, including your platform, steps taken prior to the error, as well as links to any instructions you’re following.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/problem-in-installation-of-ros-kinetic/1664"},
{"title": "Link to code.ros.org unreachable", "thread_contents": ["Hello,", "\nI am trying to access a structure in motion demo from linked from the article below.", "\nThe link ", " times out. Would someone let me know how to access the demo", "\nthanks", "\ntim", " is no longer online as far as I know, since most repositories are now hosted on github. Note that opencv isn’t even a ROS project. You can find the linked files in the upstream opencv repository here: ", " Thanks for the link to the new location.", "For reference here’s an announcement of ", " going offline from 2013: ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/link-to-code-ros-org-unreachable/1704"},
{"title": "ROS for Ubuntu 16.04", "thread_contents": ["1.How to install ROS Indigo in Ubuntu 16.04?? I know it’s officially not supported.", "\n2.Does ROS Kinetic has moveit prebuilt? If not, how to install it?", "The best way would be to use Docker. Alternatively, you may be able to compile Indigo from source on 16.04, but I suspect you’ll need to make changes. Why not just use Kinetic?", " Please ask questions on ", " as per our Support policy: ", "I have moved your post off of the categorization of General category so as not to send notifications to everyone subscribed to our announcement’s category.", " I am trying to install ROS kinetic but every time it got stuck after 90-94% installation…", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-for-ubuntu-16-04/1735"},
{"title": "Experiences with Distributed ROS", "thread_contents": ["I am curious to know of any experience people have had running distributed ROS in all shapes and sizes. Have you worked with any of the following solutions (or anything else?), and how did it go? What thoughts or advice can you share?", "As for my personal interest, I have been doing some work with distributed ROS and UAV, and while it is all going well on the ground side, I’m having some severe spikes in latency going through a cheaper wireless router. I’m specifically interested if anyone has any ideas about reliable low-latency wireless links that are easy to interface with ROS.", "The most interesting setup I used was:", "This resulted in a ca. 100ms ping time. With this, I could teleop the robot’s base and arms using the on-board Kinect, so OK data rate as well.", "Lessons learned:", "So I have worked with some rather large distributed systems and best practices are rather hard to say without understanding your topology.", "I have had the best success with routed architecture. Each node master then uses a static packet structure to communicate to the higher level controller (mainly due to the radio link).", "Your spikes are more than likely caused by the inefficiencies of your packet size vs your radio’s frame size. For a test run iperf across your radio link at different packets size. You should be able to see what that most efficient packet sizes are.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Static ethernet network with some kind of switch", "Dynamic ethernet network with some kind of router", "WiFi and ethernet through a router", "WiFi-Only network with a common base station / access point", "WiFi Ad-Hoc network", "Some kind of mixture of anything else?", "a mobile robot with 2 PCs. One of these ran a OpenVPN server", "wired to a router", "that router bridged to a WLAN with multiple access points", "the care home’s (in which the robot worked) network was configured to port-forward to the OpenVPN server", "A control station some 60-70km away VPNed into the robot.", "Tuning a multi-access point WLAN, where the robot roams between APs, is some work. Contrary to my intuition at the time, is that you do ", " want to have each AP at a high power but instead low. That way, the robot switches to the now-closest AP faster, yielding a better connection. WiFi is designed to stay ‘attached’ to the current AP as long as it gets a signal, even though it may be weak. Dropping a low signal early is better in that case.", "Running the VPN server on the robot is not the way to go… The server should be on a public IP, the robot behind a firewall."], "url": "https://discourse.ros.org/t/experiences-with-distributed-ros/1768"},
{"title": "OpenAI Gym for Robotics 101 Online Course", "thread_contents": ["Dear Roboticists,", "The OpenAI Gym for Robotics101 online course now is available in Robot Ignite Academy.", "Learn what is needed to be able use Open AI-Gym in your next project. You will work on a turtlebot simulation and a part drone.", "At the end of the course, the following topics will have been addressed:", "Courses links: ", "\nCourses Video tutorials:", "\nArticle: ", "You can contact us with questions and doubts ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Basics of openai-gym API", "Definition of environment files for openai-gym, centered in gazebo-ROS simulations.", "Importing of environments and communication with Gazebo Simulations through ROS.", "Registering of learning results and data plot", "Create your own environment through a hands on example with a drone in Gazebo."], "url": "https://discourse.ros.org/t/openai-gym-for-robotics-101-online-course/1799"},
{"title": "New depth sensor, ASUS Xtion 2", "thread_contents": ["Looking for feedback on depth quality from new Xtion 2 sensor, still same level of quality as Xtion Pro?", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/new-depth-sensor-asus-xtion-2/1817"},
{"title": "Could py file be debugged with any IDEs or tools?", "thread_contents": ["Hi Aspirant,", "\nI think the following course from Udacity can teach you how to debug Python files:", "\n", "Course Summary", "In this class you will learn how to debug programs systematically, how to automate the debugging process and build several automated debugging tools in Python.", " Please ask questions on ", " we work to keep this forum for announcements and discussions. It’s outlined in our ", " please keep this in mind and note that to people instead of answering here. Your answer here gets broadcast to the entire community. Instead please reply with the link to ", " and the Support guidelines.", "I’ve removed this thread from the General category and will close this thread.", " if you need more information please ask on ", "  And when you do please provide more context to be able to reproduce your problem as per the ", ".", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/could-py-file-be-debugged-with-any-ides-or-tools/1827"},
{"title": "Indigo download size?", "thread_contents": ["Due to a super effective IT department, I have to tether to my phone and use my personal data plan to download and install ROS on ubuntu 14.04.  I can’t figure out how much data it’s going to take because I’m not downloading a file, I’m just running an apt-get command.  Anyone have any idea how much data I’ll burn through?  It’s taking a long time on 4G", "First of all: sorry to hear that, thanks for your perseverance.", "The amount of data will depend on how much of the ros ecosystem you need. If you don’t need all the simulators and computer_vision packages you can install ", ". On a fresh trusty install it’ll download ~250MB of data.", "For reference the ", " package will download ~375MB.", "Hope this helps", "Just type the apt-get install command in the shell. It will tell you how much it wants to download and will wait for a confirmation before doing so.", "Hi.  Thanks for the feedback!  I can live with that.  But the install failed because the Wandboard/Ubuntu partition is too small.  I’ve been through this before but I forget the magic sauce. - need to extend the size of an existing Linux partition somehow.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/indigo-download-size/1838"},
{"title": "2dnav_erratic page is empty", "thread_contents": ["2dnav_erratic page is empty:  ", " states “Note: This tutorial assumes familiarity with ROS and how to use it. Please see ROS Documentation. Also, the 2dnav_erratic package provides a simple example of a package created by following this tutorial for the Videre Erratic platform.” , but ", " has no content.  And there is no 2dnav_erratic in github: ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/2dnav-erratic-page-is-empty/1845"},
{"title": "ROS - C++ Development IDE Choice", "thread_contents": ["What is the best development IDE choice for ROS C++ development? I see here Eclipse IDE being recommended - ", ". However, some of the developers in our organization want to use QTCreator for ROS C++ development.", "How they both compared for primarily ROS centric development works?", "Please share your experience and thoughts.", "\nThanks.", "I’ve used both Eclipse CDT and QtCreator for ROS C++ development. Both work without problems. I personally prefer QtCreator now because it feels a bit snappier.", "Note that the ", " you’ve linked to also has instructions on how to use QtCreator with ROS. It also doesn’t specifically recommend Eclipse over QtCreator.", "At our lab most people tend to use the two mentioned by Martin (QtCreator and Eclipse CDT), but recently I’ve tried and also heard good things about CLion:  ", "The thing that I like about CLion is the clean and clever integration with CMake, and that it ‘just works’ with ROS packages without having to do special configuration (as long as you are running it from a console that has the ROS environmental variables).", "I’ve been using Eclipse for C++ and not through CMake. Going to look at CLion mentioned by Alexis in another message since it integrates with CMake. I don’t like having to add files to the CMake system that Eclipse already knows about. The trade off hassle is finding the libraries needed for linking. But so far it’s worked well for me. I’ve avoided having to go back and retrofit my builds into CMake.", "One semi snide comment is that the best IDE is the one you know.", "The thing that I like about CLion is the clean and clever integration with CMake, and that it ‘just works’ with ROS packages without having to do special configuration (as long as you are running it from a console that has the ROS environmental variables).", "Yes, exactly the same is true for QtCreator. Since all Catkin packages are just plain CMake projects (catkin is just a set of CMake macros), it all just works without any extra steps required when the ROS environment variables are set.", "+1 for Clion. For me much better than eclipse/qtcreator in terms of debugging and responsivness. Downside: license fee.", "QtCreator is a good choice. But I don’t think that is the best one.", "\nI kind of like Clion…but it takes ages to open. I tend to close the IDE by mistake once in a while and is fully annoying to wait until it opens again. Also I have the feeling that drains your computer resources…Sometimes is only open it and start hearing the fun of the computer spinning. And of course, you have to pay for it.", "\nRoboWare had a nice idea behind, but I cannot edit .launch or .xml as freely as it should. Feels like that it requires time to grow up.", "\nRight now I am playing with Visual Studio…I am happier. Free, fast to open, smooth…I am using it since only 3 weeks but I feel that it deserves at least a try.", "I started using KDevelop recently and I am surprised how good it is. You should give it a try, supports CMake projects as well.", "“best IDE is the one you know” - Good point. Thanks.", "Martin - thanks for pointing that out.", "My 2 cents:", "I used to use Eclipse, which works fine, but in recent years I’ve started to like QtCreator better. In particular the CMake integration is getting some love with recent releases (see ", " and ", "). Make sure you get a recent version from the qt website, instead of the often very old version that comes packaged with your OS.", "I found that QtCreator’s build-in cmake integration works great with ROS projects (both catkin_make and catkin tools), but make sure you check out the ROS IDS’s wiki linked above for how to set things up.", "Also, there is a plugin for QtCreator that gives you even better ROS workspace integration. It has been available for catkin_make-based development for quite a while, but it is under active development and catkin_tools support has recently been added (see ", " and ", ").", "Thansk NikolausDemmel - very good information.", "I haven’t had a great solution for a while, but I do use Eclipse w/ ‘eclipsify’ to help get a lot of the references working (still build with catkin tools though).", "For anyone using Eclipse (who hasn’t already battled to set it up), I highly recommend ‘eclipsify’ from ethz-asl, to give you a jump-start in creating configured Eclipse projects for your catkin pkgs:", "\n", "eclipsify - Generate eclipse projects for catkin packages.", "\n", "I just checkout eclipsify (and their other dependency catkin_simple) into my ws, build, and run the tool over a catkin list of the projects I have checked out, and it will generate eclipse projects for you to Import, which start with some good settings they have discovered. You probably want to make a separate ‘/projects/’ dir to output the projects into, rather than the default ‘/devel/’, so a clean doesn’t blow away your projects.", "I still tweak it a bit, but it resolves a lot of the dependencies, which I find one of the most useful IDE features for me personally: I make sure to setup ‘Share settings/resources between projects’, make sure the C++11 flag is set, and include the /opt/ros/ include+lib dirs for my main projects, to help the resolution along.", "Are you using Visual Studio on Windows or Visual Studio Code (", ") on a Linux machine? I tried Visual Studio Code a while back (6 months ago?) and was unimpressed, but maybe it’s improved since then.", "On a Linux machine. Works perfectly with my ros workspaces, and you can activate a console where you can perform your catkin_make and compile directly. As I said, still trying, but I am happy right now.", "If anyone is interested, I built a tuto on how to use Kdevelop + catkin : ", "This IDE is the best I’ve experience so far, alongside with atom for the crazy multi cursor support.", "I also use Eclipse in combination with catkin tools (", "), the config is set to create eclipse projects:", "\ncatkin config --cmake-args  -G\"Eclipse CDT4 - Unix Makefiles\" -D_ECLIPSE_VERSION=4.6 -DCMAKE_BUILD_TYPE=Debug", "This then creates a single project from each ROS package in the build folder of the workspace. In Eclipse you just need to import those you want to have in your workspace.", "For me this is the best and easiest way to use Eclipse with ROS I discovered so far.", "Using the normal catkin_make with the arguments above, you will always import all the packages in the workspace as one huge Eclipse project, which is not so nice in my opinion.", "Nice, you might want to link the tutorial from the ROS wiki IDE’s page.", "Just a small nitpick:", "Cliking on build is equivalent to calling :", "I would assume that this is not correct, since ", " also builds dependent projects. Maybe it is similar to running ", ".", "Wasn’t aware of eclipsify yet, nice! Could you maybe add this reference to the Eclipse section of the IDEs page in the ROS wiki.", "If you try CLion as mentioned above (at least with a good workstation) it’s hard to go back to your previous IDE. It worths the money if you have enough RAM on your PC.", "If you are skeptical, just try it’s debugging and refactoring features.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-c-development-ide-choice/1907"},
{"title": "The 3d_navigation", "thread_contents": ["Hello,everyone.I am a new student about the ros.I find a good package for our project-3d_navigation.The page is ‘‘", "’’.But I cannot download the package for the ", " cannot be visited.Ah,I want to know that what’s wrong with it?How could I get the package at otherwhere?", "\nPlease,our project really need it.Thank you very much for solving it.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/the-3d-navigation/1971"},
{"title": "Where about in RosWiki should a write a guide on using ROS with Anaconda", "thread_contents": ["Hello I was going to write a short blurb on how to get anaconda to work on a system with ROS installed. I was wondering where in the wiki would be a good place to put it?", "Thanks", "I can’t think of a specific place, but maybe in the article about IDEs? ", "\nI write many gist files in github, they get indexed in google, so if you clearly write something with the keywords “anaconda ros” it may be found easily.", "Good luck!", "I’d recommend somewhere like ", " Don’t worry too much about the specific name. It can always be moved at a later date.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/where-about-in-roswiki-should-a-write-a-guide-on-using-ros-with-anaconda/2184"},
{"title": "Still using Indigo instead of kinetic? Why?", "thread_contents": ["Hi,", "My team is still using Indigo. being tied to Ubuntu 14.04 is start being a (minor) issue.", "\nI wonder if there are still many people using Indigo for any technical reason and if someone wants to share those reasons (maybe because of packages which were not ported to kinetic).", "Few months ago may be Moveit was the most compelling reason, but it is not the case anymore.", "Cheers", "Davide", "We’re still using Indigo for the majority of our projects.  The major reason is simply because the clients we’re developing them for don’t see any benefit to upgrading to 16.04 / Kinetic and don’t want to pay for the time it would take to migrate and test everything.", "As far as technical reasons go, the biggest obstacle is migrating from OpenCV 2 to OpenCV 3.  There are enough API changes between versions that migrating is a significant task, especially if we want to maintain 14.04 / Indigo compatibility.  Qt 4 / Qt 5 compatibility is a lesser issue but has also cropped up in a few places.", "In Kinetic with Gazebo 7 the Laser Plugin (both - normal and GPU) crashes. That might be a reason to stay with Indigo.", "As a co-maintainer of the robot (Nextage) api package that’s still running on Indigo and there’s no plan to port to uppper versions yet, I can share some of our experiences:", "I do see the benefit of upper version. Not just because of the higher major version (Gazebo, Gazebo, and others) but smaller  features additions to the ROS core libraries are not always ported backward by default AFAIK. On the other hand Ubuntu Trusty will still be supported for another 2 years so is Indigo. So advantage may not outweigh the disadvantages under limited resource in our particular case.", "Because it is always fun to wait until last minute of a LTS distribution to migrate to the next LTS that is about to expire ", "You can actually use a system lib instead of the ros library for opencv to continue to use opencv2 instead of 3. If I recall correctly, just add ", " to your CMakeLists.txt and add the appropriate libs and headers via the usual methods (the variable names are OpenCV_LIBRARIES and OpenCV_INCLUDE_DIRS respectively).", "You ", " link against OpenCV 2 if you really need to, but that breaks down quickly if you try to link in libraries from any other ROS Kinetic packages that use OpenCV, since all of the official packages are on 3 now.  In practice, working out the linker issues and/or re-implementing functionality is more work than just doing the API conversion, and neither of them are worth the time if there are no other compelling reasons to stop using Indigo.", "Right, makes sense. The stuff I was porting over didn’t depend on any other opencv packages in ros. That being said there is a lot of code out there for opencv2 so I think it’s not a bad thing to at least make aware that it is possible. I think the “no other compelling reasons to stop using indigo” goes along with the notion of don’t fix it if it ain’t broke, which I think is maybe the strongest argument to still use indigo instead of kinetic.", "The biggest reason for me is not the code migration so much as the OS migration. We have ~20 developers and many robots that would all have to move to 16.04 or Docker. That’s a lot of downtime for marginal benefit. Also, because we’re working many projects for many clients, we have to coordinate a migration like that very carefully. Again, Docker mitigates that headache, but only 2-3 people in the lab are comfortable with Docker at all, and using Docker for GUI applications requires some magic.", "I also came to the conclusion that Docker is the lo hanging fruit for this kind of problems. There are a bunch of good tutorials about how to use them with ROS, but it is still not common to do that.", "At my previous job the main reason to stick with indigo was also avoiding the OS upgrade.", "Now that I switched to Ubuntu 16.04, I must say that it still feels a lot rougher than 14.04. Basic tools like gitg are unstable and crash a lot. flashback-compiz has issues with rendering of window borders, some tray items don’t work properly (dropbox…), apps using CSD are an aesthetical disaster (at least to my eye… I think its better using other desktops / themes…).", "Haven’t encountered any issues with Kinetic though, but I don’t have much legacy code right now.", "Sorry, but IMO", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Simply the time (and its cost) to conduct a full test with the hardware.", "The risk of any regression on the users end particular those who have built non-trivial size of applications over the last few years can be understandably hesitant for the platform change."], "url": "https://discourse.ros.org/t/still-using-indigo-instead-of-kinetic-why/2150"},
{"title": "ROS Perú is possible ROS Team Support me?", "thread_contents": ["Hi, nice to meet you! I am writing from Perú and", "\nI would like to boost knowledge in ROS, creating a series of courses in Perú about ROS, so We can create a ROS team in Peru to improve the level of robotics to here, so I would like to know if ROS team can support me, I would like this initiative to be supported by an international ROS representative.", "\nI will waiting your comments and some ideas, especially from the administrators.", "Thanks!", "Nïcolas", "Hey Nicolas, welcome.", "Can you be more specific on “I would like to know if ROS team can support", "\nme” ? What kind of support are you talking about?", "ROS has a very open and supportive community, it is open source and has", "\nlots of resources both in the wiki and on ", ". I believe you", "\ncan readily find more than enough resources to start your initiative, and", "\ncan always count on the community to assist you.", "Cheers.", "so can I use the ROS logo in my course without problem?", "Cheers", "Nícolas", "I believe you can. There is a press kit on our website (", "):", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-peru-is-possible-ros-team-support-me/2243"},
{"title": "What would you include in a dream shop to prototype electronics side of ROS platforms?", "thread_contents": ["Hello, I am working to build a dream shop for prototyping a ROS-based robotics platform.  Thus far, I have quite a bit of mechanical tooling (shop pic here - Bridgeport Mill with Easson ES-12C DRO, Hardinge DV59 Lathe, Miller 211 MIG, Miller 180 TIG, Hypertherm Powermax45 Plasma cutter) ", ".  Now, I am trying to build out the electronics prototyping side so that our team can have anything needed on hand to wire up things like the Raspberry Pi 3 to motor controllers and encoders, repair things on the fly, etc.", "What must have tools would you have in your dream shop for wiring robotics platforms?", "Hi there,", "Your mech shop looks great!  For a prototyping electronics shop I would make sure to have:", "Good luck to you and your team", "A solid workstation with a CAD program that can export to both URDF and a 3D printer.", "All super helpful, thanks!", "Here is what we have thus far:", "\n", "Wiring Prototyping Equipment\n\n http:// www. robotshop. com/ blog/ en/ how-to-make-a-robot-lesson-8-getting-the-right-tools-3680\n http:// www. popularmechanics. com/ technology/ how-to/ g988/ build-your-ultimate-electronics-workstation/\n https://...", "\n", "This is late, but I would have many different gauges of wire and many different types of connectors. I’m just an individual making things in my motorhome and I always seem to have to pause a project to order the right connector.", "USB cables to connect to computers for programming.", "And, of course, a few computers with ", " monitors for both using the CAD programs and analyzing data from the robots.", "A good internal WiFi network.", "I agree about a couple ", " soldering stations. You might also want a hot-air rework station. I would suggest that you do not get cheap stations. It may seem wasteful to spend hundreds of dollars on a soldering station, but I’ve never regretted it.", "Magnetic mats or boxes with many compartments for storing screws that you take out of devices and want to put back without losing any.", "Standoffs so that you can install boards onto your robots.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["A good soldering station, ", " makes great ones.  Make sure to get solder and flux too", "A heat gun to apply shrink wrap, etc", "Wires and shrink wrap", "Header pin ", "\n", "The crimper for those connectors", "A logic analyzer, ", " makes great ones", "An O-Scope, there are tons but they vary a lot in price", "Anti-static mats", "Nice multimeters"], "url": "https://discourse.ros.org/t/what-would-you-include-in-a-dream-shop-to-prototype-electronics-side-of-ros-platforms/1906"},
{"title": "Stepper motor differential drive", "thread_contents": ["Iam trying to use an arduino and stepper motors to build a differential drive for my robot and having a lot of problems any help that someone can give me will be appeciated", "What are your problems exactly? Depending on your question it should be placed here or at ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/stepper-motor-differential-drive/2365"},
{"title": "Questions about improving the ROS real-time method", "thread_contents": ["Through investigation，we now have two plans:", "1 learn and use Open RObot COntrol Software（OROCOS-RTT）", "\n2 learn ros_control (realtime_tools) method.", "Ask experienced predecessors to give advice, help, or different solutions.thanks for your advise.", "Hi,", "Here in Belgium, we do use OROCOS quite regularly and in most cases, we just use Orocos-rtt components instead of ROS nodes.", "Some similarities would be", "There is a mailing list for users and a ", ".", "But maybe these are all positive points. There are some other advantages of ROS, like the very fact the there are lot more people involved in its maintenance and the number of active users is much higher.", "There are also numerous examples on ros_control. I have only used ", " which is a node for communication with an industrial KUKA via some KUKA defined RSI standard.", "ROS itself is not designed for real time. It is hard to get good real time performance based on ROS although your best practice on memory allocation, PREEMPT_RT patch, scheduler. Actually, I am also looking at real time, but using ROS2.", "Hi,", "from you question it is hard to understand the root of the problem. Is it throughput or latency/jitter?", "It is hard to believe that a SLAM algorithm, that usually runs at less than 30 hz, might have any problem of latency when PREEMP_RT is installed.", "I agree that ROS 1 is not meant to be used to build real-time system, but usually you notice this limitation with control algorithms that runs at 200+ Hz.", "\nUsing Orocos without understanding what the problem is, it is probably the wrong thing to do. Additionally, I suggest you to first understand what makes orcos different from ROS and in which cases it helps", "My instinct is telling me that your problem is not real-time but a wrong utilization of your CPU. May be you are running an algorithm that can be parallelized to use all the CPUs of your system at once and meet your time constraints.", "I suggest you to carefully profile your application to understand what the bottleneck is.", "EDIT: If you do think the problem is latency and NOT throughput, try using ros_control and nodelets.", "Davide", "Hi,", "\nthanks for your advise.", "\nWe are making a mobile car platform（based on ubuntu and ros1）, requiring the speed of the car can reach 2m/s, and in the car to rely on laser sensors for slam and obstacle avoidance. By testing, the laser sensor sends a stop command to the drive from an obstacle that detects the distance from the 4m to the system response, and the time of the process (T1) is from 40ms to 100ms. However, the possible maximum of T1 is not 100ms, may be greater, this period of time is uncontrollable. We want T1 to have a controllable maximum (such as 50ms), and the smaller the maximum, the better.", "\nCan you give me any suggestion in this case?", "\nthank you！", "A ROS 1 system made up of multiple nodes is inherently non-deterministic. You will probably have to do a lot of work to make T1 have a fixed maximum.", "One approach you can take is to rewrite the nodes you are using for your process to be nodelets. That will remove the uncertainty of the communication between nodes, which should give a more stable processing loop.", "Another option is to switch to ROS 2. There are facilities in ROS 2 that are designed for solving this problem. The downside is you will likely need to do a lot of porting work, but I think that in the long term this approach would give the best result.", "There is also going to be a talk by Ingo Lütkebohle from Bosch about exactly this sort of problem at ROSCon. If you can’t make it to ROSCon, the talks will be available online after the conference finishes, and they will probably be live streamed as well.", "As Geoff already mentioned, I will be talking about such things at ROSCon in more detail.", "Some of the things you could check in your system:", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Orocos provides a nice deployment script (similar to a launch file, in its own script and Lua) and", "a state-machine (again both in its scripting language and Lua) which can make life easier.", "In some cases we even control the data flow. For example we control in which order the components have to run, ", " then ", ".", "Orocos uses components instead of nodes.", "Orocos uses ports instead of publishers and subscribers. Orocos does very nicely communicate with ros nodes though.", "Components can be made in C++ & Lua, while in ROS it is C++ & Python.", "What’s your CPU load? If it’s high -> What else is running on the machine?", "What’s your sensor data-rate?", "What’s your sensor delay (the time between the physical measurement and when the sensor sends it out)?", "Are your components time-triggered (ros::Rate or ros:Timer) or data-triggered (subscriber callback)? For minimal latency, data-triggering is preferable", "Is NO_DELAY enabled on your subscribers?", "What’s the computational complexity of your obstacle avoidance algorithm?"], "url": "https://discourse.ros.org/t/questions-about-improving-the-ros-real-time-method/2302"},
{"title": "DVR dashcamera usage", "thread_contents": ["Today i have tried with a friend a DVR dashcamera. It was providing full HD and relatively cheap; only 12 euros including the memory. And it includes good night vision! . But the recording was sent to a memory card. After doing a fast online research i have found out most of these DVR cameras are having micro USB connection.", "\nThe question is : does it stream video through USB to the computer and can be used as uvc_cam. I was not and will not be able to test it to know.", " We ask that questions be directed to ", " as per the ", " and following our ", "When you do so please be more specific about how this relates to ROS and provide enough information for someone to reproduce your issue. As stated your question does not have enough information to be answerable. However for your question a better forum is likely a product support forum for the product that you are using or considering using.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/dvr-dashcamera-usage/2459"},
{"title": "ROS_ERROR_STREAM in python", "thread_contents": ["I want to know the equivalent of ROS_ERROR_STREAM in python", "Please ask such help and debugging questions on ", " instead of here on Discourse. The Q&A website is optimized to provide answers as efficiently as possible while this site we focus on announcements and discussions scoped appropriately for each category. There are guidelines for asking questions at ", ".", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-error-stream-in-python/2545"},
{"title": "ROS Lunar clearly not compatable with Ubuntu 16.04", "thread_contents": ["I’m extremely upset that ROS has rendered Ubuntu 16.04 completely unbootable after installing ROS libraries. I’ve lost all my work… did you guys even test this? All you have to do is download fresh 16.04 and install lunar desktop and it clearly breaks the OS upon reboot. Ubuntu throws a ton of errors while booting and is non-recoverable. It’s reproducible in 5 minutes. This is the 4th time in 2 months ROS has destroyed my desktop just by installing the ROS environment. Please test your software before you waste people’s time.", "Literally the first sentence from the lunar page (", "):", "“ROS Lunar Loggerhead is primarily targeted at the Ubuntu 17.04 (Zesty)”", "and a bit later,", "“It will also support Ubuntu 16.10 Yakkety, Ubuntu LTS 16.04 Xenial and Debian Stretch.”", "“", "”, in other words, ", ".", "Please test your software before you waste people’s time", "Please read some documentation before running commands blindly.", "Just tested ROS kinetic and the same thing. Literally just reproduced the problem with fresh 16.04. It must be because I’m behind a corporate proxy? The only thing I did is install fresh 16.04 and then  followed the steps here ", "After running sudo apt-get install ros-kinetic-desktop-full I reboot and this is what happens… destroyed OS", "I’m sorry to hear that are experiencing these problems.", "It’s going to be only anecdotal, but I’ve been using your exact combination of versions for some time now and have not experienced the issue you are reporting. That doesn’t mean that you are not, or that there is not an issue, but I just wanted to mention that it can work.", "Also know that typical ROS installations in my experience do not include anything that touches system(d) configuration in the way that seems to have happened for you, so this is definitely not normal.", "I’ve lost all my work…", "And I just wanted to mention that even if your system won’t boot, all your files ", " still be there.", "Booting from a LiveUSB stick should allow you to recover all your files - you could potentially even copy your entire home directory.", " I’m sorry you’re experiencing such problems.", "And I just wanted to mention that even if your system won’t boot, all your files should still be there.", "Booting from a LiveUSB stick should allow you to recover all your files - you could potentially even copy your entire home directory.", "As mentioned by ", ", hopefully you can recover your files via any recovery tool", "All you have to do is download fresh 16.04 and install lunar desktop and it clearly breaks the OS upon reboot.Ubuntu throws a ton of errors while booting and is non-recoverable. It’s reproducible in 5 minutes.", "I just tried this in a new virtual machine following your description and cannot reproduce the issue. Could you provide a series of step that allow to reproduce the issue? Did you succeed to reproduce this issue in a virtual environment or on another machine ?", "Also know that typical ROS installations in my experience do not include anything that touches system(d) configuration in the way that seems to have happened for you, so this is definitely not normal.", "I agree with this statement and don’t see what in the ROS installation process can impact this.", "This is the 4th time in 2 months ROS has destroyed my desktop just by installing the ROS environment. Please test your software before you waste people’s time.", "ROS Lunar has been thoroughly tested and is current used by thousands of users in this exact configuration so I doubt that the lack of testing is the cause of your problems here. Again a detailed series of steps to reproduce the issue in a virtual environment with defined virtual hardware will be very helpful to make sure we can act on it if there is anything we have to fix on the ROS side.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-lunar-clearly-not-compatable-with-ubuntu-16-04/2550"},
{"title": "[TBe] Turtlebot Euclid - Announcment", "thread_contents": ["Check out the writeup here:", "\n", "Also, let me know if you have any questions, or if you want to learn more about the early purchase discount and snazzy color ", "Cheers!", "Check this:", "\n", "\n", "Cheers", "\nChrimo", "I have a lot of questions ", "e.g.", "\n", "Hello!", "We will be releasing ROS drivers for the Euclid and Base soon, likely with a minimum set of sensors to start, and adding more drivers over the next few months.", "The short answer is yes, currently still in the works, stay tuned till end of September ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/tbe-turtlebot-euclid-announcment/2574"},
{"title": "When is the next sync for Indigo?", "thread_contents": ["any plan when this might happen?", "Many thanks in advance,", "Nadia", "It will be very soon. Please see ", " in the ", ". That’s the category for discussing Indigo package maintenance.", "Edit: ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/when-is-the-next-sync-for-indigo/2645"},
{"title": "2017 University Rover Challenge robots using ROS", "thread_contents": ["I saw ROS tools or heard mentions of ROS in many of the URC CDR videos that were uploaded a few weeks ago, this is a playlist of them:", "I could have easily missed more instances in the other videos:", "It’s interesting to see all the variations on the rocker bogie suspension system, and there are a handful of exceptions that use more novel approaches (though more of them need to show off the rovers going up or down a real incline and over rough terrain).", "The University Rover Challenge (URC) is an annual student competition that takes place at the Mars Desert Research Station (MDRS) to design and build the next generation of Mars rovers that will one day work alongside human explorers in the field.", "This is really cool!", "Probably the majority URC teams use ROS!", "We love it! I’m on the Ryerson University team (R3). Here’s our video:", "\n", "For the first year at URC teams have an autonomous task. This is made so much easier with ROS. We’re using the RTABMAP package to help with outdoor autonomy and I’ve seen another team mention it too.", "I see Ryerson made it in (", ") and 10 others that I was able to identify (more than a few I couldn’t find the CDR videos for).  I’m really looking forward to the competition and any new youtube videos or posts (or ROSCon 2017 post-mortems?) about these robots.", "Great idea! I will try to do a URC post-mortem at ROSCon. That idea might change thought. I plan on submitting some kind of ROSCon proposal.", "For anyone competing or interested in URC, I wrote up our team’s approach and other team’s approaches in a book chapter:", "This chapter contains the survey results of 7 teams who competed at URC 2017, including 1st and 2nd place teams! We also created 12 tutorials for URC’s competition and 7 new ROS packages that you can easily install (with apt-get) so that you don’t have to reinvent the wheel. We want to encourage code reuse! Comments and improvements are welcome.", "Thank you to all the contributors of the book chapter titled, “University Rover Challenge: Tutorials and Control System Survey”:", ", Bloor Collegiate Institute, HacklabTO Toronto, Canada, Team R3", "\n", ", University of Wrocław, Poland, Team Continuum", "\n", ", Istanbul Technical University, Turkey, ITU Rover Team", "\n", ", Cornell University, USA, Cornell Mars Rover", "\n", ", Cornell University, USA, Cornell Mars Rover", "\n", ", Indian Institute of Technology, Madras, India, Team Anveshak", "\n", ", University of Waterloo, Canada, UWRT", "\n", " Boyson, Missouri University of Science and Technology (Missouri S&T), USA, Mars Rover Design Team", "\n", ", University of Wrocław, Poland, Team Continuum", "\n", ", Istanbul Technical University, Turkey, ITU Rover Team", "\n", ", Ryerson University, Canada, Team R3", "\n", ", San Jose State University, USA, SJSU Robotics", "Hope you enjoy the chapter! Good luck to teams next year!", "re ROSCon: I’m sorry I won’t be at ROSCon, I don’t have the extra dollars to go.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/2017-university-rover-challenge-robots-using-ros/1526"},
{"title": "Catkin: run specific unit test", "thread_contents": ["I know there are specific test commands", "\n", "  to run all tests", "\nand", "\n", " to run specific test declared by catkin_add_gtest(…)", "One test file can have multiple tests though.", "\nExample:", "Is that possible to run only testsuit1 or only test3 from my example?", "Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ", " provides a forum which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", "Sorry. I moved my question there. I din’t find how to close this one though.", "\n", "Thanks.  I moved the thread to “Uncategorized” to decrease the number of people getting notifications I could close the topic as an administrator but I don’t expect many replies to come along.", "For others reference the question is now here: ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/catkin-run-specific-unit-test/2679"},
{"title": "Joint Torque Control for Universal Robot", "thread_contents": ["Hi All.", "I’m wondering is there anybody who has tried to do a joint torque control (i.e. effort_controllers of the ros_control package) for the Universal Robot? I believe I could implement the controller for the robot’s model in Gazebo. However, I’m not sure how to combine the real robot with the ros_control package. I tried to find the solution online, however, most of the sources deal only with the trajectory controller via MoveIt.", "Any help will be much appreciated.", "Best regards,", "\nAtaka", "Could you please ask this sort of question over at ", " as is explained in the ", "? If you repost there, I’ll answer it.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/joint-torque-control-for-universal-robot/2788"},
{"title": "How can I simulate a diffusive process with ROS", "thread_contents": ["Hello,", "\nI need to know if might be possible to simulate a diffusive process i.e. to set some environmental parameter like light or brighteness of an infrastructure like a wall, and  detect with a sensor (vision sensor).", "Thanks in advance", "\nDavide", "If you’re looking to simulate processes you’ll want to use a simulator. There are several with ROS integration, for what you’re looking to do I’d suggest looking at using Gazebo. To that end I’d suggest you ask for help on ", " or on one of the other simulator’s forums.", "Please note that we ask that people ask questions about ROS on ", " following our Support Guidelines: ", " I’m redirecting you to Gazebo’s instance to save you another step.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/how-can-i-simulate-a-diffusive-process-with-ros/2782"},
{"title": "Invalid roslaunch XML syntax: junk after document element: line 3, column 4", "thread_contents": ["dynamixel_controllersTutorialsCreatingmetacontroller", "I want to connect the dynamixel AX-64 motor with the PC, however, when I follow the tutorials and create a meta controller, I come across the following question.", "\nI start the controller using the following command.", "\nroslaunch my_dynamixel_tutorial start_meta_controller.launch", "the ‘start_meta_controller.launch’ file is", "And the error is:", "\n… logging to /home/acer/.ros/log/63b699b2-a98e-11e7-b094-28e34739f5b2/roslaunch-acer-ubuntu-5609.log", "\nChecking log directory for disk usage. This may take awhile.", "\nPress Ctrl-C to interrupt", "\nDone checking log file disk usage. Usage is <1GB.", "Invalid roslaunch XML syntax: junk after document element: line 3, column 4", "\nThe traceback for the exception was written to the log file", "How to solve the problem? Thanks in advance.", "Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ", " provides a forum which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/invalid-roslaunch-xml-syntax-junk-after-document-element-line-3-column-4/2846"},
{"title": "How can i make or design a robotplatform with ROS", "thread_contents": ["Hello, everybody. I have learn ROS for a while.", "\nNow i want to design my our Robot. So i want to know how can i do it ?", "Do you want to build from scratch or use a kit?", "\nAny idea what you want your bot to do?", "Thanks for your question. However we ask that you please ask questions on", "\n", " following our support guidelines:", "\n", "ROS Discourse is for news and general interest discussions. ROS Answers", "\n", " provides a forum which can be filtered by tags to", "\nmake sure the relevant people can find and/or answer the question, and not", "\noverload everyone with hundreds of posts.", "I think my book will help. The Learning Robotics using Python will help you to build simulation and hardware of mobile robot from scratch.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/how-can-i-make-or-design-a-robotplatform-with-ros/2972"},
{"title": "Robot Coloring Book", "thread_contents": ["Hi, thanks for the Robot Coloring Book you gave us at ROSCon, it’s awesome ", " Do you plan to release it under CC or any other open-source license? ", "Glad you like it!", "We’re not currently planning to release the source material, but we are working on a way for you and others to be able to get more copies of the print version. Stay tuned…", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/robot-coloring-book/2986"},
{"title": "Gazebo differential drive vehicle model", "thread_contents": ["Hi,", "I have followed the instructions reported on ", " in order to create a model for a differential drive vehicle on Gazebo.", "However even if I manually publish the commands of the hinges (e.g., for the left wheel hinge, rostopic pub -1 /mybot/leftWheel_effort_controller/command std_msgs/Float64 “data: 1.5”) the respective wheel does not rotate and the robot remains still.", "The code describing my robot is similar to the one reported in the tutorial.", "Does anyone have any idea on how to solve this issue?", "Thank you all.", "Thanks for your question. However we ask that you please ask questions on", "\n", " following our support guidelines:", "\n", "ROS Discourse is for news and general interest discussions. ROS Answers", "\n", " provides a forum which can be filtered by tags to", "\nmake sure the relevant people can find and/or answer the question, and not", "\noverload everyone with hundreds of posts.", "[However, you might want to check out ", "]", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/gazebo-differential-drive-vehicle-model/3052"},
{"title": "Problem with RVIZ and ROS fom source", "thread_contents": ["I have successfully compiled ROS lunar in archlinux, already have done some PR in github to update the packages to python3.", "Now I have a big problem with xacro and I don’t know why…", "I can import xacro, fnmatch and glob in python2 and python3 after sourcing setup.zsh.", "\nPYTHONPATH = /mnt/hd/ros_ws/lunar/install_isolated/lib/python3.6/site-packages", "\nlog: ", "Thanks ", " for the report. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ", " provides a forum which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", "(To reproduce manually with a minimal example you can try to source your workspace and run ", " and if it fails look at if you can import it with the resulting ", ")", "Sorry for that, thanks ", ", I’ll ask there.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/problem-with-rviz-and-ros-fom-source/3181"},
{"title": "Hokuyo URG 04LX Failed to open port", "thread_contents": ["i install hokuyo_node in kinetic from this link ", "\nbut when i try to run the node :  rosrun hokuyo_node hokuyo_node", "\ni get this error ", "\n[ERROR] [1511453614.949279898]: Exception thrown while opening Hokuyo.", "\nFailed to open port: /dev/ttyACM0. No such file or directory (errno = 2). The requested port does not exist. Is the hokuyo connected? Was the port name misspelled? (in hokuyo::laser::open) You may find further details at ", "\nand when i try this :  ls /dev/ttyACM*", "\nor this : ls -l /dev/ttyUSB0", "\ni get No such file or directory", "Thanks for your question. However we ask that you please ask questions on", "\n", " following our support guidelines:", "\n", "ROS Discourse is for news and general interest discussions. ROS Answers", "\n", " provides a forum which can be filtered by tags to", "\nmake sure the relevant people can find and/or answer the question, and not", "\noverload everyone with hundreds of posts.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/hokuyo-urg-04lx-failed-to-open-port/3236"},
{"title": "Autonomous deep learning robot", "thread_contents": ["Hi there,", "I ordered the “Deep Learning Robot” from ", ", which runs on ROS,", "\n", "Does anyone know if there is any user/discussion groups out there for this specific robot? The best info I could find is from:", "\n", "Robots, ROS, AI and robotic software.", "\n", "Cheers,", "\nDaniel", "I just have to say its a nice robot for the price! If I didn’t have too many robots in various states of being built I’d consider it.", "My only reservation about this robot is that the processor only has 2 GB of RAM which doesn’t seem a lot for deep learning and AI. On the other hand, I tend to overestimate how much I need. ", "Do you maybe know what is the supported load for the deep learning robot?", "Do you maybe know what is the supported load for the deep learning robot?", "I don’t know, but it’s the same as for the regular Turtlebot2. The “deep learning robot” isn’t available from ", " any more, but you can build it yourself - it’s just a Turtlebot2 with an Nvidia Jetson TK1 and an Orbbec Astra.", "Thank you for your reply!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/autonomous-deep-learning-robot/1513"},
{"title": "Testing working group", "thread_contents": ["Is anyone interested in joining to…", "Does the topic “Testing” deserve an own category?", "Consider the ROSIN software quality Working Group instead:", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["improve the structure of the testing related ROS wiki pages\n", "single point of entry", "separation into test level specific pages (e.g. bottom-up: library unit testing, ROS node unit testing, ROS nodes integration testing, …, simulation based testing)", "…", "\n", "create testing examples similar to the ", "\n", "improve the content of the testing related ROS wiki pages\n", "hyper-linking testing examples for every test level", "referencing relevant book chapters", "how to use test level specific test frameworks (applying usual testing techniques)", "how to integrate test specific test frameworks into the build", "how to create/use test doubles (stub, mock, spy, fake dummy) in ROS", "\n", "improving test related libraries\n", "\n", " (only capable of mocking: service server, message subscriber and actionlib server)", "…", "\n", "…"], "url": "https://discourse.ros.org/t/testing-working-group/1876"},
{"title": "From 360 degree sparse point cloud (lidar) (PointCloud2 msg) to depth image?", "thread_contents": ["Hey,", "\nIs there any ROS package for it already? Or how would you approach this?", "Cheers", "Some time ago I have been playing with this topic, converting pointclouds from a Velodyne to range-images using PCL.", "\nYou can find some code ", " to get you started.", "\nDisclaimer : It requires some extra work and polishing.", "Cheers.", "Hey Jeremie. Thanks for your helpful reply. I’m using a VLP16 (i saw the config file for a Velodyne 16 in the devel branch). Do you have by any chance a before/after shot of the latest version? I think it would be quite helpful to see what the output would look like ", "As this topic got closed I’ve added a link to the ROS answer thread:", " It looks like you got a pointer to a package that can help you.", "However going forward I’d like to request that you follow ", " and ask questions on ", " . ROS Discourse is for news and general interest discussions.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/from-360-degree-sparse-point-cloud-lidar-pointcloud2-msg-to-depth-image/3318"},
{"title": "Normal of pointcloud2", "thread_contents": ["Hello,", "\nI am a beginner un ros. I want to find the normal of my pointcloud2. Is there a class who do that un ros?", "Thanks you un avance.", "Hello,", "I’m not experienced with PCL but to detect planes (for object recognition) I’ve used in the past: ", "\nBut I don’t know if it will give you straight away the normals. I don’t remember what it returns, even tho you can see the planes in Rviz.", "If you are also inexperienced in PCL and ROS, there is a GitHub repo with a nice writing and sample code on how to do stuff with PCL and ROS here: ", "\nAnd the PCL docs have an article about finding normals: ", "Good luck.", "Thank you for the answer.", "The problem is I can’t install pcl for ROS. I hva eproperly install pcl 1.7 on ubuntu but it seems there is no pcl install on my ROS kinetic.", "\nI made a ros kinetic full install and pcl is not there. How can I add it to my ros kinetic?", "Taking a look at the wiki: ", "\nI see it’s released for Kinetic, so:", "should work.", " I see you’ve gotten some pointers here. However going forward I’d like to request that you follow ", " and ask questions on ", " . ROS Discourse is for news and general interest discussions.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/normal-of-pointcloud2/3314"},
{"title": "The Construct Live Speech for Investors", "thread_contents": ["Hi all,", "\nsince at The Construct, we are very heavy promoters of ROS, we thought that people in the field would be interested to know that we are looking for investors. For this purpose, we are giving a live speech about it on Thursday the 7th of December 2017.", "You can find more details here: ", "I put this message under category ", ". Let me know if I should move this notice or else.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/the-construct-live-speech-for-investors/3338"},
{"title": "Rosdep experienced an internal error", "thread_contents": ["Amirhosseins-MacBook-Pro:ros_catkin_ws amirhosseingholami$ rosdep install --from-paths src --ignore-src --rosdistro kinetic -y", "ERROR: Rosdep experienced an internal error.", "\nPlease go to the rosdep page [1] and file a bug report with the message below.", "\n[1] : ", "rosdep version: 0.11.8", "Bad installer [pip]: [Errno 2] No such file or directory", "Please ask for help on ", " or open an issue on the appropriate issue tracker, in this case ", ", instead of posting here on discourse. Also please look for existing, similar issues (I believe this issue has already occurred on the rosdep issue tracker).", "See ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/rosdep-experienced-an-internal-error/3461"},
{"title": "Running ROS across multiple machines is failed", "thread_contents": ["Hi All,", "I am trying to run  ROS across 2 machines, master is starting with out any issues when I tried to run listener getting below errors.", "\n", "\n", "I have followed below procedures.", "System 1-", "\nsetting static IP-", "\nifconfig eth0 192.168.0.1 netmask 255.255.255.0", "\nroute add default gw 192.168.0.1 dev eth0", "export ROS_IP=192.168.0.1", "\nexport ROS_HOSTNAME=192.168.0.1", "roscore &", "export ROS_MASTER_URI=http://192.168.0.1:11311/", "\nrosrun rospy_tutorials ", "System-2", "setting static IP-", "\nifconfig eth0 192.168.0.2 netmask 255.255.255.0", "\nroute add default gw 192.168.0.2 dev eth0", "export ROS_IP=192.168.0.2", "\nexport ROS_HOSTNAME=192.168.0.2", "export ROS_MASTER_URI=http://192.168.0.1:11311/", "\nrosrun rospy_tutorials ", "Note: I could able to ping between system 1 & 2.", "Kindly help us to debug this issue in my setup.", "Kindly let me know if you need any more information,", "Regards", "\nBharath", "Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ", " provides a forum which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/running-ros-across-multiple-machines-is-failed/3601"},
{"title": "Matching RGB image with Point Cloud", "thread_contents": ["I have two different sensors,one for capturing an RGB image (from an Intel RealSense SR300), and one for giving me a 3D Point Cloud(from a DUO MC stereo camera). How can I integrate the two? Is it possible to match the pixels of the RGB image to the points in the Point Cloud? I need a separate depth sensor because the SR300 does not work in the presence of ambient light.", "Is there any method for this? Can it be done while retaining accuracy?", "Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ", " provides a forum which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/matching-rgb-image-with-point-cloud/3619"},
{"title": "Problems with OpenCR 1.0", "thread_contents": ["Hey all,", "My final year project requires a robot that is capable of SLAM and autonomous navigation, Turtlebot 3 was perfect for it!", "Fast forward, I have assembled the Turtlebot 3 but I am unable to ‘move’ it by pressing the SW1 and SW2 on OpenCR.", "Also, now that the assembly is done. Do I need to use Arduino IDE to configure OpenCR first, before proceeding to setting up ROS-Master & Slave?", "You have to press the buttons for ~3 secs for them to work.", "And yes, I was also confused if the OpenCR has to be flashed manually or not, and the answer is - it comes pre-programmed, so this part is optional ", "Thank you for the response.", "I will be using some sensors to collect data to the raspberry pi 3.", "\nIs there any way of communication for the data to be sent to the Master computer through ROS or must it be through Python?", "  Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ", " provides a forum which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", " Post a link to your question at ", " also here, so that we can continue the discussion.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/problems-with-opencr-1-0/3700"},
{"title": "AI Tournament for industrial robots in Air Hockey", "thread_contents": ["Hi, everyone.", "I want to announce the AI Tournament for industrial robots in Air Hockey.", "Everyone knows the competition of two AI in the GO game. But how about the competition of AI in a more dynamic game that requires tactics, operational reaction and speed instead thoughtful strategy?", "For example, Air Hockey!", "The simple Cartesian coordinate system - 3 coordinates and 1 Euler angle, only one an influence tool (the striker) on the game . Hence, only one hand is needed. Let take 6 axial industrial robots, put instead of players from two sides of air hockey table…", "An industrial robot can make linear and arc motions, adjust the movement speed, rotate the striker in movement. It opens an incredible number of options for punches and flight trajectories of the puck.", "It remains only to make the AI who can take advantage of all this diversity, and even at high speed of robot.", "However, AIs must be different, like people, from different teams, each with its own character. So it will be more interesting, will not it? Different teams will build AI on different principles. Someone will create the intellect of a thoughtful tactician, another one will lay to setting a primitive reflex “see it - hit it”. By the way, it is not known who of them will win.", "To make it all happen and we were able to personally watch the sports-robotic event, the AI tournament was announced for industrial robots in Air Hockey.", "To participate in the tournament it is necessary to develop an AI that managing industrial robot. This AI will compete with the AIs developed by other participants at the table for the Air Hockey.", "Acceptance of applications will begin on February 1 on the official page of the tournament: ", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["1st place - 2600 USD", "2nd place - 1700 USD", "3rd place - 800 USD", "The tournament is held on the Olympic system, with the elimination after the first losing round.", "AIs play 2 times in 1 round, changing robots after the first time.", "The AI with the greatest number of goals wins in the round.", "The time is up to 7 goals or 7 minutes, whichever comes first.", "AI must withdraw the puck from its field within 7 seconds. AI will lose 1 goal for every 7 seconds in a row, if the puck on its field.", "22 January - Announcement.", "01 February - Starting of applications acceptance. Also the publication of a technical manual for the development of AI.", "01 April - Opening of the beta-stand. Starting from this date, participants can test their AI with another AI or person on a real AirHockey stand and robots.", "31 April - Closing of applications acceptance and beta-stand. After this date, you can not send the AI to the test or update the submitted version.", "01 May - The draw. Starting of the tournament. Live broadcast of the tournament through streaming service.", "07 May - Winners award ceremony.", "The AI is allowed to tournament after pass the test at the beta-stand.", "To program robots, you must use the RCML SDK in C ++. A special tournament version will be published.", "The AI opponents will have the same PCs (under Windows 10), cameras and strikers on robots.", "The cameras are located above the center of the field, the direction of the view from above to below."], "url": "https://discourse.ros.org/t/ai-tournament-for-industrial-robots-in-air-hockey/3782"},
{"title": "Mismatched protocol version in packet: lost sync or rosserial_python is from different ros release than the rosserial client", "thread_contents": ["Hello Everyone,", "I am new to ROS, I would like to ask for help with my problem:", "I am using Teensy 3.6, I always have problem with communication, I fixed some and last week It was working normally. This week I start to receive this error when I run my Teensy as ROS node", "[INFO] [WallTime: 1513632615.825940] Protocol version of client is unrecognized, expected Rev 1 (rosserial 0.5+)", "\n[INFO] [WallTime: 1513632616.391569] wrong checksum for msg length, length -257", "\n[INFO] [WallTime: 1513632616.391837] chk is 4", "\n[INFO] [WallTime: 1513632616.955837] wrong checksum for msg length, length 4", "\n[INFO] [WallTime: 1513632616.956110] chk is 255", "\n[INFO] [WallTime: 1513632617.520817] wrong checksum for msg length, length 4", "\n[INFO] [WallTime: 1513632617.521132] chk is 255", "\n[INFO] [WallTime: 1513632618.092081] wrong checksum for msg length, length 4", "\n[INFO] [WallTime: 1513632618.092400] chk is 255", "\n[INFO] [WallTime: 1513632618.653598] wrong checksum for msg length, length 4", "\n[INFO] [WallTime: 1513632618.653886] chk is 255", "\n[INFO] [WallTime: 1513632619.218930] wrong checksum for msg length, length 4", "\n[INFO] [WallTime: 1513632619.219191] chk is 4", "\n[INFO] [WallTime: 1513632619.780296] wrong checksum for topic id and msg", "\n[INFO] [WallTime: 1513632620.348411] wrong checksum for msg length, length 4", "\n[INFO] [WallTime: 1513632620.348672] chk is 4", "\n[INFO] [WallTime: 1513632620.910055] wrong checksum for topic id and msg", "\n[INFO] [WallTime: 1513632621.474895] wrong checksum for msg length, length 0", "\n[INFO] [WallTime: 1513632621.475235] chk is 127", "\n[ERROR] [WallTime: 1513632622.044584] Mismatched protocol version in packet: lost sync or rosserial_python is from different ros release than the rosserial client", "any help would be appreciated,", "Thank you so much,", "Best,", "Moaed", "Hi,", "\nI also got the same error, in my case it was the simple mistake of reading from a wrong serial port. I had two usb serial connections for two sensors and their hardware device formation on ubuntu tty/ACM* got interchanged. Just changing the devices worked for me.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/mismatched-protocol-version-in-packet-lost-sync-or-rosserial-python-is-from-different-ros-release-than-the-rosserial-client/3450"},
{"title": "ROS GNU GPL v1.2 issue", "thread_contents": ["Hello - I work for an organization which has stringent legal review for open source products. We have recently scanned ROS Indigo Desktop Full version using open source scanning tool called Blackduck. The scanning tool found some of the ROS components withGPL dependency. One of the component xmlrpcpp is mentioned as  LGPL-2.1 in the package.xml file. However, the xmlrpc.h under “lib” folder says it is “GNU GPL” license in the comments section (copied below). Since ROS is distributing this file which is licensed under GPL v2.1, doesn’t this make ROS also be GPL product?  While we are thinking of proposing a minimalist approach to have ROS Base edition and add components as needed, found that even ROS Base is distributed with these xmlrpc files that carry GPL v1.2 license requirement mentioned.", "Here is the summary of license conflict:", "\nHere is the summary of conflicts –", "\nCPL 1.0  IVCON_generic", "\nGNU LGPL  gazebo_ros_pkgs_generic -", "\nGPL v2.1  KDL_generic v2.1; orocos_kinematics_dynamics; Stage; xmlrpc_generic; xmlrpcpp_generic", "Snippet from xmlrpc.h file:", "\n“6.// XmlRpc++ Copyright © 2002-2003 by Chris Morley", "\n7.// This library is free software; you can redistribute it and/or", "\n8.// modify it under the terms of the ", "\n", " as published by the Free Software Foundation; either", "\n10.// version 2.1 of the License, or (at your option) any later version.”", "Thanks for bringing this issue up. We take license conformance very seriously and want to be sure that we’re correctly representing the license status on each package in the ROS ecosystem.", "In this case, I’m a little confused: the header file that you mention states that it is released under the GNU LGPL:", "which agrees with the license tag in that package:", "Can you clarify where you’re seeing the reference to xmlrpcpp being covered by the GNU GPL (as opposed to the GNU LGPL)?", "Gerkey - Thanks for replying. Extremely Sorry for my late response.", "You are right on the LGPL on the header. For some reasons the blackduck tool (license scanning tool) classified this as GPL.", "However, our legal team questions use of LGPL for production use. What is the guideline ROS provides for example use of xmlrpcpp included in the ROS core for production deployment?", "Additionally, we noticed that stage and ivcon components are classified as GPL. These are part of ROS desktop. Will these be used more of a utility?", "Appreciate your feedback.", "Thanks.", "I won’t try to speak to whether or not LGPL is acceptable for use in your company, that’s up to you. There are plenty of examples outside of the ROS community where LGPL is used in different scenarios on which you can draw experience. Other people/companies in the ROS community might be able to give their experience doing so. Also see this ROSCon talk which covers licenses in ROS and a company’s experience auditing those:", "Additionally, we noticed that stage and ivcon components are classified as GPL. These are part of ROS desktop. Will these be used more of a utility?", "Stage is a simulator which runs in a stand alone process and communication with it is done over TCP/IP. Also, it is usually used for R&D, not product deployment, so I think that’s fine.", "ivcon appears to be CPL (common public license) (see: ", "), but in any case it is only used as a utility to convert a mesh file from one format to another. Also, it is only used within the PR 2 description packages, which are only part of desktop-full for use in certain tutorials.", "In both cases I do not believe they would be used in a production system and in both cases they are run as stand alone executables rather than used as libraries.", "Hi wjwwood - That’s for that insightful response. Very much appreciate.", "Since xmlrpcpp - a LGPL component - is part of the ROS base itself, will there be any issue if we remove XMLRPCPP from production deployments?", "Also, would be interested in knowing how other organizations take LGPL for IP/Production deployment cases.", "Thank you.", "Since xmlrpcpp - a LGPL component - is part of the ROS base itself, will there be any issue if we remove XMLRPCPP from production deployments?", "Also, would be interested in knowing how other organizations take LGPL for IP/Production deployment cases.", "xmlrpcpp is used for the core of roscpp. You can’t simply remove it. However, the LGPL is specifically meant to allow ", " linking with closed source components, so you should be fine. See section 4 of the LGPL specifically [1].", "One important aim of the LGPL is to still allow end-users to use modified versions of the LGPL code. Static linking makes that relatively difficult, whereas its just a matter of providing an alternative shared library when using dynamic linking.", "If you must do static linking (for whatever reason), you are allowed to do so if you provide a means for relinking with an alternative version of the LGPL code. You can do that by providing the compiled object (.o) files of your proprietary code. However, using shared libraries is much easier for everyone, and its the way the binary distributions of ROS use xmlrpcpp.", "Additionally, the header ", " distributed with xmlrpcpp contains function templates that are longer than 10 lines of code. That means you also need to provide the correct copyright notice(s) and a copy of the LGPL with your binary code to comply with section 3 of the LGPL [2].", "However, it’s not very clear to me if the file ", " is really part of xmlrpcpp and if it is distributed under the LGPL. It looks like it has been copied verbatim from some other source without appropriate license information. That could be problematic (much more so than complying with the LGPL). There is an email address in comments at the top of the file which you could attempt to contact to find out what the story behind that file is. A quick google for the contents of the file indicates that many other projects also copied the file verbatim. I couldn’t quickly find the original publication with a license.", "Then again, you already said your legal team has objections. Sounds like you should fight it out with them. And of course the required disclaimer: I’m not a lawyer.", "[1] ", "\n[2] ", "I tried to send an email to the listed address, but the account is no longer active. I got a bounce immediately. Does anyone happen to know where ", " in xmlrpcpp comes from and which license applies to it?", "\nAfter more digging, this seem to be the original publication: ", "There is no license information included though…", "\nThere is a github issue for solving the ", " licensing issues: ", "de-vri-es  -", "Thanks for the insights. very helpful.", "Do you know how can i download source code directly from SVN or github? Apparently ", " is not reachable.", "This page --> ", " is not properly updated with the source code url", "Thanks", "Trying to find way to get source directly from SVN or github. The website ", " doesn’t seems to be pointing to right repository. ", " isn’t working. the page may need to be updated.", "Thanks.", "You are right that that wiki page is outdated. It does include a notice at the top though linking to another page with a number of github organizations that each host some parts of ROS [1].", "If you’re specifically looking for the ROS fork of ", ", that can be found in the ", " repository [2].", "[1] ", "\n[2] ", "Maybe on a related note, I wasn’t sure why ", " can be BSD while it statically links to an L-GPL package ", ", I did a quick research and ", ". As IANAL, there’s no guarantee that the post is correct (but appreciate feedback in the comment section).", "Maybe on a related note, I wasn’t sure why roscpp can be BSD while it statically links to an L-GPL package xmlrpcpp, I did a quick research and wrote what I found. As IANAL, there’s no guarantee that the post is correct (but appreciate feedback in the comment section).", "I couldn’t quite manage to comment there, so I figured I’d share my thoughts here:", "To the best of my knowledge (IANAL), the source code of roscpp can be published under any compatible license. The source code of roscpp is not a modified version of the LGPL work, nor is it a combined work. It is a new project (or work), written from scratch, which happens to make some calls into an LGPL library. That alone is not enough to qualify as combined or derived work.", "With the GPL, any combined work must be distributed under the terms of the same GPL version. A linked program or library ", "  a combined work (it literally contains all the linked works), so the binary version would have to be distributed under the terms of the GPL.", "To my knowledge, the other license still applies. One license can not magically cancel the other. That means that the combined work is covered by ", " licenses. As long as the terms of these licenses do not conflict, there is no problem. If they do conflict, it is not allowed to distribute the binary.", "But xmlrpcpp isn’t licensed under the GPL, it is licensed under the LGPL, which has a bit more to say on the topic of combined works in ", ":", "You may convey a Combined Work ", " that, taken together, effectively do not restrict modification of the portions of the Library contained in the Combined Work and reverse engineering for debugging such modifications, if you also do each of the following: …", "The important part here is: “under the terms of your choice”. So the combined work doesn’t have to be distributed under the same license, as long as the conditions of the LGPL are still honoured.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["// You should have received a copy of the GNU Lesser General Public", "// License along with this library; if not, write to the Free Software", "// Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307", "<package>", "<name>xmlrpcpp</name>", "<version>1.13.5</version>", "<description>", "  XmlRpc++ is a C++ implementation of the XML-RPC protocol. This version is", "  heavily modified from the package available on SourceForge in order to", "  support roscpp's threading model. As such, we are maintaining our", "  own fork.", "</description>", "<maintainer email=\"dthomas@osrfoundation.org\">Dirk Thomas</maintainer>", "<license>LGPL-2.1</license>", "\n", "<url>http://xmlrpcpp.sourceforge.net</url>", "<author>Chris Morley</author>", "<author>Konstantin Pilipchuk</author>", "<author>Morgan Quigley</author>", "<author>Austin Hendrix</author>", "\n", "<buildtool_depend>catkin</buildtool_depend>", "\n", "<build_depend>cpp_common</build_depend>", "Combined Works."], "url": "https://discourse.ros.org/t/ros-gnu-gpl-v1-2-issue/1642"},
{"title": "ROS Summer School - Singapore", "thread_contents": ["Dear ROS users,", "We are holding in collaboration with FH Aachen our first Summer School in Singapore.", "The registration is open to all.", "Date: March 12th - 16th", "\nLocation: Singapore", "For more information please visit the ROS-Industrial website!", "\n", "Regards,", "\nMin Ling Chan", "\nROS-Industrial Consortium Asia Pacific Program Manager", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-summer-school-singapore/4034"},
{"title": "How to setup environment to test latency of publisher and subscriber scenarios", "thread_contents": ["I want to setup an environment where I can check latency of different publisher and subscriber scenarios in different architectures.How can I do it??", "Here is a recent 2018 paper from Robotics and Autonomous Systems that touches on this topic:", "Robotic software frameworks simplify the development of robotic applications. The more powerful ones help to build such applications as a distributed …", "In order to reproduce the network scenarios described before (localhost, Gigabit ethernet and WiFi networks), we take advantage from Linux NetEm [46]. This module allows the simulation of network delays. Moreover, we are able to simulate bandwidth and packet loss.", "[46] S. Hemminger, Network Emulation with NetEm, in: Linux Conf Au, 2005. URL ", ".", "Looks like they’ve also released there code for the experiments here:", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/how-to-setup-environment-to-test-latency-of-publisher-and-subscriber-scenarios/4167"},
{"title": "Need help connecting RaspberryPi3b to PC over wifi", "thread_contents": ["Hi, Newbe here and am thrilled I’ve gotten this far:", "\nI have an ESP8266 talking back and forth to my PC using: rosrun serial_python serial_node.py tcp", "\nI want to use my RaspberryPi3B instead of ESP8266, but am stumped on how to do it. The ESP program, using Arduino IDE, includes the lines:", "// Set the connection to rosserial socket server", "\nnh.getHardware()->setConnection(server, serverPort);", "\nnh.initNode();", "How would I do that to the simple ros:wiki Talker.cpp example so it runs on the pi and the Listener.cpp runs on the PC?", "\nThanks for any help.", "Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ", " provides a forum which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", "If you’d like you can reply with a link to your ", " question, but in the future please start there.", "Also related please don’t ", " it’s considered bad etiquette. And if you provide more details in your question it will be easier for people to help you get to where you want to go. The support guidelines have suggestions for how to ask good questions.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/need-help-connecting-raspberrypi3b-to-pc-over-wifi/4291"},
{"title": "Invoking \"make -j4 -l4\" failed", "thread_contents": ["Hi all", "\nI was following the manual to install ros on Ubuntu 16.04", "\n", "\nWhen I reach this command : cd ~/catkin_ws && catkin_make", "\nI get this error", "\nBase path: /home/basma/catkin_ws", "\nSource space: /home/basma/catkin_ws/src", "\nBuild space: /home/basma/catkin_ws/build", "\nDevel space: /home/basma/catkin_ws/devel", "\nInstall space: /home/basma/catkin_ws/install", "[  0%] Built target std_msgs_generate_messages_lisp", "\n[  0%] Built target sensor_msgs_generate_messages_lisp", "\n[  0%] Built target _turtlebot3_msgs_generate_messages_check_deps_Sound", "\n[  0%] Built target _turtlebot3_msgs_generate_messages_check_deps_PanoramaImg", "\n[  0%] Built target _turtlebot3_msgs_generate_messages_check_deps_TakePanorama", "\n[  0%] Built target _turtlebot3_msgs_generate_messages_check_deps_SensorState", "\n[  0%] Built target sensor_msgs_generate_messages_py", "\n[  0%] Built target std_msgs_generate_messages_py", "\n[  0%] Built target _turtlebot3_msgs_generate_messages_check_deps_SetFollowState", "\n[  0%] Built target sensor_msgs_generate_messages_eus", "\n[  0%] Built target _turtlebot3_msgs_generate_messages_check_deps_VersionInfo", "\n[  0%] Built target sensor_msgs_generate_messages_cpp", "\n[  0%] Built target std_msgs_generate_messages_eus", "\n[  0%] Built target std_msgs_generate_messages_cpp", "\n[  0%] Built target sensor_msgs_generate_messages_nodejs", "\n[  1%] Building CXX object my_first_pkg/CMakeFiles/hello_node.dir/src/hello.cpp.o", "\n[  1%] Built target std_msgs_generate_messages_nodejs", "\n/home/basma/catkin_ws/src/my_first_pkg/src/hello.cpp:2:21: fatal error: ros/ros.h: No such file or directory", "\ncompilation terminated.", "\n[  1%] Built target diagnostic_msgs_generate_messages_lisp", "\n[  1%] Built target geometry_msgs_generate_messages_cpp", "\n[  1%] Built target geometry_msgs_generate_messages_eus", "\n[  1%] Built target geometry_msgs_generate_messages_lisp", "\n[  1%] Built target geometry_msgs_generate_messages_nodejs", "\nmy_first_pkg/CMakeFiles/hello_node.dir/build.make:62: recipe for target ‘my_first_pkg/CMakeFiles/hello_node.dir/src/hello.cpp.o’ failed", "\nmake[2]: *** [my_first_pkg/CMakeFiles/hello_node.dir/src/hello.cpp.o] Error 1", "\nCMakeFiles/Makefile2:1625: recipe for target ‘my_first_pkg/CMakeFiles/hello_node.dir/all’ failed", "\nmake[1]: *** [my_first_pkg/CMakeFiles/hello_node.dir/all] Error 2", "\nmake[1]: *** Waiting for unfinished jobs…", "\n[  1%] Built target geometry_msgs_generate_messages_py", "\n[  1%] Built target roscpp_generate_messages_nodejs", "\n[  1%] Built target roscpp_generate_messages_lisp", "\nMakefile:138: recipe for target ‘all’ failed", "\nmake: *** [all] Error 2", "\nInvoking “make -j4 -l4” failed", "\nCan anybody help me???", "Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "In short, this is not a turtlebot3 issue. You have a problem with my_first_pkg’s ‘hello.cpp’ file. Removing the ‘my_first_pkg’ package in the ‘catkin_ws/src/’ directory will solve this problem. ", "[  1%] Built target std_msgs_generate_messages_nodejs", "/home/basma/catkin_ws/src/my_first_pkg/src/hello.cpp:2:21: fatal error: ros/ros.h: No such file or directory", "compilation terminated.", "I did and my problem is solved", "\nThanks a lot", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/invoking-make-j4-l4-failed/4332"},
{"title": "Do I need a cloud for speech recognition or speech-to-text?", "thread_contents": ["This is an ", ".", "\nIn the context of ", ": Is there a difference between the two words ", " and ", "?", "\nIn the current state of my knowledge and plans I only need speech to text in the meaning that the robot will record spoken words via its microphones and convert that to strings - not more. How the strings are interpreted is the business of the programmer - the scripts I put on the machine.", "It is not my goal to bring automaticly “sense” into the spoken words like the “smart” speakers trying to do.", "\nWhen and why do I need a extern computer system (e. g. a cloud-based servicer like one of the usa-data-hungry “KI”-systems or a NVIDIA Jetson System) for that tasks? What are the “borders” of the different solutions?", "\nMy question is not about specific products or coding problems. I prepare to buy a research robot (don’t want to make advertising at this point) and try to figuring out the conrete setup/configuration of the machine.", "The machine will have contact to vulnarable people in case of research. So there are a lot of reasons why cloud-based service are not an option: Privacy of the subject, data security laws, ethical concers (ethics commissions won’t never say OK).", "The goal of my question is to get a bigger picture about that topic and it’s side topics.", "No, you do not need a ‘cloud’.", "Getting text from speech is a separate problem from the interpretation of that text. That last part is sometimes called NLU: Natural Language Understanding and is related to Natural Language Processing.", "Several cloud or online services exist that do both and there are that only do the text-to-speech, not the NLU.", "\nThere are offline (ROS)-packages as well:", "The mycroft community has been working on local speech to text:", "Is the code of Mycroft AI modular so that i can replace the current cloud STT by Kaldi or Pocketsphinx running on a local server?  It’s clear why the company uses cloud services for now and the approach to develop OpenSTT but nevertheless it’s an...", "\n    ", "Mycroft also has a project called OpenSTT, although it seems to be presently dormant.", "voice.mycroft.ai - Mycroft", "Also, if you happen to need something thing to go the other direction, say TTS:", "A TensorFlow implementation of Baidu's DeepSpeech architecture - mozilla/DeepSpeech", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", " (though not easy to make reliable in my experience). Also take a look at ", "\n", "For RoboCup@Home, my team uses ", " together with ", "\n"], "url": "https://discourse.ros.org/t/do-i-need-a-cloud-for-speech-recognition-or-speech-to-text/4347"},
{"title": "Can anyone explain how to build our own ROS2 packages in windows", "thread_contents": ["Hi,", "I am a beginner to ROS2, I am trying to learn how to build our own packages in ROS2. If anyone knows any website which explains the procedure please share the link. Looking forward for your help.", "Regards,", "\nChandrashekhar", "HI, Thanks for your interest in ROS2. However please take a moment to read through our Support Guidelines for the appropriate way to reply to topics. ", "Posting here in a projects announcement channel, and your reply to a jobs post are off topic. Questions should be asked on ", " our Q&A forum.", "Also please consider taking a little bit more time to fill out your question. The better and more specific your question the better an answer you will get. Your question is generic enough that the first link on a search for ROS2 is about as good an answer as you can get: ", " with links to Tutorials, contributing guide and developer guide.", "I’ve moved this to uncategorized and will close this thread after this post.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/can-anyone-explain-how-to-build-our-own-ros2-packages-in-windows/4397"},
{"title": "Are serious things done with ROS in Python?", "thread_contents": ["I am wondering whether ROS programming for serious projects always ends up being in C++. In other words, is Python the “onramp” to lower the barriers, but everyone graduates to C++?", "Our organization certainly has production Python code in use in our client sites. There’s always a matter of the right tool for the job, though - we don’t have any controls or perception code written in Python, that’s all in C++.", "There are definitely serious things done in Python. In fact, a large amount of the every day tools we use are python-based. I think that performance reasons lead to the C++ favoritism, honestly.", "Some other “serious” things done in Python:", "There are also drivers done on Python (specially ones that deal with Serial devices):", "And hey, lots of deep learning happening in Python (and then wrapped in ROS).", "Everyone loves a good statistic, so I’ve put together a ", " that collects the major language used in each released ROS repository, as classified by GitHub. You can clearly see that C++ is the dominant language, but Python is also used a lot, including for “serious stuff”.", "Some caveats in the statistics:", "To answer the question, I wouldn’t say people “graduate” from Python to C++. Personally, I use both, depending on the task. My main criterion isn’t performance, but library support (although the two are linked). If you’re processing a lot of point clouds, you’re probably going to use things like PCL and Octomap, which means C++. For image processing, you’re probably going to use OpenCV, which has bindings both for C++ and Python. Most high-level executive frameworks (such as ", " or one of the behavior tree frameworks) are written in Python. And for small helper nodes, one-off scripts, or anything involving web sockets or REST APIs, I also prefer Python.", "Here are the results:", "After the 2013 NASA Sample Return Robot Centennial Challenge I asked the teams about the software used. The results are on my ", ":", "The primary language was C++ whether the team used ROS or not. That was 7 of the 10 teams that provided information. Some python was used in conjunction with C++. One team that used a combination regretted, without further explanation, the python code in their system. (Please, no language war on that point. Just reporting…)", "The results were similar for the 2014 challenge but I didn’t formally record the results.", "I find this topic pretty interesting and starting from ", " work, I digged a bit more in.", "I made ", " (warning, I mostly executed everything on an ipython terminal by parts, so I may have missed something) to clone the repos (in github, I tried to clone also the ones in bitbucket but it fails on my machine for some unrelated reason) and to compute the LOC on them for C++ and Python.", "The output is:", "From 625 packages analysed", "\nThere are 413 packages using C++", "\nThere are 317 packages using Python", "\nAnd, actually, using both languages: 193", "\n88.8747413208 % is CPP code", "\n11.1252586792 % is Python code", "I also recreated the table with this LOC data:", "I think Python has it’s position on glueing things together, dealing with text, making apps and tools, and overall taking advantage of the big amount of third party libraries that ease doing stuff. If you need speed, C++ for sure. If you need something done quick, Python I’d say.", "Nice work, ", "! ", "I’ve digged a bit more, I was curious on what is Python doing in packages that have both Python and C++? (Updated the ", ").", "You can find a list of the Python filenames for every package that contains C++ & Python here: ", "My conclusion by looking at it, just with the filenames and the folder hierarchy (193 is too many packages to check them all 1 by 1, sorry!) with some grepping and some manual reading:", "*Haven’t checked if just in Python, or some kind of specific type of test is rather done in Python than C++, I personally do functional tests that way, as in, checking the topics/services/action servers do what they should, and I get the feeling it’s the same by the filenames I’ve glanced over (many ‘send’ ‘publish’ ‘pub’ ‘sub’ ).", "I hope someone else finds it interesting!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["The list only shows the major language used in a repo (winner takes it all). Often, ROS repos contain both C++ and Python (or other) code, but C++ wins by LOC, so smaller languages are underrepresented in the list below.", "I’m only counting repos, but the repos differ in size a lot. Some contain many packages with several 10,000 LOC, some are single-package repos with only a couple dozen LOC.", "People make tools using Python (commandline tools, filtering tools, debugging tools).", "People make tests* using Python (1059 files with test in the name/folderpath).", "People script things (duh) using Python (robot motions, if this then that, migration scripts, calibrations).", "People make demos using Python (28 files using the word demo).", "People make graphical stuff with Python (344 files/paths with rqt).", "People make fake stuff with Python (14 files with the word fake, as in fake_publisher, probably for testing/tutorial purposes).", "People provide examples in Python (93 files with the word example)."], "url": "https://discourse.ros.org/t/are-serious-things-done-with-ros-in-python/4359"},
{"title": "Submit an abstract today for Springer Book on ROS (Volume 4)", "thread_contents": ["SPRINGER BOOK", "\nROBOT OPERATING SYSTEM (ROS)", "\nTHE COMPLETE REFERENCE (VOLUME 4)", "Website: ", " 13", "Please follow the Guidelines for Editing the Book Chapter. Get the whole (ZIP Package)", "\nOBJECTIVES", "\nAfter the success of the Springer Book on ROS (Volume 1) with 27 chapters, Springer Book on ROS (Volume 2) with 19 chapters, and Springer Book on ROS (Volume 3), this is a fourth call for chapters for a Springer book on Robot Operating System (ROS) (Volume 4). The objective of the fourth volume is to provide the reader with comprehensive references on the Robot Operating System (ROS), which is currently considered as the main development framework for robotics applications.", "ROS (Robot Operating System) has been developed by Willow Garage and Stanford University as a part of STAIR project as a free and open-source robotic middleware for the large-scale development of complex robotic systems. ROS acts as a meta-operating system for robots as it provides hardware abstraction, low-level device control, inter-processes message-passing and package management. It also provides tools and libraries for obtaining, building, writing, and running code across multiple computers.", "The main advantage of ROS is that it allows manipulating sensor data of the robot as a labeled abstract data stream, called topic, without having to deal with hardware drivers. This book intends to fill the gap and to provide ROS users (academia and industry) with a comprehensive coverage on Robot Operating System concepts and applications. It will cover several topics ranging from basics and foundation to advanced research papers. Tutorial, survey and original research papers will be sought. The book will cover several areas related to robot development using ROS including but not limited to robot navigation, UAVs, arm manipulation, multi-robot communication protocols, Web and mobile interfaces using ROS, integration of new robotic platform to ROS, computer vision applications, development of service robots using ROS, development of new libraries and packages for ROS, using ROS in education, etc. Every book chapter should be accompanied with a working code to be put later in a common repository for the readers.", "EDITOR", "\nEditor:Anis Koubaa, Professor, PhD", "\nAffiliation:Prince Sultan University (Saudi Arabia)/CISTER Research Center (Portugal)/Gaitech Robotics (China)", "\nContact:akoubaa@psu.edu.sa", "\nBio:Anis Koubaa is a Professor in Computer Science in Prince Sultan University (Saudi Arabia), a Research Associate in CISTER Research Unit (Portugal), and consultant at Gaitech Robotics (China). He has been leading several research projects on robotics and Internet of Things, and in particular integartion of ROS into the IoT. He is the director of the Robotics and Internet of Things Unit (RIOTU) at Prince Sultan University. He is the chair of the ACM Chapter in Saudi Arabia amd a Senior Fellow of the Higher Education Academy (SF-HEA) from the United Kingdom. Prof. Anis is the editor of several books, and author and co-author of more than 160 publications. He is the Editor-in-Chief of the Robotics Software Engineering topic of the International Journal of Advanced Robotics Systems (IJARS). Prof. Anis contributed with the design and development of the first cloud-based system for controlling and monitoring of drones over the Internet, called Dronemap Planner. His h-index is 31.", "\nPUBLISHER AND INDEXING", "\nThis book is expected to be published by January of 2019 by Springer. It will appear under the Studies in Computational Intelligence series. For additional information and guidelines regarding the publisher, please visit ", "Regarding Indexing, the book will be indexed by Scopus and will be submitted for indexing to ISI Books, and DBLP.", "DUE DATES", "\nAbstract Submission: April 15, 2018", "\nFull Chapters Due: July 01, 2018", "\nChapter Acceptance Notification: September 01, 2018", "\nRevised Version Due Date: September 21, 2018", "\nRevised Chapter Acceptance Notification: November 01, 2018", "\nEstimated Publication Date: Januaray 2019", "\nTOPICS OF INTEREST", "\nAny contribution that provides an added value to Robot Operating System (ROS) is of interest for the book. The topics of interest include – but not limited to- the following:", "\nROS 2.0 Tutorials", "\nDeep Learning with ROS", "\nArtificial Intelligence with ROS", "\nROS Basics and Foundations", "\nRobot Control and Navigation", "\nSelf-driving cars using ROS", "\nArm Manipulation", "\nRobot Perception", "\nSecurity of ROS", "\nRobot Safety with ROS", "\nROS Integration to Web and Mobile apps", "\nReal-World Application Deployment using ROS", "\nUsing ROS in Higher Education", "\nContributed ROS Packages", "\nUnmanned Aerial Vehicles Control and Navigation", "\nSoftware Archiectures using ROS", "\nROS-enabled Robot Design", "\nThis volume welcome chapters about the upcoming version ROS 2.0, including tutorials, comparisong with ROS 1.0, new features in ROS 2.0.", "Also, papers related to using ROS for umanned aerial vehicles are particularly welcome.", "CHAPTERS CATEGORIES", "\nThe book will accept three categories of chapters:", "\nTutorial chapter: it focuses on a particular ROS concept or contributed package and provides a step-by-step tutorial that explains the fundamental of the concepts/packages and presents detailed guidelines on how to use the contributed code. It must specify the ROS versions that are compatible with the tutorial code, and must provide illustration with figures and code interpretations. The code must be available to public in a share repository (to be announced later). Accompanying Video tutorials are highly recommended.", "\nResearch chapter: it presents a research technical contribution in the robotics area where ROS was used to validate the findings. The chapter must presents a sufficient material on the technical contribution in addition to necessary theoretical background, but a major focus should be made to ROS implementation and experimentation. The implementation and experimentation must be sufficiently detailed for a reader be able to reproduce the experiments. It must specify the ROS versions that are compatible with the tutorial code, and must provide illustration with figures and code interpretations. The code must be available to public in a share repository (to be announced later). Accompanying Video tutorials are highly recommended.", "\nCase study chapter: a case study chapter should present a real-world experimentation with ROS on particular robotics platform. It should present a detailed description of observations made during experiments, and what are the challenges encountered during development and experimentation. The chapter should also highlight the best practices that would facilitate deployment and the lessons learnt.", "\nThis volume welcome chapters about the upcoming version ROS 2.0, including tutorials, comparisong with ROS 1.0, new features in ROS 2.0. Also, hot topics papers related to using ROS for umanned aerial vehicles and self-driving cars are particularly welcome.", "SUBMISSION PROCEDURE", "\nResearchers and practitioners are invited to submit a 1-3 page chapter proposal clearly explaining the mission and concerns of the proposed chapter. This helps as a registration of the chapter for the final submission. Submission of abstracts must be done through EasyChair system Authors of accepted proposals will be notified about the status of their proposals and sent chapter guidelines. Full chapters must be submitted by July 01, 2018 through EasyChair system. The Chapter should not exceed 50 pages with respect to Springer format. All submitted chapters will be reviewed on a single-blind review basis. Contributors may also be requested to serve as reviewers for this project.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/submit-an-abstract-today-for-springer-book-on-ros-volume-4/4468"},
{"title": "ROS1 2018 Version Survey: The results are in", "thread_contents": ["The results are in from the 2018 ROS user survey.  Thanks to everyone who participated!", "We had a total of 273 responses.  We’ll walk through the questions, one at a time:", "A majority of respondents are using the latest ROS LTS (Kinetic). There is still a fair amount of use of the previous LTS, then the long tail of respondents who use the non-LTS versions.", "Indigo seemed to be a particularly popular release, with Kinetic and “older” both being heavily used. One surprise here is that Jade had quite a few users in the past, which is a strong showing for a non-LTS release.", "Ubuntu usage dominates among respondents, and within Ubuntu, most users are using one of the last two LTS releases. Not shown in the chart are responses that only had one vote, like Fedora, CentOS, WIndows 10 with WSL, Debian unstable, etc.", "The OSs running on robots is also heavily dominated by the Ubuntu LTS distributions.", "The majority of users never upgrade to a non-LTS ROS distribution. Most of the ones that do update to a non-LTS do so because they need a specific update.", "Only a small minority of users never update to a ROS LTS release. As an LTS gets towards its first year of being available, more and more users are migrating to it.", "As pointed out in the discourse ", ", this question really needed a “Never/don’t care” option, but we didn’t want to change the survey halfway through. Instead, when we processed the data we discarded any responses from people who answered “Never” to the “When do you upgrade to a new ROS1 non-LTS distribution?” question. This left the above chart, which shows that of the people who do want a non-LTS, most of them are looking for 6-12 months of support on it.", "Almost half of the respondents would like to have a new LTS release every 2 years, which is consistent with the current release model. A somewhat smaller contingent wants an LTS every year, with a 4 year LTS release cycle rounding out the top 3.", "Again this question needed a “Never/don’t care” option. As in the “How often would you like to have a new ROS1 non-LTS distro (implying new features are released)?” question, we discarded the respondents who answered “Never” to the “When do you upgrade to a new ROS1 non-LTS distribution?” question. This left the above chart, which shows that of the people who do want a non-LTS, about half are happy with the current 1 year of support, while there is an even race between shortening supporting to 6 months and lengthening it to 2 years.", "Around 25% of respondents favored shortening the ROS LTS release cycle to 4 years, which would mean that the ROS LTS would go out of support before its corresponding Ubuntu LTS did. Of the rest, there was slight favor for lengthening the support cycle to 6 years (from the current support of 5 years).", "There isn’t a clear trend among respondents for features vs. stability. Some clearly favor stability, while some want newer versions of libraries.", "As with previous questions, respondents overwhelming prefer using the ROS LTS releases.", "Most users are using packages to get their dependencies, with a few outliers building everything from source.", "Over 50% of respondents update their packages at least once a month.", "Thanks to everyone who participated in the survey. We’re discussing the results and based on this data, will start a discussion about changing some aspects of the release process soon.", "Lots of interesting results!", "I think that this data supports moving to a Debian-style release model coupled with long-term support for the stable releases beyond “the next stable release” (e.g. support the past two stable releases). Looking forward to seeing that discussion started!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros1-2018-version-survey-the-results-are-in/4547"},
{"title": "ROS (cpp) on dockers", "thread_contents": ["Hi Guys,", "would be happy to get your take on this matter.", "I have a robot project built out of around 20 nodes and nodelets.", "\nIn this project I have 2 machines - one on the robot itself (Rpi3) and one as a base station (a strong PC) - all connected to the same ROS master.", "Now I would like to be able to do kind of a load balance so if I see that the CPU / mem on the robot is low, I would be able to kill the nodelet on the robot and run restart it on the base station.", "\nI thought of using Docker (specifically ResinIO) for this, but not sure this is the right way to go with it…", "\nAny suggestions on this? What are the pros and cons of running ROS on Docker?", "Thank you very much!", "\nGil", "Hi Gil,", "Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ", " provides a forum which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", "If you’d like you can reply with a link to your ", " question, but in the future please start there.", "Tully", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-cpp-on-dockers/4647"},
{"title": "About running catkin_make", "thread_contents": ["Hi.", "\nI copied a repository from github and when i try to build i get this error:", "How can i solve this?", "\nI know that the code is working, i saw it in the video of the person who shares it.", "\nSo something missing in my computer or i am doing something wrong.", "\nThanks…", "Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ", " provides a forum which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", "If you’d like you can reply with a link to your ", " question, but in the future please start there. And I’d strongly recommend that you include some more details about how to reproduce your issue. It looks like you are using incompatible versions of code so you’ll need to explain explicitly what versions of code your running on your system and in your workspace.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/about-running-catkin-make/4870"},
{"title": "How long after the release of a new version of ROS do most previous package come out?", "thread_contents": ["approximately how long after the release of a new version of ROS do previous packages come out?", "In particular, I’m waiting for the rosserial package for Melodic.", "i’m sure with melodic being so new i am going to come across this issue more so im debating switching back (i have downloaded and removed and redownloaded so many times this is the last thing i want to do).", "If you check: ", "You may see that most people move into a new release a year after it’s released. Others wait even more for the previous release to be end of life… and then the most ‘adventurous people’ move 6months after release.", "If you specifically need a package, you can always open an issue on the repo on github. When someone actually needs it, maintainers usually give it a bump (specially if there isn’t any update to do to the code to make it work in the new version). If you can check if it works compiling it from source, and you mention what works or what doesn’t, you’ll be helping also.", "Good luck!", "First of all, I believe this type of question is better suited for ", ". Discourse is more about announcements and discussion.", "Package releases can take arbitrarily long - this is the responsibility of the individual package maintainers. Your best chance is to open an issue at ", " and let the maintainers know that there is need for a melodic release. You can also monitor the release status page ", " for the release status of a particular package. As of now, there is no melodic release of rosserial, so it does not appear on the status page (yet).", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/how-long-after-the-release-of-a-new-version-of-ros-do-most-previous-package-come-out/4903"},
{"title": "Turtlebot_gazebo can not echo topic scan", "thread_contents": ["I am using Kinetic on Ubuntu 16.04 VM on windows 10. I was running the tutlebot_gazebo tutorial from the book “Programming Robots with ROS”. After launch the turtlebot_world,", "roslaunch turtlebot_gazebo turtlebot_world.launch", "when I ran", "rostopic echo scan", "gazebo crashed with the following message:", "gzserver:/build/orgre… virtual void Ogre::RenderSystem::setDepthBufferFor(Ogre::RenderTarget*): Assertion ‘bAttached &&\" a new depthBuffer for a renderTarget was created, but after creation\" “it says it’s incompible with that RT”’, failed.", "\nAborted (core dumped)", "Anyone knows how to fix this?", "Please post this question on ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/turtlebot-gazebo-can-not-echo-topic-scan/4955"},
{"title": "Ros-melodic projects", "thread_contents": ["Hi,", "\nI am new to ROS and I use bionic (melodic), after many projects I see most are for kinetic and can’t be used with melodic, can someone guide me to make a ros-melodic v-reps connection, like a drone or a robots ?", "\nregards", "\nHenri", "Hello,", "You don’t need a ROS-Vrep connection, it’s integrated in VREP by default now : ", "For example, launch a roscore, then launch vrep.sh, you should see these lines :", "Then put this Non-Threaded Lua script in any object (Cuboid for example)  :", "The chatter topic should be displayed in “rostopic list” and sending “Hello world” as a message (check with “rostopic echo /chatter”.", "There is also the example scene “rosInterfaceTopicPublisherAndSubscriber.ttt” given with V-rep that show image view, and the scene “controlTypeExamples.ttt” who show other type of Ros Interface", "And for melodic package, we need to wait for the maintainer for porting their packages, there is only a quarter of the package available yet : ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-melodic-projects/4991"},
{"title": "Roboteq and CANOpen", "thread_contents": ["Hello,", "I’m new to ROS and I’m trying to use a Roboteq compatible brushless controller with ros_canopen. Can_open_motor_node seems to have issue to read Roboteq eds file.", "\nDoes anyone have some experience with roboteq and ros_canopen ?", "Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ", " provides a forum which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", "If you’d like you can reply with a link to your ", " question, but in the future please start there.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/roboteq-and-canopen/4994"},
{"title": "Microbasic for Roboteq", "thread_contents": ["Hi everyone,", "\nIn roboteq_driver package of ROS they say:", "The node works by downloading a MicroBasic script to the driver, which then publishes ASCII sentences at 10Hz and 50Hz with the data corresponding to the Status and per-channel Feedback messages published by the driver.", "My question is where I can find this MicroBasic script", "The source of the script is here: ", "It is the binary version (.hex) that is loaded to the controller.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/microbasic-for-roboteq/5045"},
{"title": "Ros pointgrey camera fps limit", "thread_contents": ["Hello", "\nour pointgrey camera should deliver 60 fps @ 1280 x 1024 this is indeed if i use the flycapture program but if i try a record with ros then it always limits to 21 fps ? Is there any bug or workaround ?. It was also not possible to change the framerate with the tool rqt_reconfigure, the limit was just 21 fps.", "Best regards", "Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ", " provides a forum which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", "If you’d like you can reply with a link to your ", " question, but in the future please start there.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-pointgrey-camera-fps-limit/5083"},
{"title": "Packages.osrfoundation.org down?", "thread_contents": ["When grabbing the gazebo.key file, I get timeouts.", "It is down yes, problems with the infrastructure. I’ll post as soon as we get it back.", "\nSorry for the inconvenience.", "it should be back now. Any problem, please let us know.", " Could ", " be updated in such cases as well? Would be helpful, perhaps?", "This is still unreachable for me (from Europe).", "\nMaybe it’s just a matter of DNS records to propagate?", " is giving an IP address now (as in from just a few minutes ago). But the server serves a 403, ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/packages-osrfoundation-org-down/5090"},
{"title": "A little help with a robotics research project", "thread_contents": ["Hi Everyone,", "I’m working on a research project that is focused on gaining a high level understanding of the current state of robotics development, common tools that are used, and any pain-points that could (and should) be addressed.", "If you’re interested in participating in this research, please follow the link to a survey that I’m running: ", ".", "The survey should only take about 15-minutes of your time (if that).", "The first 100 people to take the survey will get a $25 ", " gift card and the second 100 people to take the survey (if we get that many people taking it) will get a $10 ", " gift card.", "We’ll also be sharing the results of the survey here for those that are interested.", "Thanks,", "\nBrett", "Just wanted to give everyone a heads up that the survey will be closing next Wednesday, 6/27, 11:59 p.m. PST.", "There are still a lot of the $25 gift cards available for taking the survey.", "Many thanks to those of you that have already taken it!!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/a-little-help-with-a-robotics-research-project/5118"},
{"title": "[TB3] TurtleBot3 AutoRace with Gazebo", "thread_contents": ["Hi everyone ", "\nI introduce the Gazebo environment and AutoRace packages for Gazebo.", "\nThis is a simulation of TurtleBot3 AutoRace R-BIZ Challenge 2017 competition in Korea.", "Many teams participated in this competition and showed high-level skills. The competition will be held this year.", "There are four missions.", "Challenge your AutoRace!!", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["Traffic light mission", "Parking mission", "Toll gate mission", "Tunnel mission"], "url": "https://discourse.ros.org/t/tb3-turtlebot3-autorace-with-gazebo/5261"},
{"title": "Ros2 topic and ros2 node command problem in MAC", "thread_contents": ["Hi", "I installed ROS2 on MAC and I run talker/listener application and both worked fine, but I found this warning (although it worked fine).", "Aniss-MacBook-Pro-3:~ akoubaa$ ros2 run demo_nodes_cpp listener", "\nFailed to load entry point ‘launch’: No module named ‘rclpy._rclpy’", "\nFailed to load entry point ‘echo’: No module named ‘rclpy._rclpy’", "\nHere is a screenshot", "\n", "Then, I tried the commands", "\nros2 node list", "\nand", "\nros2 topic list", "and here there was serious problem as shown in the following two pictures", "\n", "Is there any means to fix the problem?", "Thanks", "\nAnis", "ROS Course for Beginners", "\n", "Please ask questions on ", ", see: ", "Also, please do not post pictures of text.", "And please do not advertise in your signature. Making a post about a class or book is fine, but please do not include it in every post. It clutters conversations of which you’re a part.", "Thanks.", "Thanks and sorry for confusion!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros2-topic-and-ros2-node-command-problem-in-mac/5423"},
{"title": "Research about the battery in robots", "thread_contents": ["Dear community,", "We are researching on how to make robots programming more efficient and of a better quality. If you are into robot programming, specially drones, please help us by filling this survey. It takes no more than 3 minutes.", "Kind regards", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/research-about-the-battery-in-robots/5566"},
{"title": "Where to buy large-workspace haptic system?", "thread_contents": ["Hello all,", "\nI’m working on a project to control a robotic arm from a distance, using some haptic controller. But most of the haptic controllers are desktop versions with very small workspace.", "\nSo I’m wondering if anyone know where to get i.e. buy a haptic controller that has big (say ~1m cubed) workspace? Something like this one from DLR ", "Arif", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/where-to-buy-large-workspace-haptic-system/7632"},
{"title": "Call for chapters: Springer Book on ROS (Volume 5)", "thread_contents": ["Hello", "\nI am pleased to announce the call for chapters for the Springer Book on Robot Operating System (Volume 5) ", ".", "The four first volumes were quite successful and provided a great added value to the community. The previous volumes were in the top 25% most downloadable books in Springer, based on Springer annual analytics.", "All the volumes, including the coming fifth volume, are indexed in SCOPUS database.", "If you have good contributions on ROS, then this book is the best place to submit your work.", "\nThis year we have a special focus on the emerging ROS2, but submissions on ROS1 are still welcomed.", "For more details, please refer to", "\n", "Looking forward to receiving your submissions.", "Thanks", "\nAnis", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/call-for-chapters-springer-book-on-ros-volume-5/7715"},
{"title": "ROS live-class Create a Gazebo world for Cozmo", "thread_contents": ["Date & Time: February 12th, 2019 | 6pm to 7pm · CET", "Fee: Free", "Languages: English", "Registration website: ", "\nAbout:", "Let’s learn how to create a Gazebo world for Cozmo robot using SDF format. We will create an office desktop where Cozmo can move around and play with its cubes.", "By the end of this Live Class you will understand:     · What is the difference between the robot model and the simulation world model.     · How to use SDF to create a Gazebo simulation.     · How to include a robot in a Gazebo simulation.", "Robots used in this class:", "For this class we are going to use the Cozmo robot: by Anki. You can find more information about Cozmo robot here.", "Instructor:", "RICARDO TÉLLEZ, Ph.D.", "Ricardo has 7 years experience building software for ROS based robots including human size humanoids. He is the author of 4 books about learning ROS. I have teaches Robotics at the University of LaSalle for the undergraduate program and for the Master. Additionally, I have delivered every Tuesday to free ROS Live Class on his Youtube channel, where attendants can learn and practice to ROS subject. He is also the conductor of the ROS Developers Podcast where he interviews every week at ROS expert about how to better program robots with ROS.", "The whole code will be provided for free to all the attendants to the class as to ROSject, containing simulation, notebook with instructions and code.", "This is a LIVE Class on how to develop with ROS. In Live Classes, you will practice with the instructor at the same time, with the provided free ROS material.", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", "\n", "\n", "\n", "\n"], "url": "https://discourse.ros.org/t/ros-live-class-create-a-gazebo-world-for-cozmo/7765"},
{"title": "Visual Navigation in Robots - Bay area meetup 2/13/19", "thread_contents": ["The Bay area Computer Vision and Deep Learning meetup is having a meeting February 13 on “Visual Navigation in Robots”", "In our February meetup, sponsored by Intel, we’ll talk about navigation and robots. We’ll get to hear two different perspectives - one from the company who built a product and second from a company who supplied the chipset.", "Location:", "Intel-Santa Clara. SC-12 auditorium.", "\n3600 Juliette Lane, Santa Clara, CA", "Date: February 13, 2019", "\nTime: 6PM -845PM", "Wed, Feb 13, 2019, 6:00 PM: In our February meetup, sponsored by Intel, we’ll talk about navigation and robots. We’ll get to hear two different perspectives - one from the company who built a product", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/visual-navigation-in-robots-bay-area-meetup-2-13-19/7788"},
{"title": "ROSIN: submission deadline for proposals coming up (April 5. 2019)", "thread_contents": ["The EU H2020 ", " has the goal to advance open-source robot software for industry and the robotics community as a whole. One of the main activities of the project is a grant program with a total amount of ", " for Focused Technical Projects (FTPs) on ROS software development.", "Have a good idea for a ROS/ROS-Industrial related project? Want to work on ROS(-I) software components, documentation, standardisation or a related topic?", "If you or your company are located within the European Union, then submit an FTP proposal and apply for a ROSIN grant by following the steps outlined in the ", ".", "FTP proposals may be submitted all year long but are evaluated every three months.", "The next cut-off date is in about 2 months: ", " .", "Proposals are short and concise. Applicants are guided through the process by an application wizard along with a guide.", "To submit your FTP, please visit ", ".", "If you have any questions about the process, whether your idea or project would qualify, send me or one of my colleagues a message either through ROS Discourse or by email (see the ", " on the site for addresses). For 2019, we have planned 2 more cut-off dates (June 14. and September 13.).", "Hello, If we are located in Turkey, Istanbul, are we eligible for submitting an application?", "Yes Turkey is an eligible country.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/rosin-submission-deadline-for-proposals-coming-up-april-5-2019/7812"},
{"title": "Call for Chapters: Springer ROS Book Volume 5", "thread_contents": ["Hello", "\nI am pleased to announce the call for chapters for the Springer Book on Robot Operating System (Volume 5) ", ".", "The four first volumes were quite successful and provided a great added value to the community. The previous volumes were in the top 25% most downloadable books in Springer, based on Springer annual analytics.", "All the volumes, including the coming fifth volume, are indexed in SCOPUS database.", "If you have good contributions on ROS, then this book is the best place to submit your work.", "\nThis year we have a special focus on the emerging ROS2, but submissions on ROS1 are still welcomed.", "For more details, please refer to", "\n", "Looking forward to receiving your submissions.", "Thanks", "\nAnis", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/call-for-chapters-springer-ros-book-volume-5/7912"},
{"title": "Advice for organizing multi architecture ROS workspace", "thread_contents": ["Looking for the best way to do this.  It must be a common problem…", "My robot uses both ARM and Intel CPU and also both C++ and Python.  I have one ROS workspace for Intel and one for ARM.  If a node can be run on either machine type then I have to keep a copy of the source code in each workspace.   This is annoying because of the need to copy after every edit.", "My goal is to have one copy of the code in one workspace that is NFS mounted to all the computers.   I tried this but then every time I run catkin_make it compiles only for the architecture that ran catkin_make.  Is there a way to have two sets of binaries and maybe get rosrun to run the correct binary?", "I’m looking for suggestions, I don’t think I’d need a detailed howto.", "Thanks for your question. However we ask that you please ask questions on ", " following our support guidelines: ", "ROS Discourse is for news and general interest discussions. ", " provides a forum which can be filtered by tags to make sure the relevant people can find and/or answer the question, and not overload everyone with hundreds of posts.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/advice-for-organizing-multi-architecture-ros-workspace/8059"},
{"title": "BehaviorTree.CPP and Groot Version 3.0 released", "thread_contents": ["Hi ROS developers,", "I am please to announce a new major release (3.0) of BehaviorTree.CPP", "Behavior Trees Library in C++. Batteries included. - BehaviorTree/BehaviorTree.CPP", "You can find the documentation, including the Migration Guide for users of version 2.x) here:", "This new version greatly improve the ability of the user to create reusable Actions and to compose them in ", " behavior Trees without modifying the C++ code.", "Our ", " ", " has been updated accordingly (even if the new version should be considered a “beta”).", "Feedback, issue report and questions are really appreciated. Do no hesitate to contact me directly or (preferably) on Github.", "; it was impossible to add all the improvements we neeed without reconsider some design decisions, as explained in the ", ".", "For this reason, the package version 2.X will keep its name ", ", whilst this new version will co-exist for the time being under the new package name ", ".", "\nIn this way users can decide when migrate changing the name of the package in their list of  dependencies.", "Cheers", "Davide", "For this reason, the package version 2.X will keep its name ", " , whilst this new version will co-exist for the time being under the new package name ", " .", "\nIn this way users can decide when migrate changing the name of the package in their list of dependencies.", "We really need better management of package versions, or better advertising of what we have if it can solve this problem.", " I am all ears", "Packages that depend on the old version could specify it in their package.xml using: ", "Unfortunately, if two packages in a system require different versions, there will not be a good solution for both packages.", "I don’t know if BT is extended enough to consider this possibility, keeping in mind that people will end up switching to the new version sooner or later.", "I don’t have strongs opinions about this and the point made by ", " is 100%% correct.", "My instinct suggests that people SHOULD switch to V3, no matter what, but I was trying not to be an a**hole, breaking their compilation.", "People will shift, but then you’ll be stuck with the version number in the package name forever. ", " It’s a tricky situation. I wonder if ", " has any ideas.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/behaviortree-cpp-and-groot-version-3-0-released/8068"},
{"title": "Open Source Servo Controller", "thread_contents": ["Hello All,", "\nI was going through with different servo actuators available in the market.", "\nThere are some of very good open-source bldc servo-controllers available.", "There is 1 such project called ", "\nThis is a university project from UC, Berkeley and promise to make the servo actuator to be very affordable.", "I was trying to know more about this project, but was not able to get more than this research paper.", "\nDo anyone has more information about this or any other popular open-source servo-motor options.", "Saurabh", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/open-source-servo-controller/8460"},
{"title": "ROS Boston Users Group Meeting #6", "thread_contents": ["I’m happy to announce the sixth ROS Boston Users Group meeting. It will be held at Massrobotics on May 14th, 2019 from 7-9pm. More details and sign-up are available ", ".", "Hope to see you there!", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/ros-boston-users-group-meeting-6/8743"},
{"title": "Preparing for Lunar sync 2019-04-16", "thread_contents": ["Lunar Maintainers,", "Currently Lunar has ", " and ", " ready to sync. I plan to hold new releases for Lunar starting tomorrow, Apr 17, with a sync later in the week. Please reply here if there are any outstanding issues I should know about before performing the sync.", "The sync is ", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/preparing-for-lunar-sync-2019-04-16/8769"},
{"title": "Generalized framework for deploying neural nets in ROS", "thread_contents": ["One thing that has been increasingly annoying is that there is insanely good academic research in neural nets but 99% of the time the code is written in the most haphazard, undeployable fashion possible. Typically you have to clone some git repo, download some zip file of weights from a Dropbox, deal with grad students having used Windows case-insensitive filenames, put JPEGs in some directory with some file naming format, and run silly shell scripts like “run_inference.sh” rather than a nicely-built, deployable class that you can pip install and import into another project.", "Of course, as a PhD myself, I completely understand where the academics are coming from. Most of them are good at math, not software engineering.", "For production use though, one thing I’ve been thinking about is having a more generalizable neural net packaging framework where to switch from one neural net to the other, you only have to point your execution framework at a different package, and ", " to switch between one net and another.", "I’ve created this prototype:", "\n", "ROS package for semantic segmentation. Contribute to dheera/ros-semantic-segmentation development by creating an account on GitHub.", "\n", "\nwhich implements semantic segmentation ", " and ", " used. I’ve included a couple examples that are TensorFlow-based and one example that is PyTorch-based, and the only thing you have to do to switch between them is to change a single ROS parameter.", "I’d love feedback on this general concept or how we can propagate such a standard through the community. I’d also love for it to be generalized beyond semantic segmentation. Perhaps a hierarchy of classes, e.g. a NeuralNet class, a SemanticSegmentation class, ObjectDetection class, SpeechRecognition that inherit from the parent class, and so forth, where to implement a deployable, say, ObjectDetection class, all you have to do as the researcher is override the required methods, and you can do so using whatever code you wish. So for example, MaskRCNN overrides a couple of methods, inherits from InstanceSegmentation, which inherits from NeuralNet.", "Thanks for sharing! Looks great from my point of view (nice replacement for cv_bridge). I was doing similar exercise multiple times (NNs in ROS) and it would be great to have a community baseline.", "May be one thing. Neural networks output is not always image, usually it’s not. Not sure how to generalize though, we are using custom messages. As you mentioned, may be there should be some community supported NN classes that also will have own message formats. So far ROS community may be also provide end-to-end packages with pretrained models (e.g. based on keras-applications).", "Thanks, Roma", "Haha yep I had to steer clear of OpenCV since the cv2.so provided with ROS doesn’t support python3 … (can someone please do this for the next deb package release? It’s easy to compile OpenCV with both python2 and python3 bindings, the more bindings the merrier).", "Yeah actually I was kind of referring to two ideas – one is a generalized neural network hierarchy, where for each class it is defined exactly what the class should output, e.g. a SemanticSegmentation class should output a uint8 image or whatever. An ObjectDetection class would have a strictly defined format which all classes claiming to inherit from it should implement. Likewise for speech or any other network.", "The ROS semantic segmentation package I made was more a prototype of creating some kind of basic framework to swap between networks without needing to fiddle with grad-student-quality inference shell scripts – You can unzip a model, as if from an app store (or maybe I should make even that step not necessary – just drop a tarball and go) and the framework would know how to use them. If there was indeed a more generalized framework for all neural nets, then that package would restrict itself to classes that inherit from SemanticSegmentation.", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/generalized-framework-for-deploying-neural-nets-in-ros/9021"},
{"title": "Module for Machine Ethics ", "thread_contents": ["Hi,", "As a freelance witer I’m doing some research for an article about machine ethics. The article is to be published in the magazine ", ". Coming across this website I’m wondering whether the Robot Operating System has got something like an ethics module. Who can tell me? Any ideas about it?", "Rgds", "Matthias Lohrer", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/module-for-machine-ethics/9055"},
{"title": "Survey for ROS importance only 4 questions, I hope you have one minute to answer it! Thank you!", "thread_contents": ["I need some contribution from the ROS community to answer the following survey, I will use your answer to analyses the importance of ROS among the robotics systems", "\n", "Powered by ", ", best viewed with JavaScript enabled"], "url": "https://discourse.ros.org/t/survey-for-ros-importance-only-4-questions-i-hope-you-have-one-minute-to-answer-it-thank-you/9162"},
{"title": "Don't miss EU funding for ROS developments via ROSIN FTPs - Next cut-off dates: June 14 & Sept 13, 2019", "thread_contents": ["The EU H2020 ", " has the goal to advance open-source robot software for industry and the robotics community as a whole. One of the main activities of the project is a grant program with a total amount of ", " for Focused Technical Projects (FTPs) on ROS software development.", "Sofar, we have funded almost 40 FTP projects. Many (intermediate) results can be found here:", "\n", " Do you have a good idea for a ROS/ROS-Industrial related project and want to work on ROS(-I) software components, documentation, standardisation or a related topic?", " Are you or your company located within the European Union (or any of the ", ")?", " Then submit an FTP proposal and apply for a ROSIN grant by following the steps outlined in the ", ".", "FTP proposals may be submitted all year long but are evaluated 3-4 times a year.", "The next cut-off date are: ", " .", "Proposals are short (a few pages) and concise. Applicants are guided through the process by an application wizard and a guide is provided.", "To submit your FTP, please visit ", ".", "If you have any questions about the process, whether your idea or project would qualify, send me or one of my colleagues a message either through ROS Discourse or by email (see the ", " on the site for addresses).", " Too much text and no video?", "\n", " Watch our project coordinator explaining ROSIN project and it’s funding opportunities at last year’s ROSCon in less than 200 seconds", "\n          ", "\n", "or follow the 30 minutes presentation from ROS Industrial Conference (followed by four 15 minutes presentations of FTPs already funded by ROSIN):", "\n            ", "\n", "As a result of discussions at ROSCon2018, ROS-Industrial Conference 2018 and exchange of ideas in early 2019, we would like to solicit “", "” (or pre-baked FTPs) for upcoming ROSIN FTP calls in June and September. These suggestions shall give a focus on the topics we fund with our EU funding, but is not meant to not limit the scale and scope of future FTPs. Please check (upcoming) ", " from more than 38 ROSIN FTPs, to see what projects are in the pipeline or have been finished.", "\nWhich manipulator is suitable for a specific task? What is the ideal location of an object (e.g. to be polished) within a workcell for a given manipulator? Compare different solutions (in terms of computation time, energy consumption) for a specified task. Currently within MoveIt! it is possible to benchmark OMPL planners only ", "\nCurrently, mobile bases are approximated with floating joints within MoveIt! and it is not possible to execute these trajectories. Only other possibility is to plan for the arm (MoveIt!) and the mobile platform (navigation stack) separately. ", "\nAlthough FTP in similar direction has been approved (Move-RT): ", "\n(MoveIt!'s transition to ROS 2.0)", "\nMake MoveIt’s interfaces more generic which will simplify integration of standalone components (kinematics and collision checking). and also external planners (Descartes) and optimizers (TrajOpt).", "\nKinematicsBase API", "\n", "\n", "\nCollision checking API", "\n", "\nAllow for “partial” SRDF definitions to use arms with a combination of end-effectors / mount objects (tables, mobile base), similar to XACROs? Have a unified robot description (URDF, SDF, SRDF, COLLADA). Multiple formats introduces repetition of link names, etc.", "\nTiming and memory analysis tools for ROS nodes.", "\nAlthough some tools have been mentioned in the link: ", " ,", "\nit may not be the best solution for multi threaded, multiprocess applications", "\nEspecially, (most commonly used) Valgrind seems to be mainly for single-threaded applications and runs on VM, which distorts the actual results.", "\nA tool by OSRF (", ") has not been updated since 2014.", "\nHardware-in-the-loop / model-in-the-loop testing", "\nPackage versioning (possibly a REP)", "Kind reminder for the European ROS Community.", "\nOur next cut-off date is approaching.", "\nWe will be happy to evaluate all FTP proposals that are submitted before ", " end-of-day.", "\nNext cut-off is then on September 13, 2019 .", "Powered by ", ", best viewed with JavaScript enabled"], "thread_details": ["\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n"], "url": "https://discourse.ros.org/t/dont-miss-eu-funding-for-ros-developments-via-rosin-ftps-next-cut-off-dates-june-14-sept-13-2019/8999"}
]