[
{"url": "https://bitbucket.org/_Luc_/hand_control/pull-requests/2", "pr_title": "ajout performance", "username": "Paul Janin", "status": "Merged", "posted_on": "2015-03-30T12:26:33.540385+00:00", "pr_contents": "ajout performance", "pr_comments": []},
{"url": "https://bitbucket.org/acl-mit/rvo_path_planner/pull-requests/1", "pr_title": "Make the new branch standalone.", "username": "Shih-Yuan Liu", "status": "Merged", "posted_on": "2015-06-24T15:20:04.228513+00:00", "pr_contents": "Remove dependency on `acl_util` and `acl_msgs` for the `new` branch.", "pr_comments": []},
{"url": "https://bitbucket.org/AndyZe/pid/pull-requests/10", "pr_title": "setpoint_timeout parameter and functionality", "username": "Vikrant Shah", "status": "Merged", "posted_on": "2019-08-11T02:44:53.473660+00:00", "pr_contents": "Adding a parameter setpoint\\_timeout which specifies whether to keep publishing control\\_effort messages after setpoint messages stop coming in. -1 indicates, publish indefinately, positive number indicates the timeout in secs.", "pr_comments": ["needs to BE -1 or …", "Looks good. I only have one tiny grammatical comment, but it’s so minor I’m going to merge it anyway.\n\n‌\n\nThanks for a good contribution!"]},
{"url": "https://bitbucket.org/AndyZe/pid/pull-requests/8", "pr_title": "[pid] publish p,i,d debug topic", "username": "Thanuja Ambegoda", "status": "Merged", "posted_on": "2018-05-10T14:41:26.025518+00:00", "pr_contents": "Publishes a float64 vector containing the following 5 values that can be directly used in rqt_plot\r\n1. Actual error\r\n2. Control effort\r\n3. P term\r\n4. I term\r\n5. D term\r\nThe default topic name is \"pid_debug\"", "pr_comments": ["Thanks! Looks good."]},
{"url": "https://bitbucket.org/AndyZe/pid/pull-requests/7", "pr_title": "Modifications to address discontinous controller input - e.g., heading/yaw.  Adding two new parameters.", "username": "Brian Bingham", "status": "Merged", "posted_on": "2016-11-27T06:05:26.170805+00:00", "pr_contents": "Andy,\r\n\r\nI really like your general purpose PID node for ROS.  I'm developing some class material at NPS.  For one of the projects I was working up an example of heading/yaw control.  In using your code I found it challenging to implement yaw control due to the +/-pi discontinuity in yaw as an input to the PID controller.  \r\n\r\nI added a few lines of code to account for the control inputs with such discontinuities.  In the process I defined two additional ROS parameters:\r\n1) angle_error as a bool to determine if the plant_state has such a discontinuity\r\n2) angle_wrap as a double for use in accounting for the discontinuity.  (e.g., the parameter default is 2*pi for angular input in radians - could be set to 360 for input in degrees.)\r\n\r\nHere is an a wiki page on the way I'm using the node...\r\nhttps://wiki.nps.edu/display/RC/Kingfisher+Yaw+Control+1%3A+Yaw+control+using+the+ROS+PID+package+%28modified%29+and+Gazebo+ModelStates\r\n\r\nHope you will consider.\r\n\r\nBrian\r\n", "pr_comments": ["This is very cool - thanks! It should show up in the debian in a couple weeks to a month.", "Great - thank you.\n\nBrian\n"]},
{"url": "https://bitbucket.org/AndyZe/pid/pull-requests/6", "pr_title": "added ability to set name of topic that enable or disable pid", "username": "Łukasz Wielgosz", "status": "Merged", "posted_on": "2016-08-21T20:34:32.476959+00:00", "pr_contents": "I recently was in need to specify other than default topic for enabling or disabling pid controller, so i made this simple modification.", "pr_comments": ["Thank you! It seems very straight-forward and backwards compatible."]},
{"url": "https://bitbucket.org/AndyZe/pid/pull-requests/5", "pr_title": "minor updates to match documentation, & update diag status", "username": "Paul Bouchier", "status": "Merged", "posted_on": "2016-02-13T09:22:23.045386+00:00", "pr_contents": "Add launch/differential_drive_sim.launch. Removed de-emphasized parameters from examples. Set diag status to warn if control limits exceeded, & to error if loop is disabled", "pr_comments": []},
{"url": "https://bitbucket.org/AndyZe/pid/pull-requests/4", "pr_title": "remove rate, remnants of cli args", "username": "Paul Bouchier", "status": "Merged", "posted_on": "2016-02-04T15:25:36.463396+00:00", "pr_contents": "Also removed \"noisy\" print from setpoint node.\r\n\r\nTurns out rate wasn't used since controller publishes /control_effort every time it receives a new /state. The filter actually works off of delta_t, not rate, so it's fine.\r\n\r\nusage() still had command-line arguments, and wasn't relevant since it doesn't parse arguments anymore.", "pr_comments": []},
{"url": "https://bitbucket.org/AndyZe/pid/pull-requests/3", "pr_title": "add reverse_acting, fix bug in sim mode clock", "username": "Paul Bouchier", "status": "Merged", "posted_on": "2016-01-31T19:46:13.871114+00:00", "pr_contents": "I added a reverse_acting parameter, which inverts control_effort, for those actuators requiring opposite actuation to the sense of the input. This is hopefully a more direct and intuitive way than negating Kp, Ki & Kd (which is a technique I was unaware of).\r\n\r\nThe reason the derivative filter was going to nan was delta_t was 0 - thank for the pointer. The reason delta_t was 0 seems to be that the CPU was getting so overloaded distributing time at a rate of 250us per update that it was falling behind sometimes, and now and then the controller wouldn't get any time updates on /clock, which made the filter terms go to infinity. Running rqt_plot only made things worse. I fixed it by slowing the clock updates to 100Hz - same as the control loop rate, however this didn't completely eliminate clock loss. When I detect delta_t is zero I abort that frame.", "pr_comments": []},
{"url": "https://bitbucket.org/AndyZe/pid/pull-requests/2", "pr_title": "Parameter support, simulation timing", "username": "Paul Bouchier", "status": "Merged", "posted_on": "2016-01-28T11:38:22.031892+00:00", "pr_contents": "* refactor to use std_msgs Float64, 1st and 2nd order sim, config params\r\n\r\n* See CHANGELOG, get 2nd-order loop tuned\r\n\r\n* Add simulation-time support, pid disable/enable", "pr_comments": []},
{"url": "https://bitbucket.org/AndyZe/pid/pull-requests/1", "pr_title": "Add dynamic reconfigure for Kx, change plant setpoint", "username": "Paul Bouchier", "status": "Merged", "posted_on": "2015-12-26T04:10:42.005512+00:00", "pr_contents": "Hi Andy. Your PID module is just what I wanted for my robot. It's straight-forward and easy to use. I felt it would be improved if it had dynamic reconfigure of Kp, Ki & Kd to facilitate tuning the loop parameters. Also, the behavior of the plant and loop got a lot more interesting when I caused the setpoint to change periodically - it enabled playing with tuning parameters and watching the results on rqt_plot in a real-time manner. Is this an enhancement you're willing to merge into the upstream repo?\r\n\r\nAlso, did you announce this on the ros-users mailing list? Lack of a plain ol' pid has seemed like a deficiency to me.\r\n\r\nThanks\r\n\r\nPaul", "pr_comments": ["PS I'm happy to * add to the wiki documentation if you like this work. After all, code is nothing if no-one knows what it can do.", "This is cool! Thanks for introducing me to dynamic reconfigure. I'm going\nto make some minor changes to some of the comments, add you as a\ncontributor, and update the ROS package. Feel free to edit the wiki.\n\nYeah, I did announce it to ros-users nearly a year ago. Unfortunately an\nauthor of ros_control (an earlier PID package) kind of attacked it. That's\nalright. The wiki page still gets about 20 hits/day, so it's definitely\ngetting some use. I've actually had an Israeli student contact me about\nusing it on a drone.\n\nAndy", "Thanks for the reply Andy. I'd looked at ros_control but it's way complicated and honestly I don't understand it and the tutorials are fairly incomplete and all I want for my lawn-mowing robot is a plain ol' PID controller that I can instantiate for each wheel and for desired pose. By all means make it better - I'll pull before I request another pull from you.\n\nI've come to realize there's a design flaw in pid: setpoint should be a distinct input message, separate from plant state. Typically, setpoint comes from higher levels of the ROS stack, and at a different rate, whereas plant state comes from lower levels: e.g. the encoders. I would like to separate them out, if you're ok with that. I understand this is a breaking API change, but it's important to separate plant desired state from plant actual state. If you have objections or input please say so.\n\nI'm also adding a second-order simulator, which will make tuning in simulation more interesting. A first-order plant is too easy to tune: just crank up Kp as much as you want and add a bit of Ki. You don't even need Kd. The provided plant doesn't even need any Ki because it doesn't have a load.\n\nI do believe in proper wiki documentation.  You can see my efforts in http://wiki.ros.org/swiftnav_piksi, http://wiki.ros.org/razor_imu_9dof, and http://wiki.ros.org/rosserial_embeddedlinux among others.\n\nThanks\n\nPaul", "I can understand why having setpoint as a separate message would be more\nflexible. I will definitely approve those changes. You can send out an\nemail to ros-users about the changes when the next ROS update comes out,\ntoo (if you like--- you've been doing all the work).\n\nAndy"]},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/25", "pr_title": "Added getters for the joint state solution and error vectors", "username": "Tyler Kurtz", "status": "Merged", "posted_on": "2018-09-18T19:31:38.899365+00:00", "pr_contents": "Added an interface to get all of the joint state solutions. For my use case, I wanted to manipulate the entire set of solutions that the solver found without making multiple queries.", "pr_comments": ["Seems reasonable."]},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/24", "pr_title": "Fix installation of the package", "username": "Sam Pfeiffer", "status": "Merged", "posted_on": "2018-02-06T02:18:53.180261+00:00", "pr_contents": "Initially _trac_ik_wrap.so was being installed in WORKSPACE/lib instead of WORKSPACE/lib/python2.7/dist-packages/trac_ik_python, so thats been removed.\r\n\r\nAlso specific rules to install the package files are set.\r\n\r\nI'm far from an expert in CMake and this package is such a special case that I don't know if I did well. But it works as far as I've tried (sourcing from a devel environment allows to use the library, also sourcing from a install environment allows to use the library too, I havent generated a debian to simulate that cause I don't know how to get that far).", "pr_comments": ["`trac_ik` instalation using `sudo apt-get install ros-indigo-trac-ik` seems broken for python package. I also tried to update it using `sudo apt-get install --reinstall ros-indigo-trac-ik` but it didn't work. I am getting the issue `from trac_ik_python.trac_ik import IK`.  \nPlease see below-\n```\nravi@home:~$ python\nPython 2.7.6 (default, Nov 23 2017, 15:49:48) \n[GCC 4.8.4] on linux2\nType \"help\", \"copyright\", \"credits\" or \"license\" for more information.\n>>> from trac_ik_python.trac_ik import IK\nTraceback (most recent call last):\n  File \"<stdin>\", line 1, in <module>\n  File \"/opt/ros/indigo/lib/python2.7/dist-packages/trac_ik_python/trac_ik.py\", line 6, in <module>\n    from trac_ik_python.trac_ik_wrap import TRAC_IK\nImportError: No module named trac_ik_wrap\n>>> \n```\nI tried to see inside the directory and found few setup files as shown below-\n```\nravi@home:~$ ll /opt/ros/indigo/lib/python2.7/dist-packages/trac_ik_python/total 36\ndrwxr-xr-x   2 root root  4096 Jun  7 00:58 ./\ndrwxr-xr-x 140 root root 12288 Jun  6 21:38 ../\n-rw-r--r--   1 root root     0 Jan 12 08:21 __init__.py\n-rw-r--r--   1 root root   157 Mar 18 00:23 __init__.pyc\n-rw-r--r--   1 root root  4489 Jan 12 08:21 trac_ik.py\n-rw-r--r--   1 root root  4442 Mar 18 00:23 trac_ik.pyc\n```\nI am able to find out `_trac_ik_wrap.so`. See below-\n```\nravi@home:~$ locate _trac_ik_wrap.so\n/opt/ros/indigo/lib/_trac_ik_wrap.so\n```\nPlease note that I am operating Baxter robot in ROS Indigo on Ubuntu 14.04 LTS 64 Bit PC.\n\nOne workaround might be installing `trac_ik` from the source. I haven't tried it yet. Any comments, please?"]},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/23", "pr_title": "use URDF types rather the hardcoding boost types", "username": "mikaelarguedas", "status": "Merged", "posted_on": "2018-01-21T07:16:17.461118+00:00", "pr_contents": "URDF uses STL types rather than boost types since version 1.0.0.\r\n\r\nThis PR changes the joint declarations to use the URDF defined pointer types instead of assuming `boost::shared_ptr`. This fixes the builds on Debian Stretch and will also work for Ubuntu Zesty and later", "pr_comments": ["Thanks. I had made this fix in the main trac-IK code but didn’t see it in\nthe python code. I don’t use the python code and only pulled it into my\nrepo after a PR from the author. It has been way more hassle than I ever\nexpected."]},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/21", "pr_title": "Add Python wrapper based on SWIG", "username": "Sam Pfeiffer", "status": "Merged", "posted_on": "2018-01-05T05:52:24.987059+00:00", "pr_contents": "Here we go again, cleaned up the URDF I added last time. Also added some extra methods that can be useful in the Python wrapper (getting and setting joint limits).", "pr_comments": ["Is this file necessary?", "Yeah, it's how Python interprets that in that folder there is source code to import from. (https://stackoverflow.com/questions/448271/what-is-init-py-for)", "In order to easily run bloom to release the debs, I keep a single release for all the the trac_ik packages.  Bloom requires these all have the same version number, so I'll need to change the version number of the python plugin to 1.4.9 with all the others to release.  Any problems with this?", "No problem at all", "FYI, I had to fix the CMake file.  See [commit](https://bitbucket.org/traclabs/trac_ik/commits/a23ef6647a0310013646d98087ed066341c20fbf)", "Oopsie, thank you! I saw the build failure and was wondering what was going on."]},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/22", "pr_title": "Use the new API to query params from correct namespaces.", "username": "Ryan Keating", "status": "Merged", "posted_on": "2018-01-05T19:56:03.889492+00:00", "pr_contents": "For more information, see  [MoveIt Issue 701](https://github.com/ros-planning/moveit/pull/701) and [MoveIt Issue 714](https://github.com/ros-planning/moveit/pull/714).", "pr_comments": []},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/14", "pr_title": "Added setKDLLimits", "username": "Alessandro Roncone", "status": "Merged", "posted_on": "2016-08-26T15:45:15.551097+00:00", "pr_contents": "Fixes #29. Added method to manually set KDL limits. Useful when dealing with custom-defined non-linearities that affect the joint bounds.", "pr_comments": ["I do not believe this is sufficient.\n\nCan you please try adding the following to your setKDLLimits?  The re-test and comment?\n\n```\n#!C++\nbool setKDLLimits(KDL::JntArray& lb_, KDL::JntArray& ub_) {\n      lb=lb_;\n      ub=ub_;\n     nl_solver.reset(new NLOPT_IK::NLOPT_IK(chain,lb,ub,maxtime,eps,NLOPT_IK::SumSq));\n     iksolver.reset(new KDL::ChainIkSolverPos_TL(chain,lb,ub,maxtime,eps,true,true));\n     return true;\n}\n```\n\n", "@pbeeson sorry for the late reply. I implemented the change requested and I can confirm that it works. \n\n\nI was setting new KDL Limits at the very beginning of my code, and that may be the reason for which the code was working without any problem (i.e. there was no reason to reset the solvers)."]},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/18", "pr_title": "avoid copy and paste", "username": "Davide Faconti", "status": "Merged", "posted_on": "2017-11-07T15:51:36.099108+00:00", "pr_contents": "Copy and Paste is the root of all evil :wink:", "pr_comments": ["Sorry, I accidentally included a change in ik\\_tests.cpp.\n\nPlease discard it if you think it is not relevant for you.", "Have you validated that this change works and doesn't affect timing?", "If there is any difference in the execution speed, I haven't learnt anything about templates in 10 years :wink:\n\nSeriously though, if you are very concerned about performance and benchmark, I suggest you to use a benchmarking library such as this one [https://github.com/libnonius/nonius](https://github.com/libnonius/nonius)\n\nI will send you a pull request that refactor tests to use nonius.\n\n‌", "You didn’t actually answer my question.  I’m busy with 3 other projects right now, and I’m willing to accept this pull request because it seems simple enough.  But I don’t have time to fully validate it myself.  I simply want to make sure that you’ve actually been using this modification— and at least ran the example code before/after and see the same results.  Hundred if not thousands of people use this package, so at this point I need to be very careful about changes, even when they seem trivial.  I’ve been burned in the past with people submitting changes that they never actually tested.", "Just benchmarked. No measurable difference on PR2, at least on my machine :smiley: ", "That said, I can make time later to run my suite of tests and would be interested in a better benchmarking routine, but right now I simply can’t make time to dive into this.", "This PR is just a little bit pedantic and doesn't bring any functional improvement, really.\n\nIf you have even the slightest doubt, do not merge it \\(but consider keeping the PR open for the time being\\).", "Thanks.  I'll merge this, but I'm going to keep the example statistics like they were, as I had some reason in the past for them to include failures."]},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/17", "pr_title": "Move kinematics plugin class declaration to header file", "username": "Mark Moll", "status": "Merged", "posted_on": "2017-09-17T19:32:36.775011+00:00", "pr_contents": "This is necessary for an IK caching wrapper I have written for moveit. See https://github.com/ros-planning/moveit/pull/612.", "pr_comments": []},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/4", "pr_title": "Minor README change", "username": "former author", "status": "Merged", "posted_on": "2016-01-12T05:12:11.317933+00:00", "pr_contents": "Corrected chain class from \"Frame\" to \"Chain\" in constructors", "pr_comments": ["Thanks!"]},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/6", "pr_title": "Add Clang compiler support", "username": "former author", "status": "Merged", "posted_on": "2016-02-06T00:17:07.421427+00:00", "pr_contents": "I'm using clang compiler to build my packages, and after I updated the trac_ik repository, I've started to have problems with building the C++0x source codes. So I'm adding the test for clang compiler.", "pr_comments": []},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/8", "pr_title": "Add warning for wrong solve_type, issue #19", "username": "former author", "status": "Merged", "posted_on": "2016-02-25T13:51:38.544190+00:00", "pr_contents": "I read the issue #19 and I thought that it would be a useful feature, to warn the user about a nonexistent/misspelled solve_type in kinematics.yaml.", "pr_comments": []},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/7", "pr_title": "Add isnan function.", "username": "Maarten de Vries", "status": "Merged", "posted_on": "2016-02-25T12:50:14.098008+00:00", "pr_contents": "A recent system update made `trac_ik_lib/src/nlopt_ik.cpp` fail to compile due to the non-existence of `isnan`.\r\n\r\nI assume it was pulled in indirectly from `<math.h>`. However, including C headers directly is not the most elegant thing to do, and it can cause strange problems when certain macros are imported into the global namespace.\r\n\r\nThe alternative `#include <cmath>` only contains `std::isnan` since C++11 [1], so unless the project already requires C++11 it seems a stupid thing to add a C++11 requirement for (I didn't check, if it does, `std::isnan` would be the best option).\r\n\r\nInstead I opted to implement `bool isNan()` for floats and doubles. I did not call it `isnan` in case `<math.h>` is still pulled in on some systems, since `isnan` is allowed to be a macro [2] (which would break the function definition horribly if it used the same name).\r\n\r\nI put the two functions in an anonymous namespace to prevent any possibility of (future) linking errors.\r\n\r\n* [1] http://en.cppreference.com/w/cpp/numeric/math/isnan\r\n* [2] http://en.cppreference.com/w/c/numeric/math/isnan", "pr_comments": ["Ah, thanks. I knew I should have checked. I'll update the PR to use `std::isnan` then.", "Updated to instead include `<cmath>` and use `std::isnan`."]},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/11", "pr_title": "removed some copy and paste", "username": "Davide Faconti", "status": "Merged", "posted_on": "2016-07-22T10:04:36.753286+00:00", "pr_contents": "I believe that this change makes the code a little more \"terse\".\r\nIt shouldn't add any measurable overhead.", "pr_comments": []},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/10", "pr_title": "Fix formatting breakage - need line break", "username": "Dave Coleman", "status": "Merged", "posted_on": "2016-06-15T17:42:13.859749+00:00", "pr_contents": "Fix formatting breakage - need line break", "pr_comments": ["Thanks!  I can't do anything right today."]},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/9", "pr_title": "Cleanup of build scripts and package manifests.", "username": "gavanderhoorn", "status": "Merged", "posted_on": "2016-06-08T12:43:30.421277+00:00", "pr_contents": "As per subject.\r\n\r\nEspecially `trac_ik_lib` didn't specify and search for all its dependencies, which will probably break the build when this gets build on the ROS buildfarm (or any system which doesn't already have a `desktop*` install of ROS).\r\n\r\nAlso reformatted and simplified some minor things.\r\n", "pr_comments": []},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/5", "pr_title": "Include missing header for scoped_ptr.", "username": "Maarten de Vries", "status": "Merged", "posted_on": "2016-02-03T12:08:20.393502+00:00", "pr_contents": "Compilation failed on archlinux with boost 1.60 because of a missing `#include <boost/scoper_ptr.hpp>`. This PR adds the include.", "pr_comments": []},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/3", "pr_title": "Develop", "username": "Patrick Beeson", "status": "Merged", "posted_on": "2015-12-10T16:48:18.939251+00:00", "pr_contents": "* More initialization output in MoveIt! plugin\r\n\r\n* Fixed potential issues with large bound joints searching too large of a space\r\n\r\n* Fixed bug where TRAC-IK multisolution modes weren't using the computed random seeds, but were using the same seed over and over.", "pr_comments": []},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/2", "pr_title": "README small corrections and formatting", "username": "Dave Coleman", "status": "Merged", "posted_on": "2015-11-17T07:25:44.811902+00:00", "pr_contents": "* Adds/fixes bullet points in both READMEs\r\n* Spelling fix\r\n* Remove redundant instructions for libnlopt-dev to make bullet point reading more clear ", "pr_comments": []},
{"url": "https://bitbucket.org/udg_cirs/cola2_core/pull-requests/3", "pr_title": "Added comments for generating documentation", "username": "Iqua Robotics", "status": "Merged", "posted_on": "2017-09-28T08:20:58.134141+00:00", "pr_contents": "", "pr_comments": []},
{"url": "https://bitbucket.org/udg_cirs/cola2_core/pull-requests/1", "pr_title": "New services to load Trajectories", "username": "Sparus CMRE", "status": "Merged", "posted_on": "2016-02-29T17:39:47.252810+00:00", "pr_contents": "* Added two load trajectories services.\r\n\r\n    Added the load_trajectory_str and load_trajectory_config. First method load from\r\n    a string with the format of the file and load_trajectory_config load the mision from the rosserver param.\r\n\r\n* Added two load trajectories services.\r\n\r\n    Added the load_trajectory_str and load_trajectory_config. First method load from\r\n    a string with the format of the file and load_trajectory_config load the mision from the rosserver param.\r\n\r\n* Commented some lines\r\n\r\n* Added two load trajectories services.\r\n\r\n    Added the load_trajectory_str and load_trajectory_config. First method load from\r\n    a string with the format of the file and load_trajectory_config load the mision from the rosserver param.\r\n\r\n* Added two load trajectories services.\r\n\r\n    Added the load_trajectory_str and load_trajectory_config. First method load from\r\n    a string with the format of the file and load_trajectory_config load the mision from the rosserver param.\r\n\r\n* Commented some lines", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_base/pull-requests/16", "pr_title": "Dev/tcp matcher", "username": "Isaac Vandor", "status": "Merged", "posted_on": "2019-12-11T15:40:14.410887+00:00", "pr_contents": "* Adding matcher function capability for tcp client connections\r\n* Updated tcp async\\_read\\_until and changed passthrough matcher function\r\n* Fixing some output msgs\r\n\r\n‌", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_base/pull-requests/14", "pr_title": "Feature/tcp", "username": "Ian Vaughn", "status": "Merged", "posted_on": "2019-08-30T17:45:38.192526+00:00", "pr_contents": "* TCP Client support with link timeout / reconnect semantics\r\n* ROSRAW passthrough to present replayed ds\\_core\\_msgs::RawData messages to callbacks as if it were fresh data\r\n* Option to disable publishing on the raw topic \\(don’t worry, default is to publish raw\\)\r\n* Super-useful CONNECTION\\_TYPES.md document that summarizes connection types and their options. Still needs the standard matcher functions added.\r\n\r\nThis has all been tested using a Phins C3 as both a TCP server and example data stream for the ROSRAW stuff.", "pr_comments": ["Is there a reason that it’s not just “TCP”, to match “UDP”?", "HALLELUJAH!!!", "Ooooh. Also psyched for this one :slight_smile:", "This seems more likely to cause confusion with two nodes publishing the same data to the same topic.\n\nAbsent a use case, I’d be tempted to leave it off \\(or make it optional\\) – I’m assuming that it makes the ds\\_raw\\_console less readable?", "Yes! We’re leaving room for TCPSERVER.\n\nThere’s a standard design pattern for serial devices that got networkified where they implement:\n\n* UDP with varying levels of server / client / double-endedness-- we pick one, but UDP “server” is a debatable concept\n* TCP Server\n* TCP Client\n* Crazy custom stuff with more features at the cost of more work \\(e.g., Moxa’s RealCom mode\\)\n* Sometimes serial shows up in the same menu\n\nThis pull request gets us all except server.", "Yeah, I was wondering about that.  But this provides a simple way to write a node that mocks a sensor’s serial or network interface that you can run in rostest, so I left it in."]},
{"url": "https://bitbucket.org/whoidsl/ds_base/pull-requests/12", "pr_title": "Dvl matcher function bugfix", "username": "Jennifer Vaccaro", "status": "Merged", "posted_on": "2019-08-02T13:13:44.809254+00:00", "pr_contents": "* Added a header\\_read\\_length matcher function for use with several dvls. Should generalize the existing pd0 matcher function, and allow for other datagrams to be used on the RDI Workhorse DVL\r\n* Unit-tested with header\r\n* Fixed an error message, but will remove all error messages later\r\n* Added an example read\\_header\\_length launch node\r\n* Removed matcher\\_function error messages after successful instrument testing with the Pioneer DVL", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_base/pull-requests/11", "pr_title": "Adding error message if iosm callback ever reports bad data", "username": "Laura Lindzey", "status": "Merged", "posted_on": "2019-07-25T02:16:55.982748+00:00", "pr_contents": "Hi Ian,\r\n\r\nI’m excited for our new ability to deal with synchronization issues!\r\n\r\nI’m not positive that this is the right place to issue a warning when one is detected, but that seems like a good idea in general, so I figured I’d go ahead and submit a PR rather than opening an issue …", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_base/pull-requests/10", "pr_title": "Added a package for some utility nodes, including a ds_connection spitter, logger, and repeater node with some useful parameters. Testing was entirely functional, not with unit tests.", "username": "Jennifer Vaccaro", "status": "Merged", "posted_on": "2019-07-16T20:46:04.994788+00:00", "pr_contents": "Created a package with a few useful utility debugging nodes built on ds\\_connection.\r\n\r\n“spitter“ publishes a message at a given interval on a ds\\_connection\r\n\r\n“repeater“ receives a message on one ds\\_connection and sends it on a second \\(can be reciprocal\\)\r\n\r\n“logger“ appends all incoming traffic on a ds\\_connection to a log file.\r\n\r\nTested by spinning up nodes and confirming traffic propogates as expected. Super helpful utilities for debugging.", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_base/pull-requests/8", "pr_title": "Added support for multicast receiver, but doesn't allow for sending", "username": "Jennifer Vaccaro", "status": "Merged", "posted_on": "2019-07-08T21:21:11.896298+00:00", "pr_contents": "Added multicast support to ds\\_asio, which only allows for receiving \\(no sending\\)  \r\nChecks IP address for multicast range, and if so, creates a multicast connection instead of a normal udp socket. Tested successfully with a multicast spitter program.  \r\nOnly file change is in ds\\_asio/src/ds\\_udp.cpp\r\n\r\n‌\r\n\r\nAfter feedback, added a code cleanup to bring up sockets once correctly.", "pr_comments": ["This seems to be along the right track, but can we clean this up a bit?  Maybe move some of the socket manipulation further up where the RX stuff gets set?\n\nI’d rather we had something clean than a minimal change set.  Opening sockets only to close and reopen them shouldn’t be necessary; its just confusing.", "Agree, we shouldn’t be closing and reopening the socket. The socket should originally be open in the right mode.", "Ok, made another commit that seems a bit cleaner to me.", "Bitbucket shows this commit as a conflict that must be resolved manually: **Conflict: File modified in both source and destination**\n\nTo be able to merge you will need to resolve the conflicts manually.", "Yeah, I merged your other pull request.  You may need to switch into this pull request’s branch and do a pull from master.  Let me know if you have any trouble.", "Ok ok did the thing and I’m merging now, unless you have other concerns?", "Nice, that looks much cleaner.  Merge, but testing required etc etc."]},
{"url": "https://bitbucket.org/whoidsl/ds_base/pull-requests/9", "pr_title": "Added buffer size parameter capability to ds_udp", "username": "Jennifer Vaccaro", "status": "Merged", "posted_on": "2019-07-08T22:44:36.508406+00:00", "pr_contents": "Changed the buffer underlying container from a boost::array to a std::vector. Added an optional parameter buffer\\_size to a ds\\_udp connection which defaults to 512. This will allow for the much larger buffer sizes needed for the Kongsberg EM2040 kmall datagrams. Tested by running a ds\\_udp connection \\(the rdidvl driver\\).  \r\n  \r\nChanges in ds\\_udp.cpp and ds\\_udp.h", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_base/pull-requests/7", "pr_title": "Feature/mutex scoping", "username": "Laura Lindzey", "status": "Merged", "posted_on": "2019-06-25T17:54:17.897999+00:00", "pr_contents": "Hi Ian,\r\n\r\nHere’s what I’ve done to make it possible to modify the IoSM’s queues from within a dataCallback. \\(issue: [https://vast-gitlab.whoi.edu/ivaughn/sentry-issues/issues/7](https://vast-gitlab.whoi.edu/ivaughn/sentry-issues/issues/7)\\)\r\n\r\nDO NOT MERGE YET – I’m putting this out for discussion. If we want to go this way, there are a few outstanding TODOs:\r\n\r\n*  we still need to test on the vehicle\r\n* I have a test node \\(not yet automated\\) that demonstrates changing the queues in a callback. I don’t want to spend the time to automate it if this is a bad idea for other reasons.\r\n\r\n\\(This branch includes changes from PR #6, so definitely merge that first!\\)\r\n\r\n* Removing unused isShutdownCommand member variable in the IoSM.\r\n* Made the mutex protecting the ds\\_iosm queues more tightly scoped.", "pr_comments": ["This is a pretty significant change in locking semantics.  The original intent was the the individual calls to addRegularCommand, deleteRegularCommand, etc were atomic.  I’m not sure all the invariants will hold when we change that, although I don’t _think_ there are any major issues with these changes. \n\nPresumably there are more pull requests coming, but its also not clear how this helps resolve the underlying issue. ", "Trying to address Ian’s comments from below:\n\n> its also not clear how this helps resolve the underlying issue.\n\nIn the current IoSM implementation, a single mutex protects both the queue data structures and the process\\_event queue. This is more restrictive than necessary, and makes it impossible for an action within the state machine to call `addRegularCommand`/ `deleteRegularCommand`.\n\nThe new version splits that into two mutexes:\n\n* the queues have a simple std::mutex, since adding and removing commands from them is neither reentrant nor thread safe.\n* boost::msm’s process\\_event function is reentrant but not thread safe, so that is protected by a std::recursive\\_mutex. This makes it possible for events to spawn other events, and for an event to modify the queues.\n\n> This is a pretty significant change in locking semantics.\n\nYes. As we discussed in-person, it changes some things, but I don’t think any of them are significant issues:\n\n* It is not guaranteed that calls to `process_event(StartCommand)` will immediately follow a change to the queue. However, since it will always eventually be called, this is fine.\n* Any programs that are modifying queues that involve commands with `forceNext=true` need to be robust to the second half of the command not being called as the set is being deleted. This isn't new \\(it was also the case when queues could only be modified by ROS callbacks\\), but it is something to be aware of if/when we write nodes that make use of this new flexibility to modify queues.\n\nWere there any changes that you could think of?", "Two more notes:\n\n* This might be a good time to create an integration branch, and merge all our changes into that for well testing, rather than merging these into master.\n* I ran`catkin_make run_tests,`and all the automated tests pass.\n\n", "Out of curiosity, what’s the advantage to:\n\n```\n{\n  std::lock_guard<std::mutex> lock(some_mutex);\n  // do stuff\n} // lock goes out of scope and gets unlocked on destruction\n// do more stuff\n```\n\nvs.\n\n```\nstd::unique_lock<std::mutex> lock;\n// do stuff\nlock.unlock();\n// do more stuff\n```\n\nI see how std::lock\\_guard clearly communicates a mutex lock that’s not supposed to be unlocked by the user, but if that’s the goal what’s the advantage to adding a bunch of indents?", "1. That’s at least partly due to the path-dependence of refactoring :slight_smile:\n2. I don't know what's idiomatic in c\\+\\+; I was going for whatever the equivalent of `with resource: # do stuff`. I like that the structure of the code conveys the logical structure of what’s locked where.\n\n"]},
{"url": "https://bitbucket.org/whoidsl/ds_base/pull-requests/6", "pr_title": "Removing unused isShutdownCommand member variable in the IoSM.", "username": "Laura Lindzey", "status": "Merged", "posted_on": "2019-06-25T16:52:53.283054+00:00", "pr_contents": "Hi Ian,\r\n\r\nThis should be an easy one – just more minor cleanup I found while reading ds\\_iosm.", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_base/pull-requests/5", "pr_title": "Feature/minor cleanup", "username": "Laura Lindzey", "status": "Merged", "posted_on": "2019-06-19T19:08:22.996063+00:00", "pr_contents": "Ian,\r\n\r\nI’m working on adding the calibration feature to the servo driver, and wound up reading through ds\\_iosm. None of these changes affect functionality – as the title says, it’s just minor cleanup of spelling/comments/dead code.\r\n\r\nI wasn’t sure what branch you were planning to use for the summer tests/qualification. Feel free to change the merge target!\r\n\r\n-Laura\r\n\r\n‌\r\n\r\nSummary of changes:\r\n\r\n* fixing typos; minor documentation clarification\r\n* Removing unused \\(commented-out\\) code.\r\n\r\n    I think we're happy with DsSerial's matcher function at this point and don't need to keep around the older versions.\r\n\r\n\r\n* Removing declaration of un-implemented functions\r\n* Removing unused/unimplemented function calls\r\n\r\n    It looks like the timeoutLog option was never implemented, but timeoutWarn exists and is used. Since no existing nodes use this, it seems reasonable to just remove it.", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_base/pull-requests/4", "pr_title": "Removed DsNodeHandle.", "username": "zac berkowitz", "status": "Merged", "posted_on": "2018-02-12T22:27:41.207096+00:00", "pr_contents": "This PR removes the DsNodeHandle class.\r\n\r\n‌\r\n\r\nOriginally, DsNodeHandle used ros::NodeHandle as a base class to serve the following purposes:\r\n\r\n* Provide easy methods to add serial, udp, and other asio-related connections\r\n* Pair the DsCallbackQueue with the node handle to spin asio's event loop for IO connections\r\n* Enforce the requirement that asio connections require a DsCallbackQueue to operate.\r\n\r\n‌\r\n\r\nHowever, ros::NodeHandle does not have a virtual destructor, which is problematic when someone tries to free up a DsNodeHandle using a pointer to the underlying base class.  You can see this yourself with the following code:\r\n\r\n‌\r\n\r\n```c++\r\n#include \"ds_base/ds_process.h\"\r\n#include <ros/ros.h>\r\n#include <memory>\r\n\r\nusing namespace ds_base;\r\n\r\nint main(int argc, char* argv[])\r\n{\r\n  ros::init(argc, argv, \"test\");\r\n  auto process = std::unique_ptr<DsProcess>(new DsProcess);\r\n\r\n  // Create some publishers\r\n  process->setup();\r\n  \r\n  // Calling the destructor here will cause a segfault when the internal\r\n  // DsNodeHandle is free'd\r\n  process.reset();\r\n\r\n  return 0;\r\n}\r\n```\r\n\r\n‌\r\n\r\nThis means anything that has a DsNodeHandle will cause segfaults when cleaned up.   This is just bad in general, but we haven't caught it yet because we don't generally delete DsNodeHandle objects before the overall process \\(linux process, not DsProcess here\\) is over.   But it does make unit-testing DsNodeHandle-based objects impossible.\r\n\r\n‌\r\n\r\nThis PR resolves the issue by doing the following:\r\n\r\n* Removes the DsNodeHandle class entirely\r\n* Moves the DsCallbackQueue object into the DsAsio class\r\n* DsConnection no longer requires any type of node handle\r\n* DsSerial and DsUdp *do* require a ros::NodeHandle, but only to be passed to their setup\\(\\) function.  No node handle is retained.\r\n* DsProcess::nodeHandle\\(\\) now accepts a string argument and returns a ros::NodeHandle \\(not a ds\\_asio::DsNodeHandle\\* pointer!\\)  AFTER replacing the node handle's callback queue with the DsCallbackQueue from DsProcess' internal DsAsio object.\r\n* Unit tests added to ensure proper cleanup after DsProcess quits.\r\n\r\n‌\r\n\r\nThe change to DsProcess::nodeHandle\\(\\) is the worst offender of this PR.  There's lots of \"nodeHandle\\(\\)->\" like code that breaks now that we're not returning a pointer.  I've gone through the following repos and pushed branches named \"ds\\_nodehandle\\_refactor\" for many **but not all** of the ds\\* packages.  \r\n\r\n‌\r\n\r\nThe following repositories have branches pushed with the required changes:\r\n\r\n* ds\\_base \r\n* ds\\_components \r\n* ds\\_control\r\n* ds\\_gui \\(no changes needed\\)\r\n* ds\\_msgs \\(no changes needed\\)\r\n* ds\\_sensors \r\n* ds\\_sim \\(no changes needed\\)\r\n* sentry\\_components \r\n* sentry\\_config \\(no changes needed\\)\r\n* sentry\\_control\r\n* sentry\\_msgs \r\n* sentry\\_sim \r\n\r\n‌\r\n\r\nWe can merge this PR once  everyone has their repos not listed above ready to go.  Like the other PR's to ds\\_base,  it's best not to wait too long.   Let's shoot for Wed.\r\n\r\n‌", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_base/pull-requests/3", "pr_title": "Qt-style PIMPL reqactor", "username": "zac berkowitz", "status": "Merged", "posted_on": "2018-01-26T17:24:26.668253+00:00", "pr_contents": "Another final ds\\_base refactor...\r\n\r\nThanks to Ian's written guidelines we now have some specific boundaries to how the whole ds\\_base ecosystem is supposed to behave.\r\n\r\nBiggest changes:\r\n\r\n* All classes are non-copyable\r\n* All PIMPL objects are `unique_ptr`s instead of `shared_ptr`s\r\n* No templated helper functions in `DsProcess`\r\n* All PIMPL headers made truly private \\(removed from `include/`\\)\r\n* Adoption of Qt-style helper macros \\(in `ds_global.h`\\)\r\n\r\n‌\r\n\r\nI rewrote `EXTENDING.md` to reflect the changes and it should be up to date. I've tested these changes against `ds_sensors` after making the required modifications to that library.\r\n\r\n‌\r\n\r\nSteps to merging:\r\n\r\n* Figure out any additional changes we'd like\r\n* Modify existing code bases \\(like `ds_nav`\\) to use the new layout\r\n\r\nList of repos to update, cross out when done:\r\n\r\n* ~~ds\\_sensors~~\r\n* ~~ds\\_components~~\r\n* ds\\_nav\r\n* sentry\\_components", "pr_comments": ["Added list of repos that need updating.  Crossed out completed."]},
{"url": "https://bitbucket.org/whoidsl/ds_base/pull-requests/1", "pr_title": "Optional ros init", "username": "zac berkowitz", "status": "Merged", "posted_on": "2017-12-21T13:39:05.673102+00:00", "pr_contents": "* Added default constructor for DsAsio, DsProcess\r\n* Added run method.\r\n* Added some comments.", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_sensors/pull-requests/11", "pr_title": "Added xacro files to show some new sensors", "username": "Ian Vaughn", "status": "Merged", "posted_on": "2019-12-05T22:08:13.840827+00:00", "pr_contents": "", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_sensors/pull-requests/10", "pr_title": "Dev/3dmgx5", "username": "Ian Vaughn", "status": "Merged", "posted_on": "2019-12-04T14:44:48.646271+00:00", "pr_contents": "* Initial checkin\r\n* Renamed, mostly stubbed out.\r\n* Initial stubs. Packetization working now\r\n* Basic outputs working\r\n* 3DM-GX5 is now as good as we can do without a PPS for testing\r\n* Updates from testing on vehicle\r\n\r\n‌", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_sensors/pull-requests/9", "pr_title": "Updated NortekDVL tests to reflect new phased array dvl type", "username": "Isaac Vandor", "status": "Merged", "posted_on": "2019-08-13T15:28:41.580431+00:00", "pr_contents": "* Fixed failing nortek dvl tests by adding new phased array dvl type", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_sensors/pull-requests/8", "pr_title": "New Nortek dvl driver", "username": "Isaac Vandor", "status": "Merged", "posted_on": "2019-08-09T19:32:34.411815+00:00", "pr_contents": "* New Nortek DVL driver for parsing Nortek DF21 Messages", "pr_comments": ["This is very close.\n\n1. Update comments on test cases, unless you really are looking for 7f7f patterns.\n2. What’s with all these “TODO: Convert to df21” comments?\n3. We need to add support for the DVL type in the DVL, Ranges, and DF21 message.  This was added since you first looked at the RDI.\n4. Before we go into tank testing, let’s confirm a couple things:\n\n* Does the DVL operate assuming ground-stationary or instrument-stationary?  The RDIs assume instrument-stationary, and this code appears to include the transform to address that-- which is fine if its true\n* Does the Nortek report ranges or altitudes?  This code converts altitudes back to ranges-- again, that’s fine if its true.\n\n"]},
{"url": "https://bitbucket.org/whoidsl/ds_sensors/pull-requests/7", "pr_title": "Dev/depth base class", "username": "Isaac Vandor", "status": "Merged", "posted_on": "2019-08-09T16:57:05.064533+00:00", "pr_contents": "* ISD4000 drive using new depthsensor base class\r\n* updated isd4000 gtests\r\n* Removing extraneous things and simplifying\r\n\r\n‌\r\n\r\nThis needs to target master, not the depth base class", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_sensors/pull-requests/5", "pr_title": "New ISD4000 driver using depth sensor base class", "username": "Isaac Vandor", "status": "Merged", "posted_on": "2019-08-07T17:56:03.039164+00:00", "pr_contents": "* Created an ISD4000 driver using new depthsensor base class", "pr_comments": ["Let’s simplify this a bit.  It looks like you can remove:\n\n1. The private class, d\\_ptr, and all DS\\_D stuff \\(which wasn’t doing anything anyway\\)\n2. setupParameters\n3. setup\n\nYou should be able to make just the requested changes, re-commit to this branch, and the pull request will update.", "The bitbucket UI really doesnt like what I have to say, but it should be \nupdated now.\n"]},
{"url": "https://bitbucket.org/whoidsl/ds_sensors/pull-requests/4", "pr_title": "Moved guts of pressure/depth conversion and all wiring to a separate base class, which the paro now uses.  Needs on-vehicle testing", "username": "Ian Vaughn", "status": "Merged", "posted_on": "2019-08-06T19:28:48.094592+00:00", "pr_contents": "", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_sensors/pull-requests/3", "pr_title": "Dev/dvl pioneer", "username": "Ian Vaughn", "status": "Merged", "posted_on": "2019-08-06T15:07:01.268430+00:00", "pr_contents": "* Added support for new RDI Pioneer datagrams. Still not passing high-res data to outputs yet\r\n* Commented out some annoying error messages\r\n* Fixes from well testing; mostly adding signs to high-res fields\r\n* Fixed bugs found from in-water testing with Pioneer. Also now use high-resolution fields to populate standard fields in DVL and Range3D messages\r\n* Refactored and greatly simplified tests. Added pioneer test. DVL tests now run as regular gtests and are much easier to debug", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_sensors/pull-requests/1", "pr_title": "tracking ds_nodehandle_refactor", "username": "zac berkowitz", "status": "Merged", "posted_on": "2018-02-12T22:35:05.935264+00:00", "pr_contents": "Waiting for [https://bitbucket.org/whoidsl/ds\\_base/pull-requests/4/](https://bitbucket.org/whoidsl/ds_base/pull-requests/4/)", "pr_comments": []},
{"url": "https://bitbucket.org/AndyZe/pid/pull-requests/11", "pr_title": "Bug fix for angle wrapping always resetting filtered and integral error", "username": "Andrew J Zelenak", "status": "Open", "posted_on": "2019-08-19T04:58:17.478958+00:00", "pr_contents": "", "pr_comments": []},
{"url": "https://bitbucket.org/AndyZe/pid/pull-requests/9", "pr_title": "Option to use unfiltered error for the proportional term", "username": "Thanuja Ambegoda", "status": "Open", "posted_on": "2018-06-08T09:01:07.920258+00:00", "pr_contents": "For some applications, using the filtered error for the P term causes an amplification in the noise. This is especially unhelpful if the input error is quite smooth \\(depending on the application\\) and gives better results in terms of stability. Perhaps for future work, it would be useful to allow two different filtering frequency setting for P and D error terms. \r\n\r\nThe new option `p_filtered_error` is set to `true` by default that uses the  filtered error for the proportional error calculation \\(as before\\). If set to `false`using dynamic reconfigure or a custom launch file, it will use the raw error for the P term. \r\n\r\n* \\[pid\\] added option p\\_filtered\\_error to disable filtering proportional error term. some applications work better without filtering\r\n* \\[pid\\] fixed type error in parameter reading\r\n* \\[pid\\] added option to use filtered error for p as dynamic cfg param\r\n\r\n‌", "pr_comments": ["p.s. I introduced this fix because I observed some sudden jumps in the filtered error signal although there were not much of a problem in the original \\(unfiltered\\) error signal which resulted in unwanted corrections. This was a bit severe especially when the input error signal stops \\(results in an unwanted jump at the end\\). This could potentially be something to do with the exact filtering implemented. Before going into the details, I added this option to disable the filtering and already it was much better for my application.", "Do you have any plots to verify this? I tested the filtering algorithm with MATLAB but maybe I missed this scenario. I can dust off my test code and try it again.\n\n‌\n\nThis seems like a hackish fix that I’d rather not implement."]},
{"url": "https://bitbucket.org/udg_cirs/cola2_core/pull-requests/2", "pr_title": "Const correctness", "username": "Miquel Massot Campos", "status": "Open", "posted_on": "2017-02-16T06:43:54.565638+00:00", "pr_contents": "", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_base/pull-requests/2", "pr_title": "Adding blocking_receive to DsConnection", "username": "zac berkowitz", "status": "Open", "posted_on": "2018-01-23T19:28:31.027432+00:00", "pr_contents": "A new branch of ds\\_asio is up for you consideration named 'blocking\\_asio\\_tests'.  As the name implies it enables blocking reads from DsConnection-derived classes with timeouts.  I have written a test named 'test\\_serial\\_blocking\\_io' that works the solution from raw serial port file descriptors to boost::asio only interaction through the final ds\\_asio-based changes.\r\n\r\nThis is a potentially large behavior change and I'd like people to review this before the changes are approved.  This does open up a way to block a process indefinitely if users are stupid.  However, the upside is that it greatly reduces the complexity of the traditional send/receive pair, for which we don't have a current async solution.\r\n\r\nLike the serial port fixes from last week, this code is strictly linux-only and uses lower level calls that boost does not abstract.\r\n\r\nShort summary of changes:\r\n\r\n* DsConnection\r\n\r\n    * changed 'receive' method to 'start\\_async\\_receive'\r\n    * added 'stop\\_async\\_receive' method\r\n    * added 'blocking\\_receive' method\r\n    * added 'native\\_handle' method\r\n    \r\n* DsSerial\r\n\r\n    * implemented 'stop\\_async\\_receive'\r\n    * implemented 'blocking\\_receive'\r\n    * implemented 'native\\_handle'\r\n    * Added protected constructor to bypass parameter lookup\r\n    \r\n* DsUdp\r\n\r\n    * implemented 'stop\\_async\\_receive'\r\n    * implemented 'blocking\\_receive'\r\n    * implemented 'native\\_handle'\r\n    \r\n* DsNodeHandle\r\n\r\n    * removed call to ros::NodeHandle destructor in ~DsNodeHandle\r\n    * Tagged raw pointers as possible memory leak\r\n    \r\n\r\n‌", "pr_comments": ["Waiting for PR #2 to resolve.", "Closing for now."]},
{"url": "https://bitbucket.org/whoidsl/ds_nav/pull-requests/1", "pr_title": "Added commands to align eigen members for 32bit computers", "username": "William Bernardoni", "status": "Open", "posted_on": "2018-08-08T15:15:13.205072+00:00", "pr_contents": "", "pr_comments": []},
{"url": "https://bitbucket.org/_Luc_/hand_control/pull-requests/1", "pr_title": "main.tex edited online with Bitbucket", "username": "Paul Janin", "status": "Declined", "posted_on": "2015-03-30T12:03:05.887821+00:00", "pr_contents": "main.tex edited online with Bitbucket", "pr_comments": []},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/15", "pr_title": "Solver baseclass", "username": "Davide Faconti", "status": "Declined", "posted_on": "2016-11-09T13:45:33.977454+00:00", "pr_contents": "Hi,\r\n\r\nI propose this PR. Unfortunately It turned out being a little too \"bulky\".\r\n\r\n1) I am working on a third solver based on qpOASES and to avoid errors and duplicated code, I propose to use a base class and to have ChainIkSolverPos_TL and NLOPT_IK inheriting from it.\r\n\r\n2) Some minor cleanups. Here and there. In particular, I suggest a more consistent namespace and less copy and paste. I also prefer less cryptic names. \r\nI understand that this might occasionally fall into the \"personal taste\" field.  \r\n\r\n3) A less misleading information from the benchmark test. Instead of informing the user of the average time including both successful and failed IK, inform only of the average speed of successful samples. This is IMO a less biased source of information, since it actually inform about the ability of the algorithm to converge. ", "pr_comments": ["May be this PR is too big, do you want me to split it in smaller ones?", "The main problem is that I have private v2.0 that we've been using on a commercial project, and I've been hoping to find time to make public,  that probably won't be consistent with any of this.  If you make it smaller, it might make it easier for me to also sync the changes into v2.0.", "Ok, I see. When are you releasing 2.0?\n\nMy main motivation for having a baseclass is to add other solvers, in particular [Ipopt](https://projects.coin-or.org/Ipopt), [qpOases](https://projects.coin-or.org/qpOASES) and [lma_kinematics](https://github.com/ros-planning/moveit/tree/kinetic-devel/moveit_kinematics/lma_kinematics_plugin)\nIdeally I also would like to select which one I use at runtime (yaml file?)\n\nAdditionally, I would also like to be able to extend the API to allow underconstrained IK, i.e task that control only 3 DoF or 5 DoF (very common in my use cases).\n\nLast but not least, it would be nice to add a secondary solver for redundant manipulation to find a solution that avoid singularities or reduces the amount of motion.\n\nAs you can see, I have a bold vision for this library ;)\n\nThe question is if we want to work together or if we have different goals or agendas.\n\n", "1) the solver already allows underconstrained ik.  If you set the bounds to be large (or fltmax) that dimension becomes unconstrained.  That was kind of the point of the original work on this.\n\n2) the manip-product condition already avoids singularities by maximizing manipulatity metric and pushing away from limits.\n\nI feel like maybe you are trying to push the API on this without really understanding what is already there.  Perhaps bounds and conditions could be better documented.", "1) Indeed, you are right. Forget what I said.\n2) Inspecting the source code it is really hard to understand how this is done. APPARENTLY you just run the solver multiple times, using random seeds, until you get a timeout. \nThis is a quite different from what I was thinking, i.e. exploring moving in the null-space of the first solution. Honestly, though, I have no data/benchmark to know which approach is more robust... yet ;)\n\nForgetting these two points, do you see any value in the ability to use different solvers? Which are the goals/improvement of 2.0, if I may ask?", "On  point 2, you are correct.  That is what I am doing, and it is different from exploring the null space directly.  The issue with exploring the nullspace directly using the nonlinear optimization is that the null space criteria becomes the function to minimze and the final position becomes a constraint, but given the large search spaces of 6/7-DOF chains, this doesn't converge in any reasonable time.  So, you are back to doing typical Newton-style gradient descent like KDL.  I'm not saying this is bad, but its kind of different from the \"style\" of TRAC-IK.    Additionally, in version 2.0, there is also collision detection folded into the solver as well, which makes the traditional search using the null space even harder.  This is why I've stuck with the apporach of \"find as many solutions as possible and then filter/sort at the end\".  \n\nI think the software could benefit from different solvers, but my plan for TRAC-IK was never a \"Framework\" to allow user to pick and choose at runtime.  Ideally, there would be a small, set number of solvers that have different benefits and advantages that run in parallel.  If we can show that new solvers improve the TRAC-IK solution rate even more (or reduce solve time), then I'm all for it, but I'd like it to just become the default state of the solver.  That said, it should be easier to swap in new solvers to do these tests -- either by substituting for one of the current two solvers, or to run together with them as a third solver.\n\nv2 has a Cartesian trajectory generator that takes the non-collision goal IK, either min-distance or manip-product condition, as provides a \"straight line\" trajectory between the start and end poses that is guaranteed to not have joint rollouts and not collide with obstacles (currently only self collisions, but I need to add a \"Planning Scene\" like MoveIt! has).  This is all completely independent of MoveIt!, but eventually it would be nice to make it a MoveIt! \"capabality\" plugin that could replace the underwhelming Cartesian motion default in MoveIt!.\n\nI'm excited about your enthusiasm in helping extend this.  Let's continue the discussion, and after this holiday week, I'll try to spend time next week at least getting a 2.0rc branch into the public repo for you to start examining.  Perhaps your Pull Request will merge in smoothly, but I suspect the header/API changed enough to where that isn't the case.\n", "ok, I guess that for the time being I will just close this and wait for 2.0", ""]},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/16", "pr_title": "Adding a Python wrapper for TRAC IK using SWIG", "username": "Sam Pfeiffer", "status": "Declined", "posted_on": "2017-02-03T03:20:43.600309+00:00", "pr_contents": "Hello,\r\n\r\nI made a Python wrapper for the TRAC IK solver. It is generated using SWIG, with a new constructor to make it more Python friendly and then wrapped a little bit more to make it easier to use and have docs & so.\r\n\r\nIt's independent form the rest of the repo. It just depends on trac_ik_lib. If you don't wanna merge it I'll publish it separately if you prefer.\r\n\r\nAs a note, this was the first time I wrap some C++ with SWIG (and my C++ is not very strong). Comments and/or fixes are welcome (but the wrapper works).", "pr_comments": ["Thanks.  I am extremely busy with other deadlines right now, but hope to get to this PR eventually.", "Hello, no hurry, but just bumping in case you think you may have time to merge this. I've got a few friends that tried it and liked it. ", "I just made a local branch of this and merged the current master back in.  It doesn't seem to compile.\n\n\n\n```\n#!bash\n/home/pbeeson/projects/TRAC-IK/build/trac_ik/trac_ik_python/trac_ik_wrapPYTHON_wrap.c: In function ‘PyObject* _wrap_runKDL(PyObject*, PyObject*)’:\n/home/pbeeson/projects/TRAC-IK/build/trac_ik/trac_ik_python/trac_ik_wrapPYTHON_wrap.c:16890:18: error: ‘runKDL’ is not a member of ‘TRAC_IK’\n   result = (bool)TRAC_IK::runKDL((KDL::JntArray const &)*arg1,(KDL::Frame const &)*arg2);\n                  ^\n/home/pbeeson/projects/TRAC-IK/build/trac_ik/trac_ik_python/trac_ik_wrapPYTHON_wrap.c: In function ‘PyObject* _wrap_runNLOPT(PyObject*, PyObject*)’:\n/home/pbeeson/projects/TRAC-IK/build/trac_ik/trac_ik_python/trac_ik_wrapPYTHON_wrap.c:16927:18: error: ‘runNLOPT’ is not a member of ‘TRAC_IK’\n   result = (bool)TRAC_IK::runNLOPT((KDL::JntArray const &)*arg1,(KDL::Frame const &)*arg2);\n                  ^\ntrac_ik/trac_ik_python/CMakeFiles/_trac_ik_wrap.dir/build.make:73: recipe for target 'trac_ik/trac_ik_python/CMakeFiles/_trac_ik_wrap.dir/trac_ik_wrapPYTHON_wrap.c.o' failed\nmake[2]: *** [trac_ik/trac_ik_python/CMakeFiles/_trac_ik_wrap.dir/trac_ik_wrapPYTHON_wrap.c.o] Error 1\nCMakeFiles/Makefile2:3018: recipe for target 'trac_ik/trac_ik_python/CMakeFiles/_trac_ik_wrap.dir/all' failed\nmake[1]: *** [trac_ik/trac_ik_python/CMakeFiles/_trac_ik_wrap.dir/all] Error 2\nMakefile:138: recipe for target 'all' failed\nmake: *** [all] Error 2\n```\n", "I'm trying to fix it but I can't seem to compile on Ubuntu 14.04 and ROS Indigo the tag 1.4.8:\n\n```bash\nStarting  >>> trac_ik_lib                                                                                                                                                                                                             \n______________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nErrors     << trac_ik_lib:make /home/sam/magiclab/fix_trac_ik2/logs/trac_ik_lib/build.make.001.log                                                                                                                                    \n/home/sam/magiclab/fix_trac_ik2/src/trac_ik/trac_ik_lib/src/trac_ik.cpp: In constructor ‘TRAC_IK::TRAC_IK::TRAC_IK(const string&, const string&, const string&, double, double, TRAC_IK::SolveType)’:\n/home/sam/magiclab/fix_trac_ik2/src/trac_ik/trac_ik_lib/src/trac_ik.cpp:82:5: error: ‘JointConstSharedPtr’ is not a member of ‘urdf’\n     urdf::JointConstSharedPtr joint;\n     ^\n/home/sam/magiclab/fix_trac_ik2/src/trac_ik/trac_ik_lib/src/trac_ik.cpp:82:31: error: expected ‘;’ before ‘joint’\n     urdf::JointConstSharedPtr joint;\n                               ^\n/home/sam/magiclab/fix_trac_ik2/src/trac_ik/trac_ik_lib/src/trac_ik.cpp:91:7: error: ‘joint’ was not declared in this scope\n       joint = robot_model.getJoint(chain_segs[i].getJoint().getName());\n       ^\nmake[2]: *** [CMakeFiles/trac_ik.dir/src/trac_ik.cpp.o] Error 1\nmake[1]: *** [CMakeFiles/trac_ik.dir/all] Error 2\nmake: *** [all] Error 2\ncd /home/sam/magiclab/fix_trac_ik2/build/trac_ik_lib; catkin build --get-env trac_ik_lib | catkin env -si  /usr/bin/make --jobserver-fds=6,7 -j; cd -\n```\n\ntag 1.4.7 does compile, so I'll try to fix it there for now.", "SWIG can't figure out the scope of runKDL and runNLOPT since this commit: https://bitbucket.org/traclabs/trac_ik/commits/2b7fc22392299c76735980cf3f7ea29bd181e278\n\nI tried for a while to workaround it, but I found no way.\n\nSincerely the best approach would be to have a constructor like the one I made at:\n\nhttps://bitbucket.org/awesomebytes/trac_ik/src/29b98e663d8a89fe03a619cbd070d09fcaadebb6/trac_ik_python/swig/trac_ik_wrap.i?at=python_wrapper_swig_based&fileviewer=file-view-default#trac_ik_wrap.i-50:196\n\nBut in the main trac_ik_lib, then making wrappers would be way easier.", "OK.  Maybe I can find some time to look at this in a few weeks.  Unfortunately, this is the issue with having multiple PRs coming from people that use this in different ways.  They aren't always compatible.  Sorry I didn't get this merged sooner, but life was crazy in 2017.", "BTW, 1.4.8 seems to be compiling fine for the ROS releases of indigo packages.  You need to make sure you have the latest indigo packages, especially for URDF.", "No worries, I'll try to propose a PR on the main lib (just a new constructor that accepts a string as the URDF) with a new SWIG wrapper based on that constructor if you think you would accept such an addition.\n\nWould this look good for you?\n```c++\nTRAC_IK(const std::string& base_link, const std::string& tip_link, double timeout, double epsilon, const std::string& solve_type=\"Speed\",  const std::string& urdf_string)\n```\n", "Is the URDF string a parameter location, then it does URDF parsing?  I don't like having to add that to TRAC-IK.  ALso this assumes limits are set after construction?  That could be ok but we would need to  enforce this is set before moving forward.", "It's exactly the same you are doing here:\n\nhttps://bitbucket.org/traclabs/trac_ik/src/2b7fc22392299c76735980cf3f7ea29bd181e278/trac_ik_lib/src/trac_ik.cpp?at=master&fileviewer=file-view-default#trac_ik.cpp-43\n\nBut instead of getting the URDF from the param server you get it from a raw string (I literally copy pasted that function in my trac_ik_wrap.i file but with that minor difference). This is necessary because the Python wrapper can't initialize the ROS node (`ros::init`), that must be done in the C++ code, so in order to workaround that, as the ROS part is only used to get the parameter of the robot description, I just accept the raw string of the robot description."]},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/20", "pr_title": "Adding Python SWIG wrapper", "username": "Sam Pfeiffer", "status": "Declined", "posted_on": "2018-01-04T06:07:30.352759+00:00", "pr_contents": "Continuing the work from: https://bitbucket.org/traclabs/trac_ik/pull-requests/16\r\n\r\nI managed to get to compile the latest version (I was indeed missing a URDF library update) by using some SWIG %ignore features.\r\n\r\nTake a look and let me know what you think!", "pr_comments": ["Why exactly did you do this?\n\nCan't you just have the normal loading in a launch file?\n\n```\n#!xml\n\n  <param name=\"robot_description\" command=\"$(find xacro)/xacro '$(find pr2_description)/robots/pr2.urdf.xacro'\" />\n```\n\nEven if you just use rosparam command line stuff in your script, you shouldn't need to add a txt copy of pr2 urdf to my repo.\n\n", "Sorry about that. It was just easier than installing the PR2 repos to just\nhave a working urdf to test the wrapper in the machine I was working.\n\nI'll delete it when I'm on a computer later on today."]},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/19", "pr_title": "Use Nonius for more informative benchmark", "username": "Davide Faconti", "status": "Declined", "posted_on": "2017-11-08T12:56:11.231631+00:00", "pr_contents": "Hi,\r\n\r\nTo get better statistics during the benchmark, I propose this upgrade of the test using Nonius.\r\n\r\n‌\r\n\r\nCheers", "pr_comments": []},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/13", "pr_title": "FASTER. using nullspace motion instead of random seed in kdl_tl", "username": "Davide Faconti", "status": "Declined", "posted_on": "2016-08-01T17:41:20.432819+00:00", "pr_contents": "1) Using KDL::ChainIkSolverVel_pinv_givens improve the baseline for KDL unmodified\r\n2) KDL_TL is now much faster than NLOPT and equally robust", "pr_comments": ["KDL::ChainIkSolverVel_pinv_givens hangs on my very first test robot.  Not sure why.  Perhaps it works for PR2, but I suspect it has issues with certain chains for some reason.", "Will try your PR with non-givens version", "please just change the ChainIkSolverVel_pinv_givens for ChainIkSolverVel_pinv in both \n\nik_tests.cpp and kdl_tl.hpp\n\nIt works for me, Improvement in speed is not so dramatic anymore but still very very interesting.\n\n", "I think I need read access to your repo to be able to get this PR.  I tried the traditional Bitbucket stuff and nothing works.  I think it all assumes I have read access to whatever you are submitting hte pull request from (branch off my repo or fork in this instance).", "try again", "Fetch works now.  Thanks.", "Looking forward to see the new benchmarks ;)\n", "You are correct that for the PR2, your code does show a slight speed up (non-givens) and improved results for KDL.  I'm still trying with and without random restarts (always with your nullspace changes) and with the full TRAC-IK.    however, the results for OTHER non-PR2 manipulators are not as good.  Some being worse.  Notably, the Jaco2 arm, Denso arm, Robosimian arm, Valkrie arm etc.  perform noticeably worse than the previous KDL with \"wrapping\" and random starts.\n\nBelow the first line is the original, and the second line for each arm is the results from your current master (with Givens taken out because the first chain -- Atlas 2013 immediately hangs with givens).\n\nAtlas 2013 arm | 6 | **77.30%** | 1.26ms | **96.60%** | 0.40ms | **99.90%** | 0.30ms\n\nAtlas 2013 arm | 6 | **74.70%** | 1.42ms | **87.60%** | 1.63ms | **99.80%** | 0.67ms\n\nAtlas 2015 arm | 7 | **76.00%** | 1.47ms | **92.10%** | 0.90ms | **99.50%** | 0.48ms\n\nAtlas 2015 arm | 7 | **81.60%** | 1.30ms | **83.10%** | 1.34ms | **98.80%** | 0.57ms\n\nBaxter arm | 7 | **62.90%** | 2.11ms | **91.50%** | 0.93ms | **99.40%** | 0.62ms\n\nBaxter arm | 7 | **71.50%** | 1.98ms | **73.40%** | 2.06ms | **98.70%** | 0.81ms\n\nDenso VS-068 | 6 | **25.90%** | 3.77ms | **98.50%** | 0.40ms | **99.30%** | 0.40ms\n\nDenso VS-068 | 6 | **25.00%** | 2.66ms | **44.70%** | 3.66ms | **99.00%** | 0.79ms\n\nFanuc M-430iA/2F | 5 | **21.30%** | 3.98ms | **86.40%** | 0.99ms | **98.80%** | 0.58ms\n\nFanuc M-430iA/2F | 5 | **25.20%** | 3.14ms | **35.70%** | 3.72ms | **98.70%** | 1.02ms\n\nFetch arm | 7 | **93.60%** | 0.67ms | **93.80%** | 0.65ms | **100.00%** | 0.38ms\n\nFetch arm | 7 | **98.30%** | 0.61ms | **98.30%** | 0.60ms | **100.00%** | 0.47ms\n\nJaco2 | 6 | **25.50%** | 3.82ms | **97.50%** | 0.58ms | **99.10%** | 0.56ms\n\nJaco2 | 6 | **22.90%** | 3.85ms | **24.90%** | 4.18ms | **97.30%** | 1.02ms\n\nKUKA LBR iiwa 14 R820 | 7 | **39.60%** | 3.27ms | **93.40%** | 0.79ms | **99.90%** | 0.44ms\n\nKUKA LBR iiwa 14 R820 | 7 | **0.00%** | 5.12ms | **0.00%** | 5.13ms | **99.30%** | 0.95ms\n\nKUKA LWR 4+ | 7 | **67.20%** | 1.92ms | **95.10%** | 0.63ms | **100.00%** | 0.45ms\n\nKUKA LWR 4+ | 7 | **71.70%** | 1.83ms | **76.00%** | 1.88ms | **99.60%** | 0.90ms\n\nPR2 arm | 7 | **84.40%** | 1.34ms | **87.70%** | 1.26ms | **99.70%** | 0.55ms\n\nPR2 arm | 7 | **93.80%** | 0.92ms | **94.00%** | 0.92ms | **99.80%** | 0.59ms\n\nNASA Robonaut2 'grasping leg' | 7 | **61.00%** | 2.29ms | **86.90%** | 1.18ms | **99.20%** | 0.71ms\n\nNASA Robonaut2 'grasping leg' | 7 | **66.30%** | 2.34ms | **69.70%** | 2.50ms | **97.60%** | 1.34ms\n\nNASA Robonaut2 'leg' + waist + arm | 15 | **98.60%** | 0.70ms | **98.60%** | 0.69ms | **99.70%** | 0.71ms\n\nNASA Robonaut2 'leg' + waist + arm | 15 | **99.90%** | 0.72ms | **99.90%** | 0.72ms | **100.00%** | 0.79ms\n\nNASA Robonaut2 arm | 7 | **87.00%** | 0.99ms | **94.30%** | 0.73ms | **99.70%** | 0.49ms\n\nNASA Robonaut2 arm | 7 | **89.80%** | 0.87ms | **90.90%** | 0.89ms | **99.00%** | 0.58ms\n\nNASA Robosimian arm | 7 | **62.50%** | 2.44ms | **100.00%** | 0.36ms | **99.90%** | 0.38ms\n\nNASA Robosimian arm | 7 | **55.40%** | 3.36ms | **55.70%** | 3.37ms | **99.40%** | 0.80ms\n\nTRACLabs modular arm | 7 | **79.80%** | 1.31ms | **94.80%** | 0.63ms | **99.90%** | 0.41ms\n\nTRACLabs modular arm | 7 | **49.90%** | 2.81ms | **51.20%** | 2.86ms | **99.90%** | 0.86ms\n\nUR10 | 6 | **36.70%** | 3.26ms | **86.50%** | 0.88ms | **99.40%** | 0.47ms\n\nUR10 | 6 | **40.80%** | 2.91ms | **51.80%** | 3.37ms | **100.00%** | 0.61ms\n\nUR5 | 6 | **34.30%** | 3.37ms | **90.10%** | 0.70ms | **99.70%** | 0.36ms\n\nUR5 | 6 | **41.50%** | 2.97ms | **49.60%** | 3.40ms | **99.80%** | 0.69ms\n\nNASA Valkyrie arm | 7 | **45.40%** | 2.99ms | **90.50%** | 1.26ms | **99.70%** | 0.64ms\n\nNASA Valkyrie arm | 7 | **59.50%** | 2.33ms | **62.50%** | 2.42ms | **99.70%** | 0.72ms\n\n", "OMG. this is horrible. Fooled by the ONLY false positive in the entire table :(", "Yep.  Kinematics with Joint Limits seems to be highly variable to even small configuration differences.  The performance of kinematics libraries on Atlas using standard nullspace techniques is what led to TRAC-IK to begin with."]},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/12", "pr_title": "Cleanup", "username": "Davide Faconti", "status": "Declined", "posted_on": "2016-07-22T15:41:14.280245+00:00", "pr_contents": "* Removed some copy and paste + fixed potential problem (C99 style array with variable size)\r\n* 150 lines less of copied and pasted stuff\r\n\r\nUsing lambdas and function pointers might look complicate for someone, but it will allow in the long term to give to any user the opportunity to provide its own implementation of function that calculate the error in cartesian space according to his/her desired criteria", "pr_comments": ["So, I just ran this through my test suite, and it looks like commit c130db2 adds  non-neglible time to the TRAC-IK solve.  This is outside randomness because it's consistent over several runs of 10,000 trials with different starting random seeds.  See the last column of the results below.\n\nAFTER  c130db:\n\nAtlas 2013 arm | 6 | **77.30%** | 1.26ms | **96.70%** | 0.39ms | **100.00%** | 0.34ms\n\nAtlas 2015 arm | 7 | **76.00%** | 1.47ms | **92.70%** | 0.84ms | **99.30%** | 0.64ms\n\nBaxter arm | 7 | **62.90%** | 2.11ms | **91.50%** | 0.92ms | **98.90%** | 0.72ms\n\nDenso VS-068 | 6 | **25.90%** | 3.77ms | **98.50%** | 0.41ms | **99.20%** | 0.65ms\n\nFanuc M-430iA/2F | 5 | **21.30%** | 3.98ms | **86.40%** | 0.99ms | **97.30%** | 0.87ms\n\nFetch arm | 7 | **93.60%** | 0.66ms | **93.80%** | 0.65ms | **100.00%** | 0.50ms\n\nJaco2 | 6 | **25.50%** | 3.82ms | **97.50%** | 0.60ms | **98.90%** | 0.61ms\n\nKUKA LBR iiwa 14 R820 | 7 | **39.60%** | 3.29ms | **93.10%** | 0.80ms | **99.80%** | 0.59ms\n\nKUKA LWR 4+ | 7 | **67.10%** | 1.94ms | **94.70%** | 0.64ms | **100.00%** | 0.47ms\n\nPR2 arm | 7 | **84.30%** | 1.34ms | **87.30%** | 1.28ms | **98.50%** | 0.96ms\n\nNASA Robonaut2 'grasping leg' | 7 | **60.90%** | 2.30ms | **86.80%** | 1.20ms | **98.60%** | 0.84ms\n\nNASA Robonaut2 'leg' + waist + arm | 15 | **98.60%** | 0.70ms | **98.60%** | 0.70ms | **98.60%** | 0.81ms\n\nNASA Robonaut2 arm | 7 | **87.00%** | 1.02ms | **94.30%** | 0.74ms | **99.20%** | 0.62ms\n\nNASA Robosimian arm | 7 | **62.20%** | 2.46ms | **100.00%** | 0.35ms | **99.90%** | 0.44ms\n\nTRACLabs modular arm | 7 | **79.80%** | 1.31ms | **94.80%** | 0.63ms | **100.00%** | 0.52ms\n\nUR10 | 6 | **36.70%** | 3.27ms | **86.50%** | 0.89ms | **99.00%** | 0.57ms\n\nUR5 | 6 | **34.30%** | 3.38ms | **90.10%** | 0.70ms | **98.80%** | 0.54ms\n\nNASA Valkyrie arm | 7 | **45.40%** | 2.99ms | **90.70%** | 1.26ms | **99.40%** | 0.88ms\n\n\nPRIOR TO c130db2:\n\nAtlas 2013 arm | 6 | **77.30%** | 1.26ms | **96.60%** | 0.40ms | **99.90%** | 0.30ms\n\nAtlas 2015 arm | 7 | **76.00%** | 1.47ms | **92.10%** | 0.90ms | **99.50%** | 0.48ms\n\nBaxter arm | 7 | **62.90%** | 2.11ms | **91.50%** | 0.93ms | **99.40%** | 0.62ms\n\nDenso VS-068 | 6 | **25.90%** | 3.77ms | **98.50%** | 0.40ms | **99.30%** | 0.40ms\n\nFanuc M-430iA/2F | 5 | **21.30%** | 3.98ms | **86.40%** | 0.99ms | **98.80%** | 0.58ms\n\nFetch arm | 7 | **93.60%** | 0.67ms | **93.80%** | 0.65ms | **100.00%** | 0.38ms\n\nJaco2 | 6 | **25.50%** | 3.82ms | **97.50%** | 0.58ms | **99.10%** | 0.56ms\n\nKUKA LBR iiwa 14 R820 | 7 | **39.60%** | 3.27ms | **93.40%** | 0.79ms | **99.90%** | 0.44ms\n\nKUKA LWR 4+ | 7 | **67.20%** | 1.92ms | **95.10%** | 0.63ms | **100.00%** | 0.45ms\n\nPR2 arm | 7 | **84.40%** | 1.34ms | **87.70%** | 1.26ms | **99.70%** | 0.55ms\n\nNASA Robonaut2 'grasping leg' | 7 | **61.00%** | 2.29ms | **86.90%** | 1.18ms | **99.20%** | 0.71ms\n\nNASA Robonaut2 'leg' + waist + arm | 15 | **98.60%** | 0.70ms | **98.60%** | 0.69ms | **99.70%** | 0.71ms\n\nNASA Robonaut2 arm | 7 | **87.00%** | 0.99ms | **94.30%** | 0.73ms | **99.70%** | 0.49ms\n\nNASA Robosimian arm | 7 | **62.50%** | 2.44ms | **100.00%** | 0.36ms | **99.90%** | 0.38ms\n\nTRACLabs modular arm | 7 | **79.80%** | 1.31ms | **94.80%** | 0.63ms | **99.90%** | 0.41ms\n\nUR10 | 6 | **36.70%** | 3.26ms | **86.50%** | 0.88ms | **99.40%** | 0.47ms\n\nUR5 | 6 | **34.30%** | 3.37ms | **90.10%** | 0.70ms | **99.70%** | 0.36ms\n\nNASA Valkyrie arm | 7 | **45.40%** | 2.99ms | **90.50%** | 1.26ms | **99.70%** | 0.64ms\n\n\n", "Interesting.\n\nWhat looks weird is that columns 1 and 2 are almost the same, while column 3 is different.\n\nPR2 arm | 7 | 84.30% | 1.34ms | 87.30% | 1.28ms | 98.50% | 0.96ms\n\n\nPR2 arm | 7 | 84.40% | 1.34ms | 87.70% | 1.26ms | 99.70% | 0.55ms\n\nI will try to see if I can replicate these results on my computer with the PR2 example.", "I appreciate the help in trying to make the code cleaner and more extensible, but adding up to 30% more compute time to get cleaner interfaces is not going to be acceptable for this application.  I am going to cherry pick commit 1c02b81, so if you figure out what's causing this increase in compute time and want to resubmit a pull request based on that, I'll gladly look at it again.", "Also, if you do end up resubmitting, please try to merge your branch back in with a copy of my master and submit that that so that you have resolved all conflicts ahead of time.  Thanks!", "Columns 1&2 in my tests use the ChainIkSolverPos_TL directly, without going through TRAC_IK class.  This is why they didn't change.", "Just found the error. it was my fault ;) \n\nNow there is no negligible difference. I will prepare a new pull request. \n\nfor the records, I inverted the lambdas of cartL2NormError and cartSumSquaredError"]},
{"url": "https://bitbucket.org/traclabs/trac_ik/pull-requests/1", "pr_title": "fix build issues", "username": "Seth Gee", "status": "Declined", "posted_on": "2015-08-26T20:05:06.541717+00:00", "pr_contents": "kept bombing out on build not being able to find headers; this seems to fix build issues. running on 14.04", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_base/pull-requests/15", "pr_title": "Dev/ds thrusters", "username": "Isaac Vandor", "status": "Declined", "posted_on": "2019-10-31T20:55:01.532712+00:00", "pr_contents": "* Adding thruster base\r\n* Added new matcher function for thrusters\r\n* trying out new matcher function for checksums after etx\r\n* Updating new matcher function\r\n* Custom matcher function for ds\\_thrusters\r\n\r\n‌", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_base/pull-requests/13", "pr_title": "Add ds_batteries to ds_base", "username": "Isaac Vandor", "status": "Declined", "posted_on": "2019-08-27T19:57:45.265298+00:00", "pr_contents": "* Adding ds\\_batteries setup\r\n* Updating batterybase", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_sensors/pull-requests/6", "pr_title": "Dev nortekdvl1000", "username": "Isaac Vandor", "status": "Declined", "posted_on": "2019-08-09T16:32:59.631979+00:00", "pr_contents": "* Adding Nortek DVL driver to parse Nortek DVL1000 messages", "pr_comments": []},
{"url": "https://bitbucket.org/whoidsl/ds_sensors/pull-requests/2", "pr_title": "ISD4000 depth sensor node", "username": "Isaac Vandor", "status": "Declined", "posted_on": "2019-07-22T19:13:01.856119+00:00", "pr_contents": "Added a depth sensor node for the ISD4000 sensor & revised some Parodigiquartz depth sensing code to be consistent", "pr_comments": ["Let’s rebase this on dev/depth-base-class.  I’d suggest checking out that branch and copy/pasting your changes into it.  You can start with the paro driver in that branch, but strip out any of the paro-specific stuff you don’t need.  Especially anything relating to sending commands.  In fact, the impact subsea is probably just parse\\_pressure and some window dressing \\(launch file, tests, etc\\)\n\nDecent first go."]}
]